Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/backup.po
Languages: it

source: Backup and restore
it: Backup e ripristino

source: NethSecurity provides a flexible and powerful backup system to save and restore your firewall's configuration settings.
it: NethSecurity offre un sistema di backup flessibile e potente per salvare e ripristinare le impostazioni di configurazione del firewall.

source: Access the ``Backup & Restore`` page under the ``System`` section, then click on the :guilabel:`Download backup` button. If the machine has a valid Enterprise subscription, the backup is :ref:`automatic <automatic_backup-section>`.
it: Accedere alla pagina ``Backup & Restore`` nella sezione ``Sistema``, quindi fare clic sul pulsante :guilabel:`Scarica backup`. Se la macchina dispone di un abbonamento Enterprise valido, il backup è :ref:`automatico <automatic_backup-section>`.

source: The backup includes all relevant configuration files and also the list of extra packages installed by the user. The list is saved in the file ``/etc/backup/installed_packages.txt``.
it: Il backup include tutti i file di configurazione rilevanti e anche l'elenco dei pacchetti aggiuntivi installati dall'utente. L'elenco viene salvato nel file ``/etc/backup/installed_packages.txt``.

source: If the backup is encrypted and the password is lost, it will no longer be possible to restore the configuration.
it: Se il backup è crittografato e la password viene persa, non sarà più possibile ripristinare la configurazione.

source: Restore
it: Ripristina

source: The backup can be restored from the the ``Restore`` tab inside the page inside the ``Backup & Restore`` page The user can initiate the restore process by clicking the :guilabel:`Restore backup` button and uploading the backup file. If the machine has a valid Enterprise subscription, the web interface will additionally present a list of backups available from the remote server. If the backup is encrypted, enter the passphrase, and finally, click the :guilabel:`Restore` button to complete the process.
it: Il backup può essere ripristinato dalla scheda ``Ripristino`` all'interno della pagina ``Backup & Restore``. È possibile avviare il processo di ripristino facendo clic sul pulsante :guilabel:`Ripristina backup` e caricando il file di backup. Se la macchina dispone di un abbonamento Enterprise valido, l'interfaccia web presenterà inoltre un elenco di backup disponibili dal server remoto. Se il backup è crittografato, inserire la passphrase e, infine, fare clic sul pulsante :guilabel:`Ripristino` per completare il processo.

source: After the restore the system will be rebooted.
it: Dopo il ripristino il sistema verrà riavviato.

source: If you have installed extra packages, you can restore them by following the instructions in the :ref:`restore_extra_packages-section`.
it: Se sono stati installati pacchetti aggiuntivi, è possibile ripristinarli seguendo le istruzioni nella :ref:`restore_extra_packages-section`.

source: Subscription required
it: Abbonamento richiesto

source: This feature is available only if the firewall has a valid subscription.
it: Questa funzionalità è disponibile solo se il firewall dispone di un abbonamento valido.

source: Backup encryption alert
it: Avviso di crittografia del backup

source: Not encrypting the backup is a security risk. If the backup is not encrypted, anyone with access to the backup file can read the configuration settings stored inside it.
it: Non crittografare il backup rappresenta un rischio per la sicurezza. Se il backup non è crittografato, chiunque abbia accesso al file di backup può leggere le impostazioni di configurazione memorizzate al suo interno.

source: Every night a script will check if the backup is encrypted. If the backup is not encrypted, the script will create an alert inside the remote portal my.nethesis.it or my.nethserver.com. To resolve the alert, the user must enable encryption by clicking on the :guilabel:`Configure passphrase` button and setting a strong password. The alert will be resolved automatically during the nightly cron job.
it: Ogni notte uno script controllerà se il backup è cifrato. Se il backup non è cifrato, lo script creerà un avviso all'interno del portale remoto my.nethesis.it o my.nethserver.com. Per risolvere l'avviso, è necessario abilitare la cifratura facendo clic sul pulsante :guilabel:`Configura passphrase` e impostando una password robusta. L'avviso verrà risolto automaticamente durante il job cron notturno.

source: To disable the alert, access the shell and execute: ::
it: Per disabilitare l'avviso, accedere alla shell ed eseguire: ::

source: Disabling the alert will result in silent failures when the sending of non-encrypted backups is blocked in the future. The administrator will not be notified of these failures, potentially leading to unnoticed backup issues.
it: La disattivazione dell'avviso comporterà errori silenziosi quando l'invio di backup non crittografati verrà bloccato in futuro. L'amministratore non verrà notificato di questi errori, il che potrebbe portare a problemi di backup non rilevati.

source: Backup customization
it: Personalizzazione del backup

source: The backup includes all relevant configuration files. To list the files included in the backup, execute the following command: ::
it: Il backup include tutti i file di configurazione rilevanti. Per elencare i file inclusi nel backup, eseguire il seguente comando: ::

source: The backup can be customized by adding files to the backup list. Just add a new line to the file ``/etc/sysupgrade.conf`` with the path of the file to be included in the backup.
it: Il backup può essere personalizzato aggiungendo file all'elenco di backup. Basta aggiungere una nuova riga al file ``/etc/sysupgrade.conf`` con il percorso del file da includere nel backup.

source: Example: ::
it: Esempio: ::

source: NethSecurity allows the creation of both encrypted and unencrypted backups. Downloading an unencrypted backup is always possible by clicking the :guilabel:`Download unencrypted` button.
it: NethSecurity consente la creazione di backup sia cifrati che non cifrati. È sempre possibile scaricare un backup non cifrato facendo clic sul pulsante :guilabel:`Scarica non cifrato`.

source: To allow downloading an encrypted backup, first click on the :guilabel:`Configure passphrase` button and set a strong password. After that the :guilabel:`Download encrypted` button will become active.
it: Per consentire il download di un backup cifrato, prima fare clic sul pulsante :guilabel:`Configura passphrase` e impostare una password robusta. Successivamente, il pulsante :guilabel:`Scarica cifrato` diventerà attivo.

source: To disable encrypted backups, click on the :guilabel:`Remove passphrase` button and :guilabel:`Download encrypted` button will become inactive.
it: Per disabilitare i backup crittografati, fare clic sul pulsante :guilabel:`Rimuovi passphrase` e il pulsante :guilabel:`Scarica cifrato` diventerà inattivo.

source: Machines with a subscription
it: Macchine con un abbonamento

source: Backups behave differently on devices with an active :ref:`subscription <subscription-section>`.
it: I backup si comportano in modo diverso sui dispositivi con un :ref:`abbonamento <subscription-section>` attivo.

source: Unencrypted backups can still be downloaded directly from the NethSecurity UI by clicking the :guilabel:`Download unencrypted` button.
it: I backup non cifrati possono comunque essere scaricati direttamente dall'interfaccia di NethSecurity facendo clic sul pulsante :guilabel:`Scarica non cifrato`.

source: Encrypted backups are stored in the cloud and integrated with Nethesis Operation Center: this approach simplifies backup management and the restore process for subscription-based devices, which can interact directly with the Operation Center and automatically download the backup when restoring.
it: I backup crittografati sono archiviati nel cloud e integrati con il Nethesis Operation Center: questo approccio semplifica la gestione dei backup e il processo di ripristino per i dispositivi basati su abbonamento, che possono interagire direttamente con l'Operation Center e scaricare automaticamente il backup durante il ripristino.

source: To enable encrypted cloud backups first, a passphrase must be configured by clicking the :guilabel:`Configure passphrase` button and setting a strong password. Once the passphrase is set you can either:
it: Per abilitare i backup cloud crittografati, è necessario prima configurare una passphrase facendo clic sul pulsante :guilabel:`Configura passphrase` e impostando una password sicura. Una volta impostata la passphrase, è possibile:

source: Click the :guilabel:`Run cloud backup` button to create a backup immediately
it: Fare clic sul pulsante :guilabel:`Esegui cloud backup` per creare immediatamente un backup

source: Let the system automatically create a backup every night
it: Lascia che il sistema crei automaticamente un backup ogni notte

source: Every encrypted backup will be sent directly to the Nethesis Operation Center over a secure channel. Please note that the date of the backup is the server date. The dates displayed in the backup list are based on the time of the server storing the backups, not the time of the firewall that created them. This means the dates might differ depending on time zone differences.
it: Ogni backup crittografato verrà inviato direttamente al Nethesis Operation Center tramite un canale sicuro. Si noti che la data del backup corrisponde alla data del server. Le date visualizzate nell'elenco dei backup si basano sull'orario del server che memorizza i backup, e non sull'orario del firewall che li ha creati. Questo significa che le date potrebbero differire a seconda delle differenze di fuso orario.

source: Cloud backups without encryption have been deprecated. For a limited time, backups will still be sent to the cloud even if they are not encrypted. In the near future, only encrypted backups will be sent to the remote server. If you have a valid subscription, please enable encryption to ensure the security of your backup. See also :ref:`backup_encryption-alert` for more information.
it: I backup cloud senza crittografia sono stati deprecati. Per un periodo di tempo limitato, i backup verranno comunque inviati al cloud anche se non sono crittografati. In futuro, solo i backup crittografati verranno inviati al server remoto. Se si dispone di un abbonamento valido, abilitare la crittografia per garantire la sicurezza del backup. Consultare anche :ref:`backup_encryption-alert` per ulteriori informazioni.

source: How to decrypt a backup
it: Come decrittare un backup

source: Normally, encrypted backups are handled directly by NethSecurity during both the creation and restore phases. Once the passphrase is provided, the system automatically encrypts or decrypts the file.
it: Normalmente, i backup crittografati vengono gestiti direttamente da NethSecurity sia durante la fase di creazione che durante quella di ripristino. Una volta fornita la passphrase, il sistema cripta o decripta automaticamente il file.

source: In some cases, however, it may be useful to decrypt the backup externally (outside the firewall) in order to perform checks before restoring it. For this reason, the following ``gpg`` command can be used to decrypt the backup content: ::
it: In alcuni casi, tuttavia, può essere utile decriptare il backup esternamente (al di fuori del firewall) per eseguire controlli prima di ripristinarlo. Per questo motivo, è possibile utilizzare il seguente comando ``gpg`` per decriptare il contenuto del backup: ::
