Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/connections.po
Languages: it

source: Connections
it: Connessioni

source: The connection tracking (Conntrack) is a network feature used in firewalls and routers to monitor and manage the state of active network connections. It tracks the state of each connection, such as new, established, related, or expired, and maintains this information in a connection tracking table. This allows for stateful packet inspection, where packets are inspected based on their connection context, enabling more precise and secure filtering rules. Conntrack also supports Network Address Translation (NAT) by tracking internal to external IP mappings and optimizes performance by quickly dropping packets from invalid or expired connections.
it: Il connection tracking (Conntrack) è una funzionalità di rete utilizzata in firewall e router per monitorare e gestire lo stato delle connessioni di rete attive. Tiene traccia dello stato di ciascuna connessione, come nuova, stabilita, correlata o scaduta, e mantiene queste informazioni in una tabella di connection tracking. Questo consente un'ispezione stateful dei pacchetti, in cui i pacchetti vengono analizzati in base al contesto della connessione, permettendo regole di filtraggio più precise e sicure. Conntrack supporta inoltre la Network Address Translation (NAT) tracciando le associazioni tra indirizzi IP interni ed esterni e ottimizza le prestazioni scartando rapidamente i pacchetti provenienti da connessioni non valide o scadute.

source: Connections can be filter by :
it: Le connessioni possono essere filtrate tramite:

source: ``Protocol``
it: ``Protocollo``

source: ``Status``
it: ``Stato``

source: ``Port``
it: ``Porta``

source: The list of connections is not refreshed in real time. To list new connections click the :guilabel:`Refresh page` button.
it: L'elenco delle connessioni non viene aggiornato in tempo reale. Per elencare le nuove connessioni, fare clic sul pulsante :guilabel:`Aggiorna pagina`.

source: The administrator can delete a single connection or flush the whole connection tracking table by using :guilabel:`Delete all connections` button.
it: L'amministratore può eliminare una singola connessione o svuotare l'intera tabella di tracciamento delle connessioni utilizzando il pulsante :guilabel:`Elimina tutte le connessioni`.

source: Good practices for terminating sessions
it: Buone pratiche per la terminazione delle sessioni

source: When to terminate a connection:
it: Quando terminare una connessione:

source: the connection has expired or been idle for an extended period
it: la connessione è scaduta o è rimasta inattiva per un periodo prolungato

source: there's evidence of malicious activity associated with the session
it: ci sono prove di attività dannosa associate alla sessione

source: the connection appears to be stale or hanging, preventing new connections
it: la connessione sembra essere inattiva o bloccata, impedendo nuove connessioni

source: termination is necessary for network troubleshooting or diagnostics
it: la terminazione è necessaria per la risoluzione dei problemi di rete o per la diagnostica

source: When to avoid terminating a session:
it: Quando evitare di terminare una sessione:

source: the connection is active and appears to be functioning normally
it: la connessione è attiva e sembra funzionare normalmente

source: the connection is critical for ongoing application operations
it: la connessione è fondamentale per il funzionamento continuo dell'applicazione

source: any issues with the connection seem to be temporary and may resolve on their own
it: eventuali problemi con la connessione sembrano essere temporanei e potrebbero risolversi da soli

source: In a MultiWAN setup, specific traffic such as VoIP trunks is routed and NATed through designated interfaces to distinct providers. When an interface or route becomes unavailable, it is essential to drop all connections using that interface and reroute subsequent traffic through the functioning connection, otherwise the trunk will not be able to register to the provider.
it: In una configurazione MultiWAN, il traffico specifico come i trunk VoIP viene instradato e NATtato attraverso interfacce designate verso provider distinti. Quando un'interfaccia o una rotta diventa non disponibile, è essenziale interrompere tutte le connessioni che utilizzano tale interfaccia e instradare il traffico successivo attraverso la connessione funzionante, altrimenti il trunk non sarà in grado di registrarsi presso il provider.

source: To resolve this issue, you can remove the specific conntrack entries associated with the old external address through the user interface.
it: Per risolvere questo problema, è possibile rimuovere le voci conntrack specifiche associate al vecchio indirizzo esterno tramite l'interfaccia utente.
