Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/controller.po
Languages: it

source: The Timescale database stores the same metrics of the :ref:`real_time_monitoring-section` but as a timeseries saved in a PostgreSQL database. Each unit sends data to the controller every 15 minutes. The controller aggregates the data every 15 minutes, this means that data are available inside dashboards at best with a 15 minutes delay and at worst with a 30 minutes delay.
it: Il database Timescale memorizza le stesse metriche della :ref:`real_time_monitoring-section`, ma come serie temporali salvate in un database PostgreSQL. Ogni unità invia i dati al controller ogni 15 minuti. Il controller aggrega i dati ogni 15 minuti, il che significa che i dati sono disponibili all'interno delle dashboard al meglio con un ritardo di 15 minuti e al massimo con un ritardo di 30 minuti.

source: The controller can do extra processing on the data to provide more insights. For example, the controller can geolocate the IP addresses of the connected clients and of the attackers.
it: Il controller può eseguire elaborazioni aggiuntive sui dati per fornire ulteriori approfondimenti. Ad esempio, il controller può geolocalizzare gli indirizzi IP dei client connessi e degli aggressori.

source: These metrics are visible inside the following dashboards:
it: Queste metriche sono visibili all'interno delle seguenti dashboard:

source: ``Network traffic``: aggregated network traffic as seen by the unit
it: ``Traffico di rete``: traffico di rete aggregato come rilevato dall'unità

source: ``Network traffic by client``: network traffic for each client (local host) connected to the unit
it: ``Traffico di rete per client``: traffico di rete per ogni client (host locale) connesso all'unità

source: ``Network traffic by host``: network traffic for each remote host
it: ``Traffico di rete per host``: traffico di rete per ciascun host remoto

source: ``Security``: security events detected by the unit
it: ``Sicurezza``: eventi di sicurezza rilevati dall'unità

source: ``VPN``: VPN statistics for OpenVPN Road Warrior, OpenVPN tunnels and IPsec tunnels
it: ``VPN``: Statistiche VPN per OpenVPN Road Warrior, tunnel OpenVPN e tunnel IPsec

source: Metrics retention period must be configured from the NS8 web interface and is applied to both to Prometheus and Timescale databases.
it: Il periodo di conservazione delle metriche deve essere configurato dall'interfaccia web di NS8 e viene applicato sia ai database Prometheus che Timescale.

source: Unit updates
it: Aggiornamenti delle unità

source: The controller allows you to update the units directly from the interface, similar to the process in :ref:`the unit web interface<updates-section>`. Two types of updates are available:
it: Il controller consente di aggiornare le unità direttamente dall'interfaccia, in modo simile al processo descritto in :ref:`l'interfaccia web dell'unità<updates-section>`. Sono disponibili due tipi di aggiornamenti:

source: **Package updates**: Update the packages installed on the unit. List and install available updates by clicking on :guilabel:`Check packages updates` in the unit menu. A modal will display the list of available updates. If updates are available, apply them by clicking on the :guilabel:`Update` button in the modal. This is the first thing to try if :ref:`version awareness<version-awareness-section>` blocks you from accessing the unit.
it: **Aggiornamenti dei pacchetti**: Aggiornare i pacchetti installati sull'unità. Elencare e installare gli aggiornamenti disponibili facendo clic su :guilabel:`Controlla gli aggiornamenti dei pacchetti` nel menu dell'unità. Verrà visualizzata una finestra modale con l'elenco degli aggiornamenti disponibili. Se sono presenti aggiornamenti, applicarli facendo clic sul pulsante :guilabel:`Aggiorna` nella finestra modale. Questa è la prima operazione da provare se :ref:`version awareness<version-awareness-section>` impedisce l'accesso all'unità.

source: **System update**: Update the unit's system. If an image update is available, a badge will appear in the unit list. Schedule an update by clicking on the :guilabel:`System update` button in the unit menu. You can schedule the update or update the unit immediately. This operation is also available as a mass operation for multiple units under :guilabel:`Actions` -> :guilabel:`Update systems`. Units with a scheduled image update will have a dedicated badge in the unit list. You can abort the scheduled update by clicking on the :guilabel:`Cancel scheduled image update` button in the unit menu.
it: **Aggiornamento del sistema**: Aggiorna il sistema dell'unità. Se è disponibile un aggiornamento dell'immagine, verrà visualizzato un badge nell'elenco delle unità. È possibile programmare un aggiornamento facendo clic sul pulsante :guilabel:`Aggiornamenti di sistema` nel menu dell'unità. Si può programmare l'aggiornamento oppure aggiornare immediatamente l'unità. Questa operazione è disponibile anche come operazione di massa per più unità tramite :guilabel:`Azioni` -> :guilabel:`Aggiorna sistemi`. Le unità con un aggiornamento dell'immagine programmato avranno un badge dedicato nell'elenco delle unità. È possibile annullare l'aggiornamento programmato facendo clic sul pulsante :guilabel:`Cancella l'aggiornamento programmato dell'immagine` nel menu dell'unità.

source: Please be aware that units might not send updated information when undergoing upgrading process prior to unit version 1.3.0. To refresh manually the information use the `guilabel`:`Sync unit info` button in the unit menu.
it: Si prega di notare che le unità potrebbero non inviare informazioni aggiornate durante il processo di aggiornamento se la versione dell'unità è precedente alla 1.3.0. Per aggiornare manualmente le informazioni, utilizzare il pulsante :guilabel:`Sincronizza info unità` nel menu dell'unità.

source: SSH access
it: Accesso SSH

source: SSH, or Secure Shell, is a cryptographic network protocol for operating network services securely over an unsecured network. SSH provides a secure channel over an unsecured network in a client-server architecture, connecting an SSH client application to an SSH server.
it: SSH, o Secure Shell, è un protocollo di rete crittografico per l'esecuzione sicura di servizi di rete su una rete non sicura. SSH fornisce un canale sicuro su una rete non protetta in un'architettura client-server, collegando un'applicazione client SSH a un server SSH.

source: It is possible to connect to the unit by clicking on the :guilabel:`Open SSH terminal` link. The connection is made through a web-based SSH client that allows access to the unit's shell.
it: È possibile connettersi all'unità facendo clic sul collegamento :guilabel:`Apri terminale SSH`. La connessione avviene tramite un client SSH basato su web che consente l'accesso alla shell dell'unità.

source: You can connect to units using a username and password pair or an SSH key.
it: È possibile connettersi alle unità utilizzando una coppia di nome utente e password oppure una chiave SSH.

source: Once connected, the SSH session will be started inside a new browser tab. Some browsers require permission to open popups for the SSH session to work properly. To close the session, simply close the browser window or log out from the shell using CTRL + D.
it: Una volta connessi, la sessione SSH verrà avviata in una nuova scheda del browser. Alcuni browser richiedono l'autorizzazione per aprire popup affinché la sessione SSH funzioni correttamente. Per chiudere la sessione, è sufficiente chiudere la finestra del browser oppure disconnettersi dalla shell utilizzando CTRL + D.

source: Username and password
it: Nome utente e password

source: The user interface will display a form to enter the username and password. After entering the credentials, the user can click on the :guilabel:`Open terminal` button to start the SSH session.
it: L'interfaccia utente visualizzerà un modulo per inserire nome utente e password. Dopo aver inserito le credenziali, è possibile fare clic sul pulsante :guilabel:`Apri terminale` per avviare la sessione SSH.

source: SSH key
it: Chiave SSH

source: An SSH key pair is a set of two cryptographic keys that are used for authentication when establishing a secure connection using the SSH (Secure Shell) protocol. The pair consists of a private key and a public key:
it: Una coppia di chiavi SSH è un insieme di due chiavi crittografiche utilizzate per l'autenticazione durante la creazione di una connessione sicura tramite il protocollo SSH (Secure Shell). La coppia è composta da una chiave privata e una chiave pubblica:

source: **Private Key**: This is kept secret and secure by the user. It should never be exposed to the outside world. It is used to decrypt data that has been encrypted with the public key.
it: **Chiave privata**: Questa viene mantenuta segreta e sicura dall'utente. Non dovrebbe mai essere esposta all'esterno. Viene utilizzata per decriptare i dati che sono stati criptati con la chiave pubblica.

source: **Public Key**: This can be freely shared and is used to encrypt data that can only be decrypted with the private key.
it: **Chiave pubblica**: Questa può essere condivisa liberamente ed è utilizzata per crittografare i dati che possono essere decifrati solo con la chiave privata.

source: When you connect to a server using SSH with key pair authentication, you provide your public key to the server. The server then encrypts a challenge message with your public key. Your client then decrypts the message with your private key and sends the result back to the server. If the result is correct, the server knows that you must have the correct private key and allows you to connect.
it: Quando ci si connette a un server utilizzando l'autenticazione SSH con coppia di chiavi, si fornisce la propria chiave pubblica al server. Il server quindi cifra un messaggio di sfida con la chiave pubblica fornita. Il client decifra il messaggio utilizzando la propria chiave privata e invia il risultato al server. Se il risultato è corretto, il server riconosce che si possiede la chiave privata corretta e consente la connessione.

source: This method of authentication is more secure than using a password, as it provides a form of two-factor authentication: something you have (the private key file) and something you know (the passphrase to unlock the private key).
it: Questo metodo di autenticazione è più sicuro rispetto all'utilizzo di una password, poiché fornisce una forma di autenticazione a due fattori: qualcosa che si possiede (il file della chiave privata) e qualcosa che si conosce (la passphrase per sbloccare la chiave privata).

source: To use an SSH key, generate a new key pair by accessing the ``Account settings`` page and and clicking on the :guilabel:`Generate SSH key pair` button. Enter a passphrase to protect the private key and click on the :guilabel:`Generate SSH key` button. The user interface will display the public key, while the private key is preserved safely inside the controller.
it: Per utilizzare una chiave SSH, è necessario generare una nuova coppia di chiavi accedendo alla pagina ``Impostazioni account`` e facendo clic sul pulsante :guilabel:`Genera coppia di chiavi SSH`. Inserire una passphrase per proteggere la chiave privata e fare clic sul pulsante :guilabel:`Genera chiave SSH`. L'interfaccia utente mostrerà la chiave pubblica, mentre la chiave privata viene conservata in modo sicuro all'interno del controller.

source: Before connecting to the unit, you must copy the public key and paste it into the unit's SSH authorized keys file. You can do it from the ``Unit manager`` page, by clicking on the :guilabel:`Actions` button and selecting :guilabel:`Send SSH public key`. Choose the units you want to send the key to and click on the :guilabel:`Send SSH key` button.
it: Prima di connettersi all'unità, è necessario copiare la chiave pubblica e incollarla nel file delle chiavi autorizzate SSH dell'unità. È possibile farlo dalla pagina ``Gestione unità``, facendo clic sul pulsante :guilabel:`Azioni` e selezionando :guilabel:`Invia la chiave pubblica SSH`. Selezionare le unità a cui si desidera inviare la chiave e fare clic sul pulsante :guilabel:`Invia la chiave SSH`.

source: From now on, you can connect to the unit using the SSH key pair. The user interface will display a form to enter the passphrase when clicking on the :guilabel:`Open terminal` button.
it: D'ora in poi, sarà possibile connettersi all'unità utilizzando la coppia di chiavi SSH. L'interfaccia utente mostrerà un modulo per inserire la passphrase quando si fa clic sul pulsante :guilabel:`Apri terminale`.

source: You can also revoke the SSH key pair by clicking on the :guilabel:`Revoke SSH public key` button from the :guilabel:`Actions` button.
it: È anche possibile revocare la coppia di chiavi SSH facendo clic sul pulsante :guilabel:`Revoca la chiave pubblica SSH` dal pulsante :guilabel:`Azioni`.

source: All operations performed on the controller are logged in the NS8 log. Here are some examples of logged operations:
it: Tutte le operazioni eseguite sul controller vengono registrate nel log di NS8. Ecco alcuni esempi di operazioni registrate:

source: User login and logout
it: Accesso e disconnessione dell'utente

source: User creation/modification/deletion/password change
it: Creazione/modifica/eliminazione utente/cambio password

source: Unit list/creation/removal
it: Elenco/creazione/rimozione delle unità

source: Example of NS8 log: ::
it: Esempio di log NS8: ::

source: Each unit has an rpcd user specific to the controller, which is used for management operations. When a user accesses the unit's web interface from the controller, all operations performed are logged in the unit's log, identified by the rpcd user. For example: ::
it: Ogni unità dispone di un utente rpcd specifico per il controller, utilizzato per le operazioni di gestione. Quando un utente accede all'interfaccia web dell'unità dal controller, tutte le operazioni eseguite vengono registrate nel log dell'unità, identificate dall'utente rpcd. Ad esempio: ::

source: To determine who performed a specific operation, it is necessary to check the log of the unit identified by the rpcd user and correlate it with the login action performed on the controller.
it: Per determinare chi ha eseguito una specifica operazione, è necessario controllare il log dell'unità identificata dall'utente rpcd e correlare tale informazione con l'azione di accesso effettuata sul controller.

source: When a user connects to the unit via SSH, the login is logged in the unit's log, identified by the SSH user. Usually, the SSH user is root. For example: ::
it: Quando un utente si connette all'unità tramite SSH, l'accesso viene registrato nel log dell'unità, identificato dall'utente SSH. Solitamente, l'utente SSH è root. Ad esempio: ::

source: If the user uses an SSH key for authentication, the log will contain the fingerprint of the SSH key used for authentication. This makes it easier to associate the SSH user with the operations performed. Example: ::
it: Se l'utente utilizza una chiave SSH per l'autenticazione, il log conterrà l'impronta digitale della chiave SSH utilizzata per l'autenticazione. Questo rende più semplice associare l'utente SSH alle operazioni eseguite. Esempio: ::

source: Subscription and limitations
it: Subscription e limitazioni

source: Some restrictions can only be overcame if the firewall has a valid subscription.
it: Alcune restrizioni possono essere superate solo se il firewall dispone di un .

source: The behavior of the controller running on a NS8 depends on its subscription status.
it: Il comportamento del controller in esecuzione su un NS8 dipende dal suo stato di sottoscrizione.

source: Controller without subscription:
it: Controller senza subscription:

source: Allows the registration of up to 3 units.
it: Consente la registrazione di un massimo di 3 unità.

source: Only community firewalls can register with the controller.
it: Solo i firewall della community possono registrarsi con il controller.

source: Historical metrics are not accesible.
it: Le metriche storiche non sono accessibili.

source: Controller with a valid subscription:
it: Controller con una subscription valida:

source: The number of units is unlimited.
it: Il numero di unità è illimitato.

source: Only firewalls with a valid subscription can register with the controller.
it: Solo i firewall con una subscription valida possono registrarsi con il controller.

source: Units with a valid subscription send metrics to the controller.
it: Le unità con un subscription valida inviano metriche al controller.

source: Version awareness is a mechanism that prevents the user from performing operations not supported by the unit version. To do so, when connecting to the UI of a unit the controller will check the API version during the connection process. There are three possible scenarios:
it: La version awareness è un meccanismo che impedisce all'utente di eseguire operazioni non supportate dalla versione dell'unità. A tal fine, durante la connessione all'interfaccia utente di un'unità, il controller verificherà la versione delle API durante il processo di connessione. Esistono tre possibili scenari:

source: If the versions are compatible, the connection proceeds as normal.
it: Se le versioni sono compatibili, la connessione procede normalmente.

source: If the firewall (unit) is significantly older than the controller, you'll see a popup that prevents the connection. This is to protect against potential errors.
it: Se il firewall (unità) è significativamente più vecchio del controller, verrà visualizzato un popup che impedisce la connessione. Questo serve a proteggere da potenziali errori.

source: If the controller is slightly older than the firewall, you'll see a warning about the mismatch. However, you'll still be able to connect if you choose to proceed.
it: Se il controller è leggermente più vecchio del firewall, verrà visualizzato un avviso relativo alla mancata corrispondenza. Tuttavia, sarà comunque possibile connettersi se si sceglie di procedere.

source: As an administrator, you don't need to take any specific actions to enable Version awareness. It works automatically in the background. However, you should:
it: In qualità di amministratore, non è necessario eseguire alcuna azione specifica per abilitare la version awareness. Questa funziona automaticamente in background. Tuttavia, è consigliabile:

source: Pay attention to warnings: if you see a version mismatch warning, consider updating your system when convenient.
it: Prestare attenzione agli avvisi: se viene visualizzato un avviso di incompatibilità di versione, valutare l'aggiornamento del sistema quando conveniente.

source: Keep your system updated: regularly check for and apply updates to both your controller and firewall units to ensure the best compatibility and access to new features.
it: Mantenere il sistema aggiornato: verificare regolarmente la presenza di aggiornamenti e applicarli sia al controller che alle unità firewall per garantire la migliore compatibilità e l’accesso alle nuove funzionalità.

source: Report issues: if you encounter any unusual behavior or errors, especially after seeing a version warning, follow the :ref:`troubleshooting <troubleshooting-section>` procedure.
it: Segnalare problemi: se si riscontrano comportamenti insoliti o errori, soprattutto dopo aver visualizzato un avviso di versione, seguire la procedura di :ref:`risoluzione dei problemi <troubleshooting-section>`.

source: Version awareness is a behind-the-scenes feature that helps keep your NethSecurity system running smoothly. By automatically checking compatibility between the controller and units, it prevents many potential issues before they can affect your network. While it doesn't require any action from you, being aware of this feature can help you better understand and manage your system.
it: La version awareness è una funzionalità in background che contribuisce a mantenere il sistema NethSecurity operativo senza intoppi. Verificando automaticamente la compatibilità tra il controller e le unità, previene molti potenziali problemi prima che possano influire sulla rete. Anche se non richiede alcuna azione da parte dell’utente, essere a conoscenza di questa funzionalità può aiutare a comprendere e gestire meglio il sistema.

source: Bypass version awareness
it: Ignorare la version awareness

source: While version awareness is a useful feature, knowing the risks and potential issues, you may want to bypass it in some cases. To do so, the procedure is as follows:
it: Sebbene la version awareness sia una funzionalità utile, conoscendo i rischi e i potenziali problemi, potrebbe essere necessario ignorarla in alcuni casi. Per farlo, la procedura è la seguente:

source: On the controller, go to the unit manager page and click on :guilabel:`More Info` of the unit you want to connect to.
it: Sul controller, andare alla pagina del gestore delle unità e fare clic su :guilabel:`Ulteriori informazioni` dell'unità a cui si desidera connettersi.

source: Copy the `Unit ID` value.
it: Copia il valore di ``Unit ID``.

source: Click on :guilabel:`Open SSH terminal`
it: Fare clic su :guilabel:`Apri terminale SSH`

source: When the modal opens, you can safely close it. This was only needed to exchange some credentials with the unit.
it: Quando si apre la finestra modale, è possibile chiuderla in sicurezza. Questo era necessario solo per scambiare alcune credenziali con l'unità.

source: Open a new tab, and go to this URL: `https://<controller-fqdn>/#/controller/manage/<unit-id>/dashboard`. Example: `https://controller.nethsecurity.org/#/controller/manage/000000000-0000-0000-0000-000000000000/dashboard`.
it: Aprire una nuova scheda e andare a questo URL: ``https://<controller-fqdn>/#/controller/manage/<unit-id>/dashboard``. Esempio: ``https://controller.nethsecurity.org/#/controller/manage/000000000-0000-0000-0000-000000000000/dashboard``.

source: You will be able to access the unit's UI without the version check.
it: Sarà possibile accedere all'interfaccia utente dell'unità senza il controllo della versione.

source: Update unit with SSH
it: Aggiornare l'unità con SSH

source: You can update the unit without connecting to it using the SSH terminal. Follow the steps to connect to the unit using :ref:`SSH Access <controller_ssh-section>`.
it: È possibile aggiornare l'unità senza collegarsi ad essa utilizzando il terminale SSH. Seguire i passaggi per connettersi all'unità utilizzando :ref:`SSH Access <controller_ssh-section>`.

source: Once connected, you can check for updates depending on what you want to update.
it: Una volta connessi, è possibile verificare la presenza di aggiornamenti a seconda di ciò che si desidera aggiornare.

source: Install package updates on the unit:
it: Installare gli aggiornamenti dei pacchetti sull'unità:

source: To check for updates for packages use the following command:
it: Per verificare la presenza di aggiornamenti per i pacchetti, utilizzare il seguente comando:

source: If you're ok with the installation of the packages you can run the following command:
it: Se si è d'accordo con l'installazione dei pacchetti, è possibile eseguire il seguente comando:

source: To update the image, you can simply schedule the installation, remember this is an operation that restarts the firewall (causing a downtime)
it: Per aggiornare l'immagine, è possibile semplicemente pianificare l'installazione; si ricorda che questa operazione riavvia il firewall (causando un periodo di inattività).

source: Check if there is an updated image available:
it: Verificare se è disponibile un'immagine aggiornata:

source: If you want to proceed with the update, this can be done through this command:
it: Se si desidera procedere con l'aggiornamento, è possibile farlo tramite questo comando:
