Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/controller.po
Languages: it

source: The user can connect using a username and password pair of the unit in the following scenarios:
it: L'utente può connettersi utilizzando una coppia di nome utente e password dell'unità nei seguenti scenari:

source: The logged-in user has not generated an SSH key
it: L'utente connesso non ha generato una chiave SSH

source: The public SSH key of the logged-in user hasn't been copied inside the SSH authorized keys file of the unit
it: La chiave pubblica SSH dell'utente connesso non è stata copiata all'interno del file delle chiavi autorizzate SSH dell'unità

source: To ensure proper operation, the controller must be accessible over the network on specific ports.
it: Per garantire il corretto funzionamento, il controller deve essere accessibile tramite la rete su porte specifiche.

source: ``TCP port 443 (HTTPS)`` to access WebUI and allow units communication.
it: ``Porta TCP 443 (HTTPS)`` per accedere alla WebUI e consentire la comunicazione delle unità.

source: ``A dinamically allocated UDP port`` opened by NethServer 8 and used for VPN connections from the units, this port is randomly generated at setup time.
it: ``Una porta UDP allocata dinamicamente`` aperta da NethServer 8 e utilizzata per le connessioni VPN dalle unità; questa porta viene generata casualmente durante la configurazione.

source: The actual ``UDP port`` number can be found in the Controller module status page under the ``OpenVPN UDP Port`` section. Make sure those ports are open on any firewall protecting the node running the controller.
it: Il numero effettivo della ``porta UDP`` può essere trovato nella pagina di stato del modulo Controller, nella sezione ``OpenVPN UDP Port``. Assicurarsi che queste porte siano aperte su qualsiasi firewall che protegge il nodo su cui è in esecuzione il controller.

source: `Allowed IPs`: The list of IP addresses or CIDR ranges that are allowed to access the controller web interface. By default, the list is empty, meaning that access is allowed from all IP addresses. You can restrict access to specific IPs or networks for security reasons. When enabled, only the registration endpoint (eg. ``https://controller.nethserver.org/api/register``) will be accessible from the units, allowing them to register with the controller. All other traffic between the controller and the units will be routed through the VPN connection. This feature requires unit version 8.6 or later.
it: `Allowed IPs`: L'elenco degli indirizzi IP o intervalli CIDR che sono autorizzati ad accedere all'interfaccia web del controller. Per impostazione predefinita, l'elenco è vuoto, il che significa che l'accesso è consentito da tutti gli indirizzi IP. È possibile limitare l'accesso a IP o reti specifiche per motivi di sicurezza. Quando abilitato, solo l'endpoint di registrazione (ad es. ``https://controller.nethserver.org/api/register``) sarà accessibile dalle unità, consentendo loro di registrarsi presso il controller. Tutto il traffico restante tra il controller e le unità verrà instradato attraverso la connessione VPN. Questa funzionalità richiede la versione 8.6 o successiva dell'unità.

source: **Administrator users**: The administrator users are the only ones who can create and manage users inside the controller. Administrator users can also access all units.
it: **Utenti amministratori**: Gli utenti amministratori sono gli unici che possono creare e gestire gli utenti all'interno del controller. Gli utenti amministratori possono inoltre accedere a tutte le unità.

source: **Standard user**: Standard users can manage units and firewall configurations. These users must be associated with a group of units: they will be able to access only the units associated with their group. If a user is not associated with any group, they will have no access to any unit. See :ref:`controller_unit_groups-section` for more information about unit groups.
it: **Utente standard**: Gli utenti standard possono gestire le unità e le configurazioni del firewall. Questi utenti devono essere associati a un gruppo di unità: potranno accedere solo alle unità associate al proprio gruppo. Se un utente non è associato a nessun gruppo, non avrà accesso ad alcuna unità. Consultare :ref:`controller_unit_groups-section` per ulteriori informazioni sui gruppi di unità.

source: An administrator user is created during the controller configuration from NethServer 8 web interface. The administrator user can create and manage other users from the controller web interface. A user can be associated to a unit group from the controller web interface, inside the user management page.
it: Un utente amministratore viene creato durante la configurazione del controller dall'interfaccia web di NethServer 8. L'utente amministratore può creare e gestire altri utenti dall'interfaccia web del controller. Un utente può essere associato a un gruppo di unità dall'interfaccia web del controller, all'interno della pagina di gestione utenti.

source: The administrator can also:
it: L'amministratore può anche:

source: reset the user password and delete users
it: reimpostare la password dell'utente ed eliminare gli utenti

source: promote a user to administrator
it: promuovere un utente ad amministratore

source: delete a user account
it: eliminare un account utente

source: After logging in, each user should change their password and generate an SSH key pair for accessing the units.
it: Dopo aver effettuato l'accesso, ogni utente dovrebbe cambiare la propria password e generare una coppia di chiavi SSH per accedere alle unità.

source: Unit groups
it: Gruppi di unità

source: Unit groups are a way to organize units inside the controller. Each user can be associated with one or more unit groups. When a user is associated with a unit group, they can access only the units that belong to that group. Unit groups are useful to restrict access to specific units for specific users.
it: I gruppi di unità sono un modo per organizzare le unità all'interno del controller. Ogni utente può essere associato a uno o più gruppi di unità. Quando un utente è associato a un gruppo di unità, può accedere solo alle unità che appartengono a quel gruppo. I gruppi di unità sono utili per limitare l'accesso a unità specifiche per utenti specifici.

source: To create a new unit group, the administrator must click on the :guilabel:`Add group` button from the controller web interface, within the ``Unit groups`` page. The administrator can specify the group name, a description, and the units that belong to the group.
it: Per creare un nuovo gruppo di unità, l'amministratore deve cliccare sul pulsante :guilabel:`Aggiungi gruppo` dall'interfaccia web del controller, all'interno della pagina ``Gruppi di unità``. L'amministratore può specificare il nome del gruppo, una descrizione e le unità che appartengono al gruppo.

source: Once a unit group is created, the administrator can associate the unit group with a user. To do so, the administrator must access the user list inside the ``Users`` page. Then, click on the :guilabel:`Edit` button next to the user and select the unit group from the ``Unit groups`` dropdown menu.
it: Una volta che un gruppo di unità è stato creato, l'amministratore può associare il gruppo di unità a un utente. Per farlo, l'amministratore deve accedere all'elenco degli utenti all'interno della pagina ``Utenti``. Successivamente, fare clic sul pulsante :guilabel:`Modifica` accanto all'utente e selezionare il gruppo di unità dal menu a discesa ``Gruppi di unità``.

source: Removing unit groups
it: Rimozione dei gruppi di unità

source: A unit group can be removed only when there are no users associated with it. This can be checked by accessing the ``Users`` page and looking for any users that is associated to the group.
it: Un gruppo di unità può essere rimosso solo quando non ci sono utenti associati ad esso. Questo può essere verificato accedendo alla pagina ``Utenti`` e cercando eventuali utenti associati al gruppo.

source: To remove a unit group, the administrator must access the ``Unit groups`` page and click on the :guilabel:`Delete` button next to the group.
it: Per rimuovere un gruppo di unità, l'amministratore deve accedere alla pagina ``Gruppi di unità`` e fare clic sul pulsante :guilabel:`Elimina` accanto al gruppo.

source: Migrated unit group
it: Gruppo di unità migrato

source: When upgrading from a controller version prior to 2.0.0, a new ``Migrated`` unit group will be created automatically. The ``Migrated`` unit group automatically includes all units that were managed by the controller before the upgrade. It is also associated with all existing users to ensure they retain access to their units after migration.
it: Quando si esegue l'aggiornamento da una versione del controller precedente alla 2.0.0, verrà creato automaticamente un nuovo gruppo di unità ``Migrated``. Il gruppo di unità ``Migrated`` include automaticamente tutte le unità che erano gestite dal controller prima dell'aggiornamento. Inoltre, è associato a tutti gli utenti esistenti per garantire che mantengano l'accesso alle proprie unità dopo la migrazione.

source: The group can be safely removed once it is no longer needed.
it: Il gruppo può essere rimosso in sicurezza una volta che non è più necessario.
