Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/controller.po
Languages: it

source: The NethSecurity controller is an application that can run on `NethServer 8 <https://docs.nethserver.org/projects/ns8/en/latest/nethsecurity_controller.html>`_ (NS8). The controller allows remote control of multiple NethSecurity installations, called units.
it: Il controller NethSecurity è un'applicazione che può essere eseguita su `NethServer 8 <https://docs.nethserver.org/projects/ns8/en/latest/nethsecurity_controller.html>`_ (NS8). Il controller consente il controllo remoto di più installazioni NethSecurity, chiamate unità.

source: The firewall can operate independently without the need for the controller. The controller is an optional component that provides additional management and monitoring capabilities for the firewall.
it: Il firewall può funzionare in modo indipendente senza la necessità del controller. Il controller è un componente opzionale che fornisce funzionalità aggiuntive di gestione e monitoraggio per il firewall.

source: The controller creates a secure connection between the central server and the units. Each firewall registers with the server using a client called ns-plug. Once registered, the server generates a VPN configuration that is sent back to the firewall. The VPN enables secure communication between the controller and the unit.
it: Il controller crea una connessione sicura tra il server centrale e le unità. Ogni firewall si registra presso il server utilizzando un client chiamato ns-plug. Una volta registrato, il server genera una configurazione VPN che viene inviata al firewall. La VPN consente una comunicazione sicura tra il controller e l'unità.

source: Key features:
it: Funzionalità principali:

source: **Centralized Management**: Manage multiple firewalls from a single server.
it: **Gestione centralizzata**: Gestire più firewall da un unico server.

source: **Secure Communication**: Establish a secure `OpenVPN <https://openvpn.net/>`_ connection between the server and the firewalls.
it: **Comunicazione sicura**: Stabilire una connessione `OpenVPN <https://openvpn.net/>`_ sicura tra il server e i firewall.

source: **Easy Configuration**: Configure firewalls directly from the controller's user interface.
it: **Configurazione semplice**: Configurare i firewall direttamente dall'interfaccia utente del controller.

source: **Monitoring and Logging**: Collect and analyze logs from the firewalls inside `Loki <https://grafana.com/oss/loki/>`_ for troubleshooting and monitoring purposes.
it: **Monitoraggio e registrazione**: Raccogliere e analizzare i log dai firewall all'interno di `Loki <https://grafana.com/oss/loki/>`_ per scopi di risoluzione dei problemi e monitoraggio.

source: **Metrics Visualization**: Visualize metrics from the firewalls using the built-in `Grafana <https://grafana.com/>`_ dashboard. Metrics are collected using `Prometheus <https://prometheus.io/>`_ and `TimescaleDB <https://www.timescale.com/>`_.
it: **Visualizzazione delle metriche**: Visualizzare le metriche dai firewall utilizzando la dashboard integrata di `Grafana <https://grafana.com/>`_. Le metriche vengono raccolte tramite `Prometheus <https://prometheus.io/>`_ e `TimescaleDB <https://www.timescale.com/>`_.

source: **Web-based SSH**: Access the firewall command-line interface using a web-based SSH client.
it: **Accesso SSH via web**: Accedere all'interfaccia a riga di comando del firewall utilizzando un client SSH basato su web.

source: Installation and configuration
it: Installazione e configurazione

source: The controller can be installed on a NethServer 8 system from the Software Center. The module is named `NethSecurity Controller`.
it: Il controller può essere installato su un sistema NethServer 8 dal Software Center. Il modulo si chiama ``NethSecurity Controller``.

source: After the installation, the controller must be configured. The configuration can be done using the NethServer 8 web interface. The following parameters need to be set:
it: Dopo l'installazione, è necessario configurare il controller. La configurazione può essere effettuata utilizzando l'interfaccia web di NethServer 8. È necessario impostare i seguenti parametri:

source: `Controller hostname`: The fully qualified domain name for the controller, like: ``mycontroller.nethsecurity.org``. Ensure the hostname is resolvable and reachable from the units.
it: `Controller hostname`: Il nome di dominio completo per il controller, ad esempio: ``mycontroller.nethsecurity.org``. Assicurarsi che il nome host sia risolvibile e raggiungibile dalle unità.

source: `Let's Encrypt certificate`: Enable or disable Let's Encrypt certificate for the controller web interface. It's recommended to enable it.
it: `Let's Encrypt certificate`: Abilitare o disabilitare il certificato Let's Encrypt per l'interfaccia web del controller. Si consiglia di abilitarlo.

source: `VPN network` and `VPN netmask`: The OpenVPN network and netmask. When choosing the network, make sure it does not overlap with the existing networks inside all the units that will be connected to the controller. Use only class C networks like ``192.168.7.0`` with netmask ``255.255.255.0``.
it: `VPN network` e `VPN netmask`: la rete e la netmask di OpenVPN. Quando si sceglie la rete, assicurarsi che non si sovrapponga alle reti esistenti all'interno di tutte le unità che saranno collegate al controller. Utilizzare solo reti di classe C come ``192.168.7.0`` con netmask ``255.255.255.0``.

source: `Administrator user`: The controller administrator user name. The administrator user is the only user that can create and manage other users inside the controller. The same user name is used to access the Grafana interface.
it: `Utente amministratore`: Il nome utente dell'amministratore del controller. L'utente amministratore è l'unico utente che può creare e gestire altri utenti all'interno del controller. Lo stesso nome utente viene utilizzato per accedere all'interfaccia Grafana.

source: `Administrator password`: Choose a strong password for the administrator user. Note that the default password is displayed only once, please store it in a safe place. The same password is used to access the Grafana interface. For security reasons, you should change the password after the first login both for the controller and the Grafana interface.
it: `Password amministratore`: Scegliere una password robusta per l'utente amministratore. Si noti che la password predefinita viene visualizzata solo una volta; conservarla in un luogo sicuro. La stessa password viene utilizzata per accedere all'interfaccia di Grafana. Per motivi di sicurezza, è consigliabile cambiare la password dopo il primo accesso sia per il controller che per l'interfaccia Grafana.

source: The following parameters are optional:
it: I seguenti parametri sono opzionali:

source: `Controller name`: The name of the controller, used to create the VPN certification authority. You can leave it unchanged unless you have a specific requirement.
it: `Nome del controller`: Il nome del controller, utilizzato per creare l'autorità di certificazione VPN. È possibile lasciarlo invariato a meno che non vi sia un requisito specifico.

source: `Log retention`: The log retention period in days, default is 180 days. It applies to the logs stored in Loki.
it: `Conservazione dei log`: Il periodo di conservazione dei log in giorni, il valore predefinito è 180 giorni. Si applica ai log memorizzati in Loki.

source: `Metrics retention`: The metrics retention period in days, default 15 days. It applies to the metrics stored in Prometheus and Timescale.
it: `Conservazione delle metriche`: Il periodo di conservazione delle metriche in giorni, predefinito a 15 giorni. Si applica alle metriche memorizzate in Prometheus e Timescale.

source: `MaxMind license key`: The controller can geolocate the IP addresses of the connected VPN clients and attackers. A map with the location of the clients and attackers will be displayed inside Grafana. The license key is required to enable the feature and download the MaxMind GeoIP2 database. To obtain a free license key, signup on the `MaxMind website <https://www.maxmind.com/en/geolite2/signup>`_, then access the `Manage License Keys` page inside the account section. Generate a new license, copy the license key and paste it in the field.
it: `MaxMind license key`: Il controller può geolocalizzare gli indirizzi IP dei client VPN connessi e degli aggressori. Una mappa con la posizione dei client e degli aggressori verrà visualizzata all'interno di Grafana. La chiave di licenza è necessaria per abilitare la funzionalità e scaricare il database MaxMind GeoIP2. Per ottenere una chiave di licenza gratuita, registrarsi sul `sito web di MaxMind <https://www.maxmind.com/en/geolite2/signup>`_, quindi accedere alla pagina `Manage License Keys` nella sezione dell'account. Generare una nuova licenza, copiare la chiave di licenza e incollarla nel campo.

source: After completing the configuration, the controller is ready to be used and can be accessed using a web browser at the configured hostname, like ``https://mycontroller.nethsecurity.org``.
it: Dopo aver completato la configurazione, il controller è pronto per essere utilizzato e può essere accessibile tramite un browser web all'hostname configurato, ad esempio ``https://mycontroller.nethsecurity.org``.

source: Users
it: Utenti

source: The controller has two types of users:
it: Il controller ha due tipi di utenti:

source: It is recommended to create a user for each person who needs access to the controller. When creating a new user, the administrator must specify the username, the user display name, and the user password. The username is used to log in to the controller, while the display name is used to identify the user in the controller.
it: Si consiglia di creare un utente per ogni persona che necessita di accesso al controller. Quando si crea un nuovo utente, l'amministratore deve specificare il nome utente, il nome visualizzato dell'utente e la password dell'utente. Il nome utente viene utilizzato per accedere al controller, mentre il nome visualizzato viene utilizzato per identificare l'utente nel controller.

source: Two Factor Authentication (2FA)
it: Autenticazione a due fattori (2FA)

source: Each controller user can enable Two Factor Authentication (2FA) to increase the security of the account. To enable 2FA, follow the same steps documented inside the firewall web interface: :ref:`2fa-section`.
it: Ogni utente del controller può abilitare l’Autenticazione a Due Fattori (2FA) per aumentare la sicurezza dell’account. Per abilitare la 2FA, seguire gli stessi passaggi documentati all’interno dell’interfaccia web del firewall: :ref:`2fa-section`.

source: The administrator can see the 2FA status of each user inside the user list.
it: L'amministratore può visualizzare lo stato 2FA di ciascun utente all'interno dell'elenco utenti.

source: Units
it: Unità

source: All users can manage units. A unit is a firewall that is managed by the controller.
it: Tutti gli utenti possono gestire le unità. Un'unità è un firewall gestito dal controller.

source: To connect a new unit to the controller, the user must click on the :guilabel:`Add unit` button from the controller web interface. When a new unit is added, the controller performs the following actions:
it: Per collegare una nuova unità al controller, è necessario fare clic sul pulsante :guilabel:`Aggiungi unità` dall'interfaccia web del controller. Quando viene aggiunta una nuova unità, il controller esegue le seguenti azioni:

source: creates a unique identifier for the unit
it: crea un identificatore univoco per l'unità

source: allocates an IP address inside the VPN network
it: assegna un indirizzo IP all'interno della rete VPN

source: generates a VPN configuration including certificates
it: genera una configurazione VPN inclusi i certificati

source: safely stores credentials required for accessing the remote firewall
it: memorizza in modo sicuro le credenziali necessarie per accedere al firewall remoto

source: A join code will be generated and displayed on the screen. The join code must be entered on the unit to establish the connection with the controller.
it: Un codice di accesso verrà generato e visualizzato sullo schermo. Il codice di accesso deve essere inserito sull'unità per stabilire la connessione con il controller.

source: Access the ``Controller`` page inside the unit web interface and enter the join code in the ``Join code`` field. When joining the controller, the unit will download the VPN configuration and establish a secure connection with the controller. If the connection is successful, the unit will be displayed in the controller web interface with the status ``Connected``.
it: Accedere alla pagina ``Controller`` all'interno dell'interfaccia web dell'unità ed inserire il codice di join nel campo ``Join code``. Durante la procedura di join al controller, l'unità scaricherà la configurazione VPN e stabilirà una connessione sicura con il controller. Se la connessione avviene con successo, l'unità verrà visualizzata nell'interfaccia web del controller con lo stato ``Connesso``.

source: Please note that if the controller does not have a valid Let's Encrypt certificate, you will need to disable the ``Verify TLS certificate`` option in the unit configuration.
it: Si noti che, se il controller non dispone di un certificato Let's Encrypt valido, sarà necessario disabilitare l'opzione ``Verifica certificato TLS`` nella configurazione dell'unità.

source: When the unit is connected, the user can access the unit web interface by clicking on the :guilabel:`Open unit` link without needing to enter the unit credentials.
it: Quando l'unità è collegata, è possibile accedere all'interfaccia web dell'unità facendo clic sul collegamento :guilabel:`Apri unità` senza dover inserire le credenziali dell'unità.

source: The unit user interface :ref:`must listen on port 9090 <change_ui_port-section>` to allow the controller to access it.
it: L'interfaccia utente dell'unità :ref:`deve ascoltare sulla porta 9090 <change_ui_port-section>` per consentire al controller di accedervi.

source: Remove a unit
it: Rimuovere un'unità

source: Units can be disconnected from the controller by clicking on the :guilabel:`Remove unit` button from the controller web interface. When a unit is disconnected, the controller will remove the unit configuration and the VPN connection will be terminated.
it: Le unità possono essere disconnesse dal controller facendo clic sul pulsante :guilabel:`Rimuovi unità` dall'interfaccia web del controller. Quando un'unità viene disconnessa, il controller rimuoverà la configurazione dell'unità e la connessione VPN verrà terminata.

source: After removing the unit from the controller web interface, access the unit web interface and click :guilabel:`Disconnect unit` on the ``Controller`` page: the unit will destroy the VPN configuration.
it: Dopo aver rimosso l'unità dall'interfaccia web del controller, accedere all'interfaccia web dell'unità e fare clic su :guilabel:`Disconnetti unità` nella pagina ``Controller``: l'unità eliminerà la configurazione VPN.

source: Logs management
it: Gestione dei log

source: When a unit is connected, rsyslog is reconfigured to send logs using the syslog protocol (RFC 5424). It may take a few minutes before rsyslog starts sending the data. The logs are labeled using the unit's hostname: to ensure that the user interface links work properly, make sure that:
it: Quando un'unità viene collegata, rsyslog viene riconfigurato per inviare i log utilizzando il protocollo syslog (RFC 5424). Potrebbero essere necessari alcuni minuti prima che rsyslog inizi a inviare i dati. I log sono etichettati utilizzando l'hostname dell'unità: per garantire il corretto funzionamento dei collegamenti nell'interfaccia utente, assicurarsi che:

source: the unit FQDN is unique within the cluster
it: il FQDN dell'unità è univoco all'interno del cluster

source: the unit's name is the same as its hostname
it: il nome dell'unità è lo stesso del suo hostname

source: Logs can be viewed by clicking on the :guilabel:`Open logs` link for each unit. The logs are displayed in a specific Grafana dashboard that also allows for searching and filtering.
it: I log possono essere visualizzati facendo clic sul collegamento :guilabel:`Apri log` per ciascuna unità. I log vengono mostrati in una specifica dashboard di Grafana che consente anche la ricerca e il filtraggio.

source: Logs retention period must be configured from the NS8 web interface.
it: Il periodo di conservazione dei log deve essere configurato dall'interfaccia web di NS8.

source: Metrics
it: Metriche

source: Each unit exports two types of metrics:
it: Ogni unità esporta due tipi di metriche:

source: system operating metrics (CPU, memory, disk, network): these metrics are collected using `Netdata <https://www.netdata.cloud/>`_ and stored in `Prometheus <https://prometheus.io/>`_. As soon as a unit is connected, the controller starts scraping the metrics. These metrics are available to everyone regardless of the subscription status.
it: metriche operative di sistema (CPU, memoria, disco, rete): queste metriche vengono raccolte utilizzando `Netdata <https://www.netdata.cloud/>`_ e memorizzate in `Prometheus <https://prometheus.io/>`_. Non appena un'unità viene connessa, il controller inizia a raccogliere le metriche. Queste metriche sono disponibili a tutti indipendentemente dallo stato dell'abbonamento.

source: firewall metrics (traffic, security, VPN): these metrics are sent from the unit to controller at fixed intervals. The controller stores them inside a `Timescale <https://www.timescale.com/>`_ database. These metrics are available only to users with a valid subscription.
it: metriche del firewall (traffico, sicurezza, VPN): queste metriche vengono inviate dall'unità al controller a intervalli fissi. Il controller le memorizza all'interno di un database `Timescale <https://www.timescale.com/>`_. Queste metriche sono disponibili solo per gli utenti con un .

source: All data collected and stored inside the controller is timestamped using Coordinated Universal Time (UTC). This ensures consistency and accuracy across different time zones, making it easier to correlate events and analyze trends.
it: Tutti i dati raccolti e memorizzati all'interno del controller sono contrassegnati da un timestamp utilizzando il Tempo Coordinato Universale (UTC). Questo garantisce coerenza e accuratezza tra diversi fusi orari, facilitando la correlazione degli eventi e l'analisi delle tendenze.

source: Users have the flexibility to view data in their local time zone by adjusting the time settings in Grafana. To change the local time zone, navigate to the Grafana preferences menu and select the desired time zone. This adjustment can be applied to each dashboard individually, allowing users to customize the time zone display based on their preferences.
it: Gli utenti hanno la possibilità di visualizzare i dati nel proprio fuso orario locale modificando le impostazioni dell'ora in Grafana. Per cambiare il fuso orario locale, accedere al menu delle preferenze di Grafana e selezionare il fuso orario desiderato. Questa modifica può essere applicata a ciascuna dashboard individualmente, consentendo di personalizzare la visualizzazione del fuso orario in base alle proprie preferenze.

source: The metrics can be viewed within the Grafana dashboard. Users can access the dashboard by clicking on the :guilabel:`Open metrics` link for each unit.
it: Le metriche possono essere visualizzate all'interno della dashboard di Grafana. È possibile accedere alla dashboard facendo clic sul collegamento :guilabel:`Apri metriche` per ciascuna unità.

source: By default, only the admin user can access the metrics dashboard. If you want to allow other users to access the metrics dashboard, you can create a new role and assign it to the user directly from the Grafana web interface.
it: Per impostazione predefinita, solo l'utente admin può accedere al dashboard delle metriche. Se si desidera consentire ad altri utenti di accedere al dashboard delle metriche, è possibile creare un nuovo ruolo e assegnarlo all'utente direttamente dall'interfaccia web di Grafana.

source: Grafana is an open-source platform used for monitoring and visualizing time-series data. It helps users create customizable dashboards with graphs, charts, and tables to analyze system metrics, logs, and other data from various sources.
it: Grafana è una piattaforma open-source utilizzata per il monitoraggio e la visualizzazione di dati time-series. Consente di creare dashboard personalizzabili con grafici, diagrammi e tabelle per analizzare metriche di sistema, log e altri dati provenienti da diverse fonti.

source: The controller includes a pre-configured Grafana instance that is used to visualize metrics and logs from the connected units. The Grafana instance is accessible from the URL ``https://<controller-fqdn>/grafana``.
it: Il controller include un'istanza preconfigurata di Grafana che viene utilizzata per visualizzare metriche e log provenienti dalle unità collegate. L'istanza di Grafana è accessibile dall'URL ``https://<controller-fqdn>/grafana``.

source: By default, you can access it by using the default credentials set during the controller configuration. Remember to change the default password after the first login. Grafana also provides features for managing users, teams, and permissions. It supports authentication via various methods including username/password, OAuth, LDAP, and more.
it: Per impostazione predefinita, è possibile accedervi utilizzando le credenziali predefinite impostate durante la configurazione del controller. Si consiglia di cambiare la password predefinita dopo il primo accesso. Grafana offre anche funzionalità per la gestione di utenti, team e permessi. Supporta l'autenticazione tramite diversi metodi, inclusi nome utente/password, OAuth, LDAP e altri.

source: You can also create custom dashboards and alerts to monitor the metrics and logs from the connected units. See the `official documentation <https://grafana.com/docs/grafana/latest/>`_ for more information on how to use Grafana.
it: È inoltre possibile creare dashboard personalizzate e avvisi per monitorare le metriche e i log delle unità collegate. Consultare la `documentazione ufficiale <https://grafana.com/docs/grafana/latest/>`_ per ulteriori informazioni su come utilizzare Grafana.

source: Prometheus metrics
it: Metriche Prometheus

source: Prometheus metrics are collected using Netdata and stored in a Prometheus database.
it: Le metriche Prometheus vengono raccolte utilizzando Netdata e memorizzate in un database Prometheus.

source: Metrics exported for each unit includes the following labels:
it: Le metriche esportate per ciascuna unità includono le seguenti etichette:

source: ``instance`` the VPN IP of the connected machine with the Netdata port (eg. ``172.19.64.3:19999``)
it: ``instance`` l'IP VPN della macchina connessa con la porta Netdata (es. ``172.19.64.3:19999``)

source: ``job`` fixed to `node`
it: ``job`` corretto in `node`

source: ``node`` the VPN IP of the connected machine
it: ``node`` l'IP VPN della macchina connessa

source: ``unit`` the unit unique name of the connected machine
it: ``unit`` il nome univoco dell'unità della macchina collegata

source: Such metrics are visible inside the ``Operating system`` dashboard.
it: Tali metriche sono visibili all'interno della dashboard ``Operating system``.

source: Timescale metrics
it: Metriche di Timescale

source: Subscription required
it: Subscription necessaria

source: This feature is available only if the firewall and the controller have a valid subscription.
it: Questa funzionalità è disponibile solo se il firewall e il controller dispongono di una subscription valida.
