Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/content_filter.po
Languages: it

source: Content Filtering
it: Filtro contenuti

source: Content filtering is a crucial aspect of network security, serving two primary purposes:
it: Il filtraggio dei contenuti è un aspetto cruciale della sicurezza di rete e svolge due scopi principali:

source: Blocking malware and preventing malicious attacks
it: Blocco di malware e prevenzione di attacchi dannosi

source: Filtering unwanted sites, such as those containing adult content
it: Filtraggio di siti indesiderati, come quelli che contengono contenuti per adulti

source: NethSecurity offers four distinct filtering mechanisms to address these needs:
it: NethSecurity offre quattro distinti meccanismi di filtraggio per soddisfare queste esigenze:

source: **Threat Shield IP**: IP-based blocking system targeting malware threats
it: **Threat Shield IP**: sistema di blocco basato su IP che prende di mira le minacce malware

source: **Threat Shield DNS**: DNS-based blocking system for malware and basic content filtering
it: **Threat Shield DNS**: sistema di blocco basato su DNS per malware e filtraggio di contenuti di base

source: **Deep Packet Inspection (DPI) filter**: Application and protocol-specific filtering using netifyd
it: **Filtro Deep Packet Inspection (DPI)**: Filtraggio specifico per applicazione e protocollo utilizzando netifyd

source: **FlashStart DNS filter**: Commercial DNS-based filtering solution with comprehensive content control features
it: **FlashStart DNS filter**: Soluzione commerciale di filtraggio DNS con funzionalità complete di controllo dei contenuti

source: Threat Shield IP is an IP-based blocking system designed specifically to combat malware threats. It operates by blocking connections to or from known malicious IP addresses.
it: Threat Shield IP è un sistema di blocco basato su IP progettato specificamente per contrastare le minacce malware. Funziona bloccando le connessioni verso o da indirizzi IP noti come dannosi.

source: **Scope**: Targets malware and provides limited privacy and advertising (ads) removal features
it: **Ambito**: Prende di mira il malware e offre funzionalità limitate di rimozione della privacy e della pubblicità (ads)

source: **Lists**:
it: **Elenchi**:

source: Community lists, free, targeting general malware, ads and trackers
it: Liste della community, gratuite, che mirano a malware generico, pubblicità e tracker

source: Enterprise lists, paid, focusing on high-value malware protection
it: Liste Enterprise, a pagamento, focalizzate sulla protezione da malware di alto valore

source: Advantages:
it: Vantaggi:

source: Fast processing as it works at the IP level
it: Elaborazione veloce in quanto funziona a livello IP

source: Effective against entire malicious networks
it: Efficace contro intere reti dannose

source: Limitations:
it: Limitazioni:

source: Cannot filter based on content type
it: Impossibile filtrare in base al tipo di contenuto

source: May occasionally block legitimate services sharing an IP with malicious ones
it: Può occasionalmente bloccare servizi legittimi che condividono un IP con quelli dannosi

source: To configure Threat Shield IP, see the :ref:`threat_shield_ip-section`.
it: Per configurare Threat Shield IP, consultare la sezione :ref:`threat_shield_ip-section`.

source: Threat Shield DNS provides DNS-based blocking, offering protection against malware and basic content filtering capabilities.
it: Threat Shield DNS fornisce il blocco basato su DNS, offrendo protezione contro malware e funzionalità di filtraggio dei contenuti di base.

source: **Scope**: Covers malware and limited content categories (e.g., adult content, gambling)
it: **Ambito**: Copre malware e categorie di contenuti limitate (ad esempio, contenuti per adulti, gioco d'azzardo)

source: Community lists, free, focusing on general malware and simple content filtering
it: Liste della community, gratuite, focalizzate su malware generico e filtraggio semplice dei contenuti

source: Enterprise lists, paid, focus on high-value malware protection
it: Liste Enterprise, a pagamento, focalizzate sulla protezione da malware di alto valore

source: Can block specific domains regardless of IP address
it: Può bloccare domini specifici indipendentemente dall'indirizzo IP

source: Offers basic content categorization (e.g., adult, gambling)
it: Offre una categorizzazione di base dei contenuti (ad esempio, contenuti per adulti, gioco d'azzardo)

source: Could be bypassed by using alternative DNS servers, but can be mitigated with DPI filtering and by enabling special block categories
it: Potrebbe essere aggirato utilizzando server DNS alternativi, ma può essere mitigato con il filtraggio DPI e abilitando categorie di blocco speciali.

source: Less granular than full URL filtering
it: Meno granulare rispetto al filtraggio completo degli URL

source: To configure Threat Shield DNS, see the :ref:`threat_shield_dns-section`.
it: Per configurare Threat Shield DNS, consultare la sezione :ref:`threat_shield_dns-section`.

source: FlashStart DNS filter
it: Filtro DNS FlashStart

source: FlashStart is a commercial DNS-based filtering solution that offers comprehensive content control and reporting features.
it: FlashStart è una soluzione commerciale di filtraggio basata su DNS che offre funzionalità complete di controllo dei contenuti e di reportistica.

source: **Scope**: Comprehensive content filtering beyond just malware and adult content
it: **Ambito**: contenuti completo che va oltre il solo malware e i contenuti per adulti

source: **Lists**: Commercial lists maintained by FlashStart
it: **Liste**: Liste commerciali gestite da FlashStart

source: High-quality block lists
it: Liste di blocco di alta qualità

source: Customizable reports
it: Report personalizzabili

source: Cloud-based configuration, no direct firewall access required
it: Configurazione basata su cloud, non è necessario l'accesso diretto al firewall

source: Extensive content categories
it: Categorie di contenuti estese

source: Easy to manage
it: Facile da gestire

source: Scalable for organizations of various sizes
it: Scalabile per organizzazioni di diverse dimensioni

source: To configure FlashStart DNS filtering, see the :ref:`flashstart-section`.
it: Per configurare il filtro DNS di FlashStart, consultare la sezione :ref:`flashstart-section`.

source: Deep Packet Inspection (DPI) filter
it: Filtro Deep Packet Inspection (DPI)

source: NethSecurity employs Deep Packet Inspection (DPI) techniques for filtering network traffic using the Netify Agent.
it: NethSecurity utilizza tecniche di Deep Packet Inspection (DPI) per filtrare il traffico di rete tramite Netify Agent.

source: **Scope**: Application and protocol-specific filtering
it: **Ambito**: Filtro specifico per applicazione e protocollo

source: Community signatures, free but limited in number and update frequency
it: Firme della community, gratuite ma limitate nel numero e nella frequenza di aggiornamento

source: Enterprise signatures, included in any subscription, offering more comprehensive coverage
it: Firme Enterprise, incluse in qualsiasi abbonamento, offrono una copertura più completa

source: Provides granular control over network traffic
it: Fornisce un controllo granulare sul traffico di rete

source: Can identify and filter based on specific applications or protocols
it: Può identificare e filtrare in base ad applicazioni o protocolli specifici

source: Allows for dynamic traffic management based on real-time analysis
it: Consente la gestione dinamica del traffico basata sull'analisi in tempo reale

source: Considerations:
it: Considerazioni:

source: May require more processing power compared to IP or DNS-based filtering
it: Potrebbe richiedere una maggiore potenza di elaborazione rispetto al filtraggio basato su IP o DNS

source: Requires careful configuration to balance security and performance
it: Richiede una configurazione accurata per bilanciare sicurezza e prestazioni

source: The administrator needs to create DPI rules for each interface
it: L'amministratore deve creare regole DPI per ciascuna interfaccia

source: To configure DPI filtering, see the :ref:`dpi_filter-section`.
it: Per configurare il filtraggio DPI, consultare la sezione :ref:`dpi_filter-section`.

source: Comparison of filtering options
it: Confronto delle opzioni di filtraggio

source: Feature
it: Funzionalità

source: Flashstart DNS Filtering
it: Filtro DNS Flashstart

source: DPI Filter
it: Filtro DPI

source: Blocking method
it: Metodo di blocco

source: IP-based
it: Basato su IP

source: DNS-based
it: Basato su DNS

source: Packet inspection
it: Ispezione dei pacchetti

source: Primary focus
it: Focus principale

source: Malware + basic content
it: Malware + contenuto di base

source: Comprehensive content
it: Contenuto completo

source: Application/Protocol specific
it: Specifico per applicazione/protocollo

source: List types
it: Tipi di elenco

source: Commercial
it: Commerciale

source: N/A (real-time analysis)
it: N/D (analisi in tempo reale)

source: Configuration
it: Configurazione

source: Firewall (per interface)
it: Firewall (per interfaccia)

source: Reporting
it: Reportistica

source: None
it: Nessuno

source: Advanced, customizable
it: Avanzato, personalizzabile

source: Limited
it: Limitato

source: Implementation strategies
it: Strategie di implementazione

source: For optimal security, consider a layered approach:
it: Per una sicurezza ottimale, si consiglia di adottare un approccio a più livelli:

source: Use Threat Shield IP as the first line of defense against known malicious networks.
it: Utilizzare Threat Shield IP come prima linea di difesa contro le reti dannose conosciute.

source: Implement a DNS filter, use one of the following options:
it: Implementare un filtro DNS, utilizzare una delle seguenti opzioni:

source: Threat Shield DNS to catch domain-based threats and provide basic content filtering or
it: Threat Shield DNS per rilevare minacce basate su dominio e fornire un filtro dei contenuti di base

source: Flashstart DNS Filtering for comprehensive content control, especially in environments requiring detailed policy management and reporting.
it: Flashstart DNS Filtering per un controllo completo dei contenuti, particolarmente indicato in ambienti che richiedono una gestione dettagliata delle policy e reportistica avanzata.

source: Utilize DPI filtering for granular control over specific applications and protocols, and to manage traffic based on real-time analysis.
it: Utilizzare il filtraggio DPI per un controllo granulare su applicazioni e protocolli specifici, e per gestire il traffico in base all'analisi in tempo reale.

source: This combination provides defense-in-depth, addressing various threat vectors and content filtering needs.
it: Questa combinazione offre una difesa stratificata, affrontando diversi vettori di minaccia ed esigenze di filtraggio dei contenuti.
