Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/custom_openvpn_tunnel.po
Languages: it

source: Custom OpenVPN tunnel
it: Tunnel OpenVPN personalizzato

source: This guide explains how to configure an OpenVPN client on NethSecurity using a configuration file (``myvpn.ovpn``) provided by a VPN service provider. The configuration ensures the VPN starts automatically when the firewall boots.
it: Questa guida spiega come configurare un client OpenVPN su NethSecurity utilizzando un file di configurazione (``myvpn.ovpn``) fornito da un provider di servizi VPN. La configurazione garantisce che la VPN si avvii automaticamente all'avvio del firewall.

source: Prerequisites
it: Prerequisiti

source: A valid OpenVPN configuration file (`myvpn.ovpn`) from your VPN provider.
it: Un file di configurazione OpenVPN valido (`myvpn.ovpn`) fornito dal proprio provider VPN.

source: Access to the NethSecurity terminal via SSH.
it: Accesso al terminale NethSecurity tramite SSH.

source: Basic familiarity with the UCI (Unified Configuration Interface) system in OpenWrt/NethSecurity.
it: Familiarità di base con il sistema UCI (Unified Configuration Interface) in OpenWrt/NethSecurity.

source: Additional notes on CLI configuration
it: Note aggiuntive sulla configurazione della CLI

source: This procedure does not include any validation of the entered data. Therefore, it is intended to be performed by advanced users familiar with the NethSecurity environment and OpenVPN configurations.
it: Questa procedura non include alcuna validazione dei dati inseriti. Pertanto, è destinata a essere eseguita da utenti avanzati che hanno familiarità con l'ambiente NethSecurity e le configurazioni di OpenVPN.

source: The VPN created using this method will not appear in the NethSecurity web interface and can only be managed through the command line interface (CLI).
it: La VPN creata utilizzando questo metodo non apparirà nell'interfaccia web di NethSecurity e potrà essere gestita solo tramite l'interfaccia a riga di comando (CLI).

source: It is critical to avoid using the same name for a VPN created via the CLI and one configured through the NethSecurity web interface. Since there are no safeguards in place to prevent naming conflicts, such overlap may cause configuration issues.
it: È fondamentale evitare di utilizzare lo stesso nome per una VPN creata tramite CLI e una configurata attraverso l'interfaccia web di NethSecurity. Poiché non sono presenti meccanismi di protezione per prevenire conflitti di denominazione, tale sovrapposizione potrebbe causare problemi di configurazione.

source: For these reasons, caution and attention to detail are strongly advised when performing this procedure.
it: Per questi motivi, si raccomanda vivamente cautela e attenzione ai dettagli durante l'esecuzione di questa procedura.

source: Configure the VPN
it: Configurare la VPN

source: 1. Place the configuration file in the correct directory
it: 1. Posizionare il file di configurazione nella directory corretta

source: Copy the ``myvpn.ovpn`` file to the directory ``/etc/openvpn/``. Use SCP or a similar tool to transfer the file: ::
it: Copiare il file ``myvpn.ovpn`` nella directory ``/etc/openvpn/``. Utilizzare SCP o uno strumento simile per trasferire il file: ::

source: Make sure to set the correct file permissions: ::
it: Assicurarsi di impostare i permessi corretti per il file: ::

source: 2. Create a new OpenVPN client configuration in UCI
it: 2. Creare una nuova configurazione client OpenVPN in UCI

source: Add a new OpenVPN section in the UCI database called ``myvpn``, link the configuration file to this section and enable the VPN ::
it: Aggiungere una nuova sezione OpenVPN nel database UCI chiamata ``myvpn``, collegare il file di configurazione a questa sezione e abilitare la VPN ::

source: Commit the changes to save the configuration: ::
it: Eseguire il commit delle modifiche per salvare la configurazione: ::

source: 3. Start the VPN client immediately
it: 3. Avviare immediatamente il client VPN

source: To start the VPN client without rebooting the system, run: ::
it: Per avviare il client VPN senza riavviare il sistema, eseguire: ::

source: This will restart all configured OpenVPN tunnels.
it: Questo riavvierà tutti i tunnel OpenVPN configurati.

source: 4. Verify the VPN is running
it: 4. Verificare che la VPN sia in esecuzione

source: To ensure OpenVPN is using the correct configuration file and is running as expected, check the active processes: ::
it: Per assicurarsi che OpenVPN stia utilizzando il file di configurazione corretto e stia funzionando come previsto, verificare i processi attivi: ::

source: The output should resemble the following (example configuration name ``myvpn``): ::
it: L'output dovrebbe essere simile al seguente (nome di configurazione di esempio ``myvpn``): ::

source: Confirm the ``--config`` parameter points to the correct configuration file (e.g., ``myvpn.ovpn``). Ensure all references (e.g., ``myvpn``) match your intended VPN configuration.
it: Confermare che il parametro ``--config`` punti al file di configurazione corretto (ad esempio, ``myvpn.ovpn``). Assicurarsi che tutti i riferimenti (ad esempio, ``myvpn``) corrispondano alla configurazione VPN desiderata.

source: Check the OpenVPN logs to confirm the connection: ::
it: Controllare i log di OpenVPN per confermare la connessione: ::

source: You should see log entries indicating a successful connection.
it: Dovrebbero comparire voci di log che indicano una connessione riuscita.

source: **File name consistency:** The configuration name ``myvpn`` must match the OpenVPN section name in UCI and the configuration file's location. If you change the name, ensure all references to ``myvpn`` in commands and filenames are updated.
it: **Coerenza del nome del file:** Il nome della configurazione ``myvpn`` deve corrispondere al nome della sezione OpenVPN in UCI e alla posizione del file di configurazione. Se si modifica il nome, assicurarsi che tutti i riferimenti a ``myvpn`` nei comandi e nei nomi dei file siano aggiornati.

source: **Automatic startup:** By setting ``enabled='1'``, the VPN client will automatically start whenever the firewall boots.
it: **Avvio automatico:** Impostando ``enabled='1'``, il client VPN si avvierà automaticamente ogni volta che il firewall viene avviato.

source: Configure authentication credentials (optional)
it: Configurare le credenziali di autenticazione (opzionale)

source: If the VPN requires a username and password, create an authentication file.
it: Se la VPN richiede un nome utente e una password, creare un file di autenticazione.

source: Create a file named ``/etc/openvpn/myvpn.auth`` (replace ``myvpn`` with the VPN name if different): ::
it: Creare un file denominato ``/etc/openvpn/myvpn.auth`` (sostituire ``myvpn`` con il nome della VPN se diverso): ::

source: Add the following content, replacing ``frank`` and ``frank_password`` with your username and password: ::
it: Aggiungere il seguente contenuto, sostituendo ``frank`` e ``frank_password`` con il proprio nome utente e la propria password: ::

source: Save and set the correct permissions: ::
it: Salvare e impostare i permessi corretti: ::

source: Update the OpenVPN configuration file (``myvpn.ovpn``) to reference the authentication file. ::
it: Aggiornare il file di configurazione OpenVPN (``myvpn.ovpn``) per fare riferimento al file di autenticazione. ::

source: Authentication file: when using an authentication file, ensure it has strict permissions (`600`) to protect sensitive information.
it: File di autenticazione: quando si utilizza un file di autenticazione, assicurarsi che abbia permessi restrittivi (``600``) per proteggere le informazioni sensibili.

source: Configure the firewall to allow traffic for the VPN
it: Configurare il firewall per consentire il traffico per la VPN

source: To enable traffic through the VPN, it is necessary to configure the firewall on NethSecurity. The best practice is to assign a fixed device name to the VPN, create a dedicated zone for the custom VPN, and associate the VPN device with that zone.
it: Per abilitare il traffico attraverso la VPN, è necessario configurare il firewall su NethSecurity. La pratica consigliata è assegnare un nome dispositivo fisso alla VPN, creare una zona dedicata per la VPN personalizzata e associare il dispositivo VPN a quella zona.

source: 1. Fix the VPN device name
it: 1. Correggere il nome del dispositivo VPN

source: To ensure the VPN device name remains consistent and avoids automatic assignment, it is crucial to fix the name in the OpenVPN configuration file. Edit the file (``/etc/openvpn/myvpn.ovpn``) to change ``dev tun`` to ``dev tunmyvpn`` and add the following line (this example is made with a *routed* vpn): ::
it: Per garantire che il nome del dispositivo VPN rimanga coerente ed evitare l'assegnazione automatica, è fondamentale fissare il nome nel file di configurazione di OpenVPN. Modificare il file (``/etc/openvpn/myvpn.ovpn``) per cambiare ``dev tun`` in ``dev tunmyvpn`` e aggiungere la seguente riga (questo esempio è realizzato con una VPN *routed*): ::

source: Please remember that the interface name (referred to as ``tunmyvpn`` in the example) must not exceed 13 characters.
it: Si ricorda che il nome dell'interfaccia (indicato come ``tunmyvpn`` nell'esempio) non deve superare i 13 caratteri.

source: 2. Create a firewall zone
it: 2. Creare una zona firewall

source: From the NethSecurity UI, create a new firewall zone named ``myzone``. Configure this zone to allow access to the required resources.
it: Dall'interfaccia utente di NethSecurity, creare una nuova zona firewall denominata ``myzone``. Configurare questa zona per consentire l'accesso alle risorse necessarie.

source: 3. Associate the VPN device with the zone
it: 3. Associare il dispositivo VPN alla zona

source: To associate the VPN device with the ``myzone`` firewall zone, perform the following steps in the command line:
it: Per associare il dispositivo VPN alla zona firewall ``myzone``, eseguire i seguenti passaggi dalla riga di comando:

source: Add the VPN device (``tunmyvpn``) to the firewall zone: ::
it: Aggiungere il dispositivo VPN (``tunmyvpn``) alla zona del firewall: ::

source: Restart the firewall to apply the changes: ::
it: Riavviare il firewall per applicare le modifiche: ::

source: These changes ensure the VPN device will always be named ``tunmyvpn``, preventing potential issues with the firewall zone association.
it: Queste modifiche garantiscono che il dispositivo VPN venga sempre denominato ``tunmyvpn``, prevenendo potenziali problemi con l'associazione alla zona del firewall.

source: Disable the tunnel
it: Disabilitare il tunnel

source: If you want to prevent the VPN from starting automatically when the firewall boots, you can disable it using the following commands.
it: Se si desidera impedire l'avvio automatico della VPN all'avvio del firewall, è possibile disabilitarla utilizzando i seguenti comandi.

source: Disable the VPN in UCI: ::
it: Disabilitare la VPN in UCI: ::

source: Restart all active VPN tunnels. This command will stop all tunnels and fully restart only those with the enabled value set to 1: ::
it: Riavvia tutti i tunnel VPN attivi. Questo comando interromperà tutti i tunnel e riavvierà completamente solo quelli con il valore enabled impostato a 1: ::
