Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/ddns.po
Languages: it

source: Dynamic DNS
it: DNS dinamico

source: Dynamic DNS (DDNS) automatically updates your domain name's DNS record with your current IP address, even if it changes dynamically. This allows you to access your firewall remotely using a consistent domain name instead of remembering a potentially changing IP address.
it: Il Dynamic DNS (DDNS) aggiorna automaticamente il record DNS del proprio nome di dominio con l'indirizzo IP attuale, anche se questo cambia dinamicamente. Questo consente di accedere al firewall da remoto utilizzando un nome di dominio costante invece di dover ricordare un indirizzo IP che potrebbe cambiare.

source: Supported Providers
it: Provider supportati

source: NethSecurity supports the following DDNS providers:
it: NethSecurity supporta i seguenti provider DDNS:

source: Prerequisites:
it: Prerequisiti:

source: A NethSecurity firewall with internet access.
it: Un firewall NethSecurity con accesso a Internet.

source: An account with your chosen DDNS provider.
it: Un account presso il provider DDNS scelto.

source: A registered domain name with your DDNS provider.
it: Un nome di dominio registrato presso il proprio provider DDNS.

source: General configuration steps
it: Passaggi generali di configurazione

source: Open a terminal window on your firewall.
it: Aprire una finestra del terminale sul firewall.

source: Select your chosen DDNS provider from the list of supported providers. To obtain the list of supported providers, run the following command: ::
it: Selezionare il provider DDNS desiderato dall'elenco dei provider supportati. Per ottenere l'elenco dei provider supportati, eseguire il seguente comando: ::

source: Enter your DDNS configuration details, including your provider credentials in the designated fields. These may include:
it: Inserire i dettagli di configurazione DDNS, inclusi le credenziali del provider nei campi designati. Questi possono includere:

source: The DDNS provider's service name, from the above list: use the ``service_name`` field.
it: Il nome del servizio del provider DDNS, dall'elenco sopra: utilizzare il campo ``service_name``.

source: Username or client ID: use the ``username`` field.
it: Nome utente o ID client: utilizzare il campo ``username``.

source: Password or API key: use the ``password`` field.
it: Password o chiave API: utilizzare il campo ``password``.

source: Domain name to be associated with your dynamic IP address: use the ``domain`` field, you can also use the ``lookup_host`` field.
it: Nome di dominio da associare al proprio indirizzo IP dinamico: utilizzare il campo ``domain``, è anche possibile utilizzare il campo ``lookup_host``.

source: Interface to monitor for IP address changes (e.g., "wan"): use the ``interface`` field.
it: Interfaccia da monitorare per le modifiche dell'indirizzo IP (ad esempio, "wan"): utilizzare il campo ``interface``.

source: While the general steps remain consistent, specific configuration details may vary slightly depending on your chosen provider. It's recommended to consult your provider's documentation for detailed instructions and any additional settings required.
it: Sebbene i passaggi generali siano simili, i dettagli specifici della configurazione possono variare leggermente a seconda del provider scelto. Si consiglia di consultare la documentazione del provider per istruzioni dettagliate e per eventuali impostazioni aggiuntive richieste.

source: Due to the variety of supported providers, including their unique interfaces and authentication methods, it's not possible to provide specific configuration steps for each provider within this guide.
it: A causa della varietà di provider supportati, inclusi le loro interfacce uniche e i metodi di autenticazione specifici, non è possibile fornire in questa guida istruzioni di configurazione dettagliate per ciascun provider.

source: If your provider is not listed, you may still be able to configure it using a :ref:`custom configuration <custom-ddns-section>`.
it: Se il proprio provider non è elencato, è comunque possibile configurarlo utilizzando una :ref:`configurazione personalizzata <custom-ddns-section>`.

source: Using the UCI command line
it: Utilizzo della riga di comando UCI

source: Use uci commands to set and commit configuration options: ::
it: Utilizzare i comandi uci per impostare e confermare le opzioni di configurazione: ::

source: Remember to replace placeholders with your values.
it: Ricordarsi di sostituire i segnaposto con i propri valori.

source: Then, restart the DDNS service: ::
it: Quindi, riavviare il servizio DDNS: ::

source: See the `UCI documentation <https://openwrt.org/docs/guide-user/base-system/ddns>`_ for a full list of supported settings.
it: Consultare la `documentazione UCI <https://openwrt.org/docs/guide-user/base-system/ddns>`_ per un elenco completo delle impostazioni supportate.

source: Additional notes:
it: Note aggiuntive:

source: Ensure your chosen DDNS provider plan supports API access and dynamic updates.
it: Assicurarsi che il piano del provider DDNS scelto supporti l'accesso API e gli aggiornamenti dinamici.

source: Double-check all entered credentials for accuracy to avoid update failures.
it: Verificare attentamente tutte le credenziali inserite per garantirne l'accuratezza ed evitare errori durante l'aggiornamento.

source: Consider enabling logging for the DDNS service to monitor updates and troubleshoot any issues.
it: Considerare l'abilitazione della registrazione (logging) per il servizio DDNS per monitorare gli aggiornamenti e risolvere eventuali problemi.

source: Some providers may offer advanced features like wildcards and subdomain updates. Explore these options based on your specific needs.
it: Alcuni provider possono offrire funzionalità avanzate come i caratteri jolly e l'aggiornamento dei sottodomini. Esplorare queste opzioni in base alle proprie esigenze specifiche.

source: Example: afraid.org (FreeDNS)
it: Esempio: afraid.org (FreeDNS)

source: Configure a domain with FreeDNS (afraid.org) using the UCI command line. The domain is named "sanchio.crabdance.com" and the username and password are "myuser" and "mypass", respectively. ::
it: Configurare un dominio con FreeDNS (afraid.org) utilizzando la riga di comando UCI. Il dominio si chiama "sanchio.crabdance.com" e il nome utente e la password sono "myuser" e "mypass", rispettivamente. ::

source: Custom example: dyndns.it (DynDNS)
it: Esempio personalizzato: dyndns.it (DynDNS)

source: You can also configure some custom DDNS providers using the UCI command line. Configure a domain with DynDNS using the UCI command line. The domain is named "nstest1.freeddns.it" and the username and password are "nstest1" and "nstest", respectively. ::
it: È inoltre possibile configurare alcuni provider DDNS personalizzati utilizzando la riga di comando UCI. Configurare un dominio con DynDNS utilizzando la riga di comando UCI. Il dominio si chiama "nstest1.freeddns.it" e il nome utente e la password sono rispettivamente "nstest1" e "nstest". ::

source: Using Luci
it: Utilizzo di Luci

source: The :ref:`Luci <luci-section>` web interface offers a simplified way to configure DDNS on NethSecurity. Refer to the `official documentation <https://openwrt.org/docs/guide-user/services/ddns/client#web_interface_instructions>`_ for detailed instructions on using Luci to configure DDNS.
it: L'interfaccia web :ref:`Luci <luci-section>` offre un modo semplificato per configurare DDNS su NethSecurity. Consultare la `documentazione ufficiale <https://openwrt.org/docs/guide-user/services/ddns/client#web_interface_instructions>`_ per istruzioni dettagliate sull'utilizzo di Luci per configurare DDNS.
