Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/dns_dhcp.po
Languages: it

source: 4.Set the upstream DHCP server address: ::
it: 4. Impostare l'indirizzo del server DHCP upstream: ::

source: 5.Commit the configuration: ::
it: 5. Confermare la configurazione: ::

source: 6.Reload the system configuration: ::
it: 6. Ricaricare la configurazione del sistema: ::

source: Example
it: Esempio
