Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/dns_dhcp.po
Languages: it

source: DNS & DHCP
it: DNS e DHCP

source: NethSecurity can provide DNS and DHCP services to every local network. This section is divided in 5 tabs:
it: NethSecurity può fornire servizi DNS e DHCP a tutte le reti locali. Questa sezione è suddivisa in 5 schede:

source: DHCP and MAC binding
it: DHCP e MAC bindining

source: Static leases
it: Lease statiche

source: Dynamic leases
it: Lease dinamici

source: DNS records
it: Record DNS

source: This section allows you to enable and manage a DHCP server for every local network configured in your NethSecurity. Every local interface is provided with a card where you can enable the service clicking on button :guilabel:`Edit`.
it: Questa sezione consente di abilitare e gestire un server DHCP per ogni rete locale configurata nel proprio NethSecurity. Ogni interfaccia locale è dotata di una scheda in cui è possibile abilitare il servizio facendo clic sul pulsante :guilabel:`Modifica`.

source: Available fields:
it: Campi disponibili:

source: ``Status``: enable/disable the MAC-IP binding feature for this interface
it: ``Stato``: abilita/disabilita la funzione di binding MAC-IP per questa interfaccia

source: ``Type``: it's possible to choose between two types of MAC-IP binding:
it: ``Tipo``: è possibile scegliere tra due tipi di binding MAC-IP:

source: ``Soft binding``: allows hosts without a reservation, blocks mismatched IP/MAC
it: ``Soft binding``: consente agli host senza una reservation, blocca IP/MAC non corrispondenti

source: **Example**: An office network where employees frequently bring their own devices (BYOD). In this case Soft binding allows devices without a reservation to access the network, but ensures that any device with a mismatched IP/MAC address is blocked. This provides flexibility for employees while maintaining a level of security.
it: **Esempio**: Una rete aziendale in cui i dipendenti portano frequentemente i propri dispositivi (BYOD). In questo caso, il Soft binding consente ai dispositivi senza una reservation di accedere alla rete, ma garantisce che qualsiasi dispositivo con un indirizzo IP/MAC non corrispondente venga bloccato. Questo offre flessibilità ai dipendenti mantenendo comunque un certo livello di sicurezza.

source: **Example**: A corporate network with strict security policies. Here hard binding ensures that only devices with a pre-configured reservation can access the network. This prevents that employees steal an IP with higher authorizations.
it: **Esempio**: Una rete aziendale con politiche di sicurezza rigorose. In questo caso, il hard binding garantisce che solo i dispositivi con una reservation preconfigurata possano accedere alla rete. Questo impedisce che i dipendenti rubino un IP con autorizzazioni superiori.

source: ``Enable DHCP`` : enable/disable the service
it: ``Abilita DHCP`` : abilita/disabilita il servizio

source: ``Range IP start`` : first IP address of DHCP range
it: ``Inizio intervallo IP`` : primo indirizzo IP dell'intervallo DHCP

source: ``Range IP end`` : last IP address of DHCP range
it: ``Fine intervallo IP`` : ultimo indirizzo IP dell'intervallo DHCP

source: ``Lease time`` : lease time (default 1 hour)
it: ``Tempo di lease`` : tempo di lease (predefinito 1 ora)

source: **DHCP Advanced settings**
it: **Impostazioni avanzate DHCP**

source: ``Force DHCP server start``
it: ``Forza l'avvio del server DHCP``

source: Upon startup, the DHCP server checks if there are other DHCP servers on the network. With this option disabled, the DHCP server won't be activated if another one is detected on the network. If the force option is enabled, the DHCP server will be started even if there are other DHCP servers within the network.
it: All'avvio, il server DHCP verifica se sono presenti altri server DHCP sulla rete. Con questa opzione disabilitata, il server DHCP non verrà attivato se ne viene rilevato un altro sulla rete. Se l'opzione di forzatura è abilitata, il server DHCP verrà avviato anche se sono presenti altri server DHCP all'interno della rete.

source: ``DHCP option``
it: ``Opzione DHCP``

source: It is possible to declare very specific DHCP options, searching for the field to configure (e.g. DNS passed to clients, tftp IP address and so on) and then specifying the value. The value can be also a list of values separated by a comma.
it: È possibile dichiarare opzioni DHCP molto specifiche, cercando il campo da configurare (ad esempio, DNS passato ai client, indirizzo IP tftp e così via) e quindi specificando il valore. Il valore può anche essere un elenco di valori separati da una virgola.

source: Example to override the DNS passed to clients with 2 servers:
it: Esempio per sovrascrivere il DNS passato ai client con 2 server:

source: selected option: ``dns-server``
it: opzione selezionata: ``dns-server``

source: value: ``1.1.1.1,8.8.8.8``
it: valore: ``1.1.1.1,8.8.8.8``

source: See also :ref:`dns_dhcp_custom-section` for more information on non-standard options.
it: Vedere anche :ref:`dns_dhcp_custom-section` per ulteriori informazioni sulle opzioni non standard.

source: Static Leases
it: Lease statici

source: Static leases assigns stable IP addresses and symbolic hostnames to DHCP clients. The host is identified by its MAC address, assigned a fixed IP address, and provided with a symbolic hostname for easy recognition.
it: I lease statici assegnano indirizzi IP stabili e nomi host simbolici ai client DHCP. L'host viene identificato tramite il suo indirizzo MAC, gli viene assegnato un indirizzo IP fisso e viene fornito un nome host simbolico per un facile riconoscimento.

source: Click the button :guilabel:`Add reservation` to add a new device's reservation.
it: Fare clic sul pulsante :guilabel:`Aggiungi reservation` per aggiungere una nuova reservation per un dispositivo.

source: ``Hostname`` : Hostname associated to the IP address
it: ``Nome host`` : Nome host associato all'indirizzo IP

source: ``IP address`` : IP address to assign to the specified MAC Address.The IP address must be within the DHCP range
it: ``Indirizzo IP`` : Indirizzo IP da assegnare al MAC Address specificato. L'indirizzo IP deve essere compreso nell'intervallo DHCP.

source: ``MAC address`` : MAC address of the device where you want to make the reservation
it: ``Indirizzo MAC`` : Indirizzo MAC del dispositivo per cui si desidera effettuare la reservation

source: ``Reservation name`` : Optional, freely configurable filed
it: ``Nome reservation`` : Facoltativo, campo configurabile liberamente

source: Dynamic leases represents IP addresses that are currently in use and have been allocated to devices on the network. This tab shows all currently active leases.
it: I lease dinamici rappresentano gli indirizzi IP attualmente in uso e assegnati ai dispositivi sulla rete. Questa scheda mostra tutti i lease attualmente attivi.

source: Default Configuration
it: Configurazione predefinita

source: By default, the DHCP server has a limit of 1000 concurrent leases to prevent DoS attacks. Set the dnsmasq ``dhcpleasemax`` option to change the limit.
it: Per impostazione predefinita, il server DHCP ha un limite di 1000 lease simultanei per prevenire attacchi DoS. Impostare l'opzione ``dhcpleasemax`` di dnsmasq per modificare il limite.

source: Non-standard custom options
it: Opzioni personalizzate non standard

source: In addition to the standard DHCP options, NethSecurity allows you to configure non-standard custom options, such as option 82 (DHCP Relay Agent Information). These options can be useful for advanced configurations or specific network requirements.
it: Oltre alle opzioni DHCP standard, NethSecurity consente di configurare opzioni personalizzate non standard, come l'opzione 82 (DHCP Relay Agent Information). Queste opzioni possono essere utili per configurazioni avanzate o requisiti di rete specifici.

source: To set a custom option from the command line, use the following commands:
it: Per impostare un'opzione personalizzata dalla riga di comando, utilizzare i seguenti comandi:

source: Custom options configured via the command line are preserved even when changes are made through the UI. Custom options can be safely removed from the UI.
it: Le opzioni personalizzate configurate tramite la riga di comando vengono mantenute anche quando vengono apportate modifiche tramite l'interfaccia utente. Le opzioni personalizzate possono essere rimosse in modo sicuro dall'interfaccia utente.

source: However, users should avoid modifying these custom options directly from the UI to prevent unexpected behavior.
it: Tuttavia, si consiglia di evitare di modificare queste opzioni personalizzate direttamente dall'interfaccia utente per prevenire comportamenti imprevisti.

source: The system employs `Dnsmasq <https://thekelleys.org.uk/dnsmasq/doc.html>`_ a as a downstream caching DNS server. Dnsmasq functions as a local caching nameserver, which by default forwards DNS queries to the upstream DNS servers provided by the DHCP server of the WAN interfaces. However, this behavior can be customized using the following configuration options:
it: Il sistema utilizza `Dnsmasq <https://thekelleys.org.uk/dnsmasq/doc.html>`_ come server DNS cache downstream. Dnsmasq funziona come un nameserver locale con cache, che per impostazione predefinita inoltra le query DNS ai server DNS a monte forniti dal server DHCP delle interfacce WAN. Tuttavia, questo comportamento può essere personalizzato utilizzando le seguenti opzioni di configurazione:

source: ``DNS forwarding servers``: Click the button :guilabel:`Add DNS Server` to specify the desired upstream DNS, you can add more servers, each one is individually managed.
it: ``Server di DNS forwarding``: Fare clic sul pulsante :guilabel:`Aggiungi server DNS` per specificare il DNS upstream desiderato; è possibile aggiungere più server, ognuno dei quali viene gestito individualmente.

source: ``DNS Domain`` : Insert the the local DNS domain, ensuring that queries for this domain are always resolved locally.
it: ``DNS Domain`` : Inserire il dominio DNS locale, assicurandosi che le query per questo dominio vengano sempre risolte localmente.

source: ``Log DNS queries``: enable it if you want all the DNS queries to be logged by the system.
it: ``Log query DNS``: abilitarlo se si desidera che tutte le query DNS vengano registrate dal sistema.

source: Forwarding servers
it: Server di forwarding

source: You only need to configure forwarders if your WAN interfaces are set up with static IP addresses. If your WAN interfaces are configured via DHCP, typically provided by your ISP, the system will automatically use the DNS servers supplied by the WAN interfaces. Automatically configured upstream DNS servers can be found in the `/tmp/resolv.conf.d/resolv.conf.auto` file.
it: È necessario configurare i forwarder solo se le interfacce WAN sono impostate con indirizzi IP statici. Se le interfacce WAN sono configurate tramite DHCP, solitamente fornito dal proprio ISP, il sistema utilizzerà automaticamente i server DNS forniti dalle interfacce WAN. I server DNS upstream configurati automaticamente possono essere trovati nel file `/tmp/resolv.conf.d/resolv.conf.auto`.

source: You can configure the following:
it: È possibile configurare quanto segue:

source: **Specify a single upstream DNS server:** enter the IP address of the desired DNS server in the designated field.
it: **Specificare un singolo server DNS upstream:** inserire l'indirizzo IP del server DNS desiderato nel campo designato.

source: **Set up domain-specific DNS servers:** this allows you to route queries for specific domains to different servers.
it: **Configurare server DNS specifici per dominio:** questo consente di instradare le query per domini specifici verso server diversi.

source: Domain-specific DNS servers
it: Server DNS specifici per dominio

source: To use a custom DNS server for a specific domain, use the following syntax:
it: Per utilizzare un server DNS personalizzato per un dominio specifico, utilizzare la seguente sintassi:

source: where:
it: dove:

source: IP_ADDRESS: specify the IP address of the desired server
it: IP_ADDRESS: specificare l'indirizzo IP del server desiderato

source: PORT: append the desired port (after the IP address using `#` character).
it: PORTA: aggiungere la porta desiderata (dopo l'indirizzo IP utilizzando il carattere `#`).

source: The ``PORT`` value is optional so usually the configuration appears just like:
it: Il valore ``PORT`` è opzionale, quindi di solito la configurazione appare semplicemente così:

source: These are the main supported options:
it: Queste sono le principali opzioni supportate:

source: Empty domain (``//``): matches unqualified names (without dots).
it: Dominio vuoto (``//``): corrisponde a nomi non qualificati (senza punti).

source: Specific domain (``/google.com/``): matches the exact domain and all its subdomains (e.g., google.com, www.google.com, drive.google.com...).
it: Dominio specifico (``/google.com/``): corrisponde esattamente al dominio indicato e a tutti i suoi sottodomini (ad esempio, google.com, www.google.com, drive.google.com...).

source: Wildcard domain (``*google.com/``): matches any domain **containing** "google.com" (e.g., google.com, www.google.com, supergoogle.com).
it: Dominio wildcard (``*google.com/``): corrisponde a qualsiasi dominio **contenente** "google.com" (ad esempio, google.com, www.google.com, supergoogle.com).

source: Examples:
it: Esempi:

source: Send all queries for "google.com" and its subdomains to 1.2.3.4: ``/google.com/1.2.3.4``
it: Inviare tutte le query per "google.com" e i suoi sottodomini a 1.2.3.4: ``/google.com/1.2.3.4``

source: Send all unqualified names (e.g., "localhost") to 10.0.0.1 and everything else to standard servers: ``//10.0.0.1``
it: Inviare tutti i nomi non qualificati (ad esempio, "localhost") a 10.0.0.1 e tutto il resto ai server standard: ``//10.0.0.1``

source: Send queries for domain "ad.nethserver.org" and its subdomains to 192.168.1.1 and everything else to standard servers: ``/ad.nethserver.org/192.168.1.1``
it: Inviare le query per il dominio "ad.nethserver.org" e i suoi sottodomini a 192.168.1.1 e tutto il resto ai server standard: ``/ad.nethserver.org/192.168.1.1``

source: More specific domains take precedence over less specific domains, so for a configuration like this:
it: I domini più specifici hanno la precedenza su quelli meno specifici, quindi per una configurazione come questa:

source: NethSecurity will send queries for google.com and gmail.google.com to 1.2.3.4, but www.google.com will go to 2.3.4.5
it: NethSecurity invierà le richieste per google.com e gmail.google.com a 1.2.3.4, ma www.google.com verrà indirizzato a 2.3.4.5

source: This is true also for wildcards: if both specific and wildcard domains are defined for the same pattern, the specific one takes precedence (e.g., having ``/google.com/`` and ``/*google.com/`` : the first will handle google.com and www.google.com, the wildcard will handle supergoogle.com.
it: Questo vale anche per i caratteri jolly: se sono definiti sia domini specifici che domini con caratteri jolly per lo stesso pattern, quello specifico ha la precedenza (ad esempio, avendo ``/google.com/`` e ``/*google.com/`` : il primo gestirà google.com e www.google.com, mentre il carattere jolly gestirà supergoogle.com).

source: The system can handle local DNS records. When the server performs a DNS lookup, first it will search inside local DNS records. If no local record is found, an external DNS query will be done.
it: Il sistema può gestire record DNS locali. Quando il server esegue una ricerca DNS, prima cercherà all'interno dei record DNS locali. Se non viene trovato alcun record locale, verrà effettuata una query DNS esterna.

source: Local DNS records will always override records from external DNS servers.
it: I record DNS locali avranno sempre la precedenza sui record provenienti dai server DNS esterni.

source: Click the button :guilabel:`Add DNS record` to add a new DNS hostname.
it: Fare clic sul pulsante :guilabel:`Aggiungi record DNS` per aggiungere un nuovo hostname DNS.

source: ``Hostname`` : DNS hostname
it: ``Nome host`` : Nome host DNS

source: ``IP address`` : IP address associated to hostname
it: ``Indirizzo IP`` : Indirizzo IP associato al nome host

source: ``Name`` : optional field
it: ``Nome`` : campo facoltativo

source: ``Wildcard DNS record``: enable it if you want this answer for any subdomain you haven't already defined
it: ``Record DNS wildcard``: abilitarlo se si desidera questa risposta per qualsiasi sottodominio non già definito

source: DNS Rebind Protection
it: Protezione contro il DNS Rebind

source: DNS Rebind Protection is a security feature that safeguards against DNS rebinding attacks. It blocks the use of private IP ranges by public domains, preventing malicious websites from manipulating browsers to make unauthorized requests to local network devices.
it: La protezione contro il DNS Rebind è una funzionalità di sicurezza che protegge dagli attacchi di DNS rebinding. Blocca l'utilizzo di intervalli di indirizzi IP privati da parte di domini pubblici, impedendo ai siti web dannosi di manipolare i browser per effettuare richieste non autorizzate ai dispositivi della rete locale.

source: DNS Rebind Protection is enabled by default on NethSecurity and usually does not have operational repercussions. In the presence of split DNS, resolving public domains with internal resources, rebind protection may lead to resolution issues. In such scenarios, potential problems can be found in the log (``/var/log/messages``), where lines similar to these may appear:
it: La protezione contro il DNS Rebind è abilitata di default su NethSecurity e solitamente non comporta ripercussioni operative. In presenza di split DNS, ovvero quando si risolvono domini pubblici con risorse interne, la protezione contro il rebind può causare problemi di risoluzione. In tali scenari, eventuali problemi possono essere individuati nel log (``/var/log/messages``), dove potrebbero comparire righe simili alle seguenti:

source: To ensure maximum compatibility and prevent malfunctions in migrated installations using the dedicated tool from NethServer 7.9, DNS Rebind Protection is disabled, ensuring the same behavior as the previous version.
it: Per garantire la massima compatibilità e prevenire malfunzionamenti nelle installazioni migrate utilizzando lo strumento dedicato di NethServer 7.9, la Protezione DNS Rebind è disabilitata, assicurando lo stesso comportamento della versione precedente.

source: How to fix DNS rebind protection issues
it: Come risolvere i problemi di protezione DNS rebind

source: You can easily fix any of these issues from the CLI.
it: È possibile risolvere facilmente qualsiasi di questi problemi dalla CLI.

source: **Solution 1**: Whitelist the domain
it: **Soluzione 1**: Inserire il dominio nella whitelist

source: Put the specific domain in a whitelist (suggested): ::
it: Inserire il dominio specifico in una whitelist (consigliato): ::

source: then commit and restart: ::
it: quindi eseguire il commit e riavviare: ::

source: **Solution 2**: disable the DNS protection
it: **Soluzione 2**: disabilitare la protezione DNS

source: Completely disable DNS rebind protection using these commands: ::
it: Disabilitare completamente la protezione contro il DNS rebind utilizzando questi comandi: ::

source: How to enable DNS rebind protection
it: Come abilitare la protezione contro il DNS rebind

source: If you have previously disabled rebind protection or if your configuration comes from a migration and you wish to enable rebind protection, it is recommended to also activate the ``rebind_localhost`` parameter. This setting takes effect exclusively when rebind protection is enabled and permits upstream responses from 127.0.0.0/8, essential for DNS-based blacklist services. Execute these commands: ::
it: Se in precedenza è stata disabilitata la protezione contro il rebind o se la configurazione deriva da una migrazione e si desidera abilitare la protezione contro il rebind, si consiglia di attivare anche il parametro ``rebind_localhost``. Questa impostazione ha effetto esclusivamente quando la protezione contro il rebind è abilitata e consente risposte upstream da 127.0.0.0/8, essenziale per i servizi di blacklist basati su DNS. Eseguire questi comandi: ::

source: Execute these commands: ::
it: Eseguire questi comandi: ::

source: ``Strict binding``: Only hosts with a reservation allowed, others are blocked
it: ``Strict binding``: Solo gli host con una prenotazione sono consentiti, gli altri vengono bloccati

source: Scan network
it: Scansione rete

source: This section describes the local network scanning feature. The page allows scanning all available local networks, excluding WAN networks. The page displays a list of detected local networks, each network includes a Scan network button, selecting this button starts a full scan of the chosen network.
it: Questa sezione descrive la funzionalità di scansione della rete locale. La pagina consente di eseguire la scansione di tutte le reti locali disponibili, escludendo le reti WAN. La pagina visualizza un elenco delle reti locali rilevate; ogni rete include un pulsante :guilabel:`Scan network`, la selezione di questo pulsante avvia una scansione completa della rete scelta.

source: Scan results
it: Risultati della scansione

source: After the operation is completed, the page shows a table with all discovered hosts. For each host the following information is provided:
it: Dopo il completamento dell'operazione, la pagina mostra una tabella con tutti gli host rilevati. Per ciascun host vengono fornite le seguenti informazioni:

source: IP address
it: Indirizzo IP

source: MAC address
it: Indirizzo MAC

source: Hostname (if detected)
it: Nome host (se rilevato)

source: Description
it: Descrizione

source: You can select any host from the table and create a DNS record entry or a DHCP reservation using the respective three dot menu.
it: È possibile selezionare qualsiasi host dalla tabella e creare una voce di record DNS o una prenotazione DHCP utilizzando il relativo menu a tre puntini.

source: The system supports scanning only on networks with a maximum netmask of 255.255.240.0 (CIDR /20), which corresponds to a maximum of 4094 hosts. Scans on larger networks are not supported.
it: Il sistema supporta la scansione solo su reti con una netmask massima di 255.255.240.0 (CIDR /20), che corrisponde a un massimo di 4094 host. Le scansioni su reti più grandi non sono supportate.

source: The DHCP relay allows the firewall to forward DHCP requests from clients to an external DHCP server, DHCP relay is not available from the UI, but it's possible to configure it from the terminal using `uci`.
it: Il relay DHCP consente al firewall di inoltrare le richieste DHCP dai client a un server DHCP esterno. Il relay DHCP non è disponibile dall'interfaccia utente, ma è possibile configurarlo dal terminale utilizzando `uci`.

source: Replace `<INTERFACE_NAME>` with the name of the interface where the DHCP relay should listen.
it: Sostituire `<INTERFACE_NAME>` con il nome dell'interfaccia su cui il relay DHCP deve ascoltare.

source: Replace `<LOCAL_ADDR>` with the IP address of the firewall on that interface.
it: Sostituire `<LOCAL_ADDR>` con l'indirizzo IP del firewall su quella interfaccia.

source: Replace `<SERVER_ADDR>` with the IP address of the upstream DHCP server.
it: Sostituire `<SERVER_ADDR>` con l'indirizzo IP del server DHCP upstream.

source: 1.Create a new DHCP relay entry ::
it: 1. Creare una nuova voce di relay DHCP ::

source: 2.Set the interface: ::
it: 2. Impostare l'interfaccia: ::

source: 3.Set the local address of the firewall: ::
it: 3. Impostare l'indirizzo locale del firewall: ::
