Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/dpi_filter.po
Languages: it

source: Deep Packet Inspection (DPI) filter
it: Filtro Deep Packet Inspection (DPI)

source: NethSecurity uses the `Netify Agent <https://www.netify.ai/resources>`_ to employ Deep Packet Inspection (DPI) techniques for filtering network traffic.
it: NethSecurity utilizza `Netify Agent <https://www.netify.ai/resources>`_ per impiegare tecniche di Deep Packet Inspection (DPI) per il filtraggio del traffico di rete.

source: The Netify Agent functions as a deep-packet inspection server, leveraging nDPI (formerly OpenDPI) to identify network protocols and applications. Detected information can be stored locally, accessed through UNIX or TCP sockets, or sent via HTTP POSTs to a remote third-party server. Details such as flow metadata, network statistics, and detection classifications can be used to take decision on the flow.
it: Il Netify Agent funziona come un server di deep-packet inspection, sfruttando nDPI (precedentemente OpenDPI) per identificare protocolli e applicazioni di rete. Le informazioni rilevate possono essere memorizzate localmente, accessibili tramite socket UNIX o TCP, oppure inviate tramite HTTP POST a un server remoto di terze parti. Dettagli come i metadati dei flussi, le statistiche di rete e le classificazioni di rilevamento possono essere utilizzati per prendere decisioni sul flusso.

source: Here's how it operates:
it: Ecco come funziona:

source: the Netify flow actions plugin assigns labels to matching connections
it: il plugin delle azioni di flusso Netify assegna etichette alle connessioni corrispondenti

source: nft rules can then either block or adjust priority (DSCP) for connections based on these labels
it: Le regole nft possono quindi bloccare o regolare la priorità (DSCP) delle connessioni in base a queste etichette.

source: The administrator can create Deep Packet Inspection (DPI) rules for each interface.
it: L'amministratore può creare regole di Deep Packet Inspection (DPI) per ciascuna interfaccia.

source: Configuration
it: Configurazione

source: To configure these rules, the administrator initiates the process by selecting the particular network interface on which the rule is intended to operate. This step ensures that the rule is precisely applied to the designated segment of the network, allowing for targeted and effective management of network traffic.
it: Per configurare queste regole, l'amministratore avvia il processo selezionando l'interfaccia di rete specifica sulla quale la regola deve operare. Questo passaggio garantisce che la regola venga applicata con precisione al segmento di rete designato, consentendo una gestione mirata ed efficace del traffico di rete.

source: Following the selection of the interface, the administrator is prompted to specify the applications that are to be blocked or regulated. This essential step involves choosing from a comprehensive list of applications accessible through the system interface.
it: Dopo la selezione dell'interfaccia, all'amministratore viene richiesto di specificare le applicazioni che devono essere bloccate o regolate. Questo passaggio essenziale prevede la scelta da un elenco completo di applicazioni accessibile tramite l'interfaccia del sistema.

source: The interface, as a default feature, presents a catalog of commonly used applications. However, it provides an advanced search functionality enabling the administrator to explore and pinpoint specific applications and application categories that require special attention.
it: L'interfaccia, come funzionalità predefinita, presenta un catalogo di applicazioni comunemente utilizzate. Tuttavia, offre una funzionalità di ricerca avanzata che consente all'amministratore di esplorare e individuare applicazioni specifiche e categorie di applicazioni che richiedono particolare attenzione.

source: Premium application signatures
it: Firme delle applicazioni Premium

source: Subscription required
it: Subscription richiesta

source: This feature is available only if the firewall has a valid :ref:`Community or Enterprise subscription <subscription-section>`.
it: Questa funzionalità è disponibile solo se il firewall dispone di una subscription :ref:`Community o Enterprise <subscription-section>` valida.

source: In the absence of a subscription, the system inherently recognizes a baseline of approximately 400 applications. However, with an active subscription, this capacity significantly expands, encompassing more than 2300 applications. In this scenario, the list of recognized applications undergoes daily updates, ensuring that the system stays abreast of the ever-evolving landscape of applications and digital services.
it: In assenza di una subscription, il sistema riconosce intrinsecamente una base di circa 400 applicazioni. Tuttavia, con una subscription attivo, questa capacità si espande significativamente, includendo oltre 2300 applicazioni. In questo scenario, l'elenco delle applicazioni riconosciute viene aggiornato quotidianamente, garantendo che il sistema rimanga al passo con il panorama in continua evoluzione delle applicazioni e dei servizi digitali.

source: Applications and protocols list
it: Elenco di applicazioni e protocolli

source: The full list of all applications and protocols supported by the Enterprise version is available here:
it: L'elenco completo di tutte le applicazioni e i protocolli supportati dalla versione Enterprise è disponibile qui:

source: `Applications <https://www.netify.ai/resources/applications_reference>`_
it: `Applicazioni <https://www.netify.ai/resources/applications_reference>`_

source: `Protocols <https://www.netify.ai/resources/protocols>`_
it: `Protocolli <https://www.netify.ai/resources/protocols>`_

source: Exceptions
it: Eccezioni

source: DPI exclusion allows for the exclusion of specific network addresses, such as the gateway or other critical infrastructure, preventing them from being blocked.
it: L'esclusione DPI consente di escludere indirizzi di rete specifici, come il gateway o altre infrastrutture critiche, impedendo che vengano bloccati.

source: Each exception can be enabled or disabled as desired.
it: Ogni eccezione può essere abilitata o disabilitata secondo necessità.

source: Netify interface exclusion
it: Esclusione dell'interfaccia Netify

source: By default, Netifyd monitors all interfaces. To exclude specific interfaces, you can define an exclusion list. Below are commands to add, modify, or remove excluded interfaces. The exclusion list is configured using the ``ns_exclude`` option that takes a list of patterns. Each entry is a shel glob pattern.
it: Per impostazione predefinita, Netifyd monitora tutte le interfacce. Per escludere interfacce specifiche, è possibile definire una lista di esclusione. Di seguito sono riportati i comandi per aggiungere, modificare o rimuovere le interfacce escluse. La lista di esclusione viene configurata utilizzando l'opzione ``ns_exclude``, che accetta una lista di pattern. Ogni voce è un pattern shell glob.

source: Add interfaces to exclusion list. The system will exclude the `eth1` interface and all OpenVPN and WireGuard interfaces: ::
it: Aggiungere le interfacce all'elenco di esclusione. Il sistema escluderà l'interfaccia ``eth1`` e tutte le interfacce OpenVPN e WireGuard: ::

source: In this case the system will exclude interface ``eth1``, all WireGuard ``wgX`` interfaces and all OpenVPN routed interfaces.
it: In questo caso il sistema escluderà l'interfaccia ``eth1``, tutte le interfacce WireGuard ``wgX`` e tutte le interfacce OpenVPN instradate.

source: Modify exclusion list: ::
it: Modifica elenco di esclusione: ::

source: Clear exclusion list: ::
it: Eliminazione elenco di esclusione: ::

source: Return the exclusion list: ::
it: Restituire l'elenco di esclusione: ::

source: To add a new exception, click the ``Add exception`` button. Enter the ``IP address or CIDR`` that should be exempted from the filter. You can include a description explaining the reason for the exclusion.
it: Per aggiungere una nuova eccezione, fare clic sul pulsante ``Aggiungi eccezione``. Inserire l'``IP address or CIDR`` che deve essere escluso dal filtro. È possibile includere una descrizione che spieghi il motivo dell'esclusione.
