Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/firewall_rules.po
Languages: it

source: Rules
it: Regole

source: Firewall rules define how network traffic is segmented and controlled between different zones. Firewalls acts as barriers between trusted internal networks and untrusted external networks, such as the internet. These rules specify which traffic is allowed, denied, or monitored based on predefined security policies.
it: Le regole del firewall definiscono come il traffico di rete viene segmentato e controllato tra le diverse zone. I firewall agiscono come barriere tra reti interne affidabili e reti esterne non affidabili, come Internet. Queste regole specificano quale traffico è consentito, negato o monitorato in base a politiche di sicurezza predefinite.

source: The order of rules is important; the first matching rule is applied, determining the fate of the network packet.
it: L'ordine delle regole è importante; viene applicata la prima regola corrispondente, determinando il destino del pacchetto di rete.

source: The page is organized into three tabs, each serving a specific purpose:
it: La pagina è organizzata in tre schede, ciascuna con una funzione specifica:

source: ``Forward rules`` tab: this tab is dedicated to configuring rules for data packets moving between different zones in the network.
it: Scheda ``Regole di forward``: questa scheda è dedicata alla configurazione delle regole per i pacchetti di dati che si spostano tra diverse zone nella rete.

source: ``Input rules`` tab: this tab is dedicated to configuring rules for incoming packets destined for the firewall itself.
it: Scheda ``Regole di input``: questa scheda è dedicata alla configurazione delle regole per i pacchetti in ingresso destinati al firewall stesso.

source: ``Output rules`` tab: this tab is dedicated to configuring rules for packets emitted by the firewall.
it: Scheda ``Regole di output``: questa scheda è dedicata alla configurazione delle regole per i pacchetti emessi dal firewall.

source: Locate the button to add a new rule, click on it to initiate the rule creation process. Fill in the following fields for the new rule:
it: Individuare il pulsante per aggiungere una nuova regola e fare clic su di esso per avviare il processo di creazione della regola. Compilare i seguenti campi per la nuova regola:

source: ``Status``: enable or disable the rule based on your requirements. By default the rule is enabled during creation.
it: ``Stato``: abilitare o disabilitare la regola in base alle proprie esigenze. Per impostazione predefinita, la regola è abilitata durante la creazione.

source: ``Rule name``: assign a descriptive name to identify the rule.
it: ``Nome regola``: assegnare un nome descrittivo per identificare la regola.

source: ``Source address``: select the source address from three different options:
it: ``Indirizzo sorgente``: selezionare l'indirizzo sorgente tra tre diverse opzioni:

source: enter one or more IPv4/IPv6 addresses/networks or IP ranges
it: inserire uno o più indirizzi/reti IPv4/IPv6 o intervalli di IP

source: select one firewall object from the available ones
it: selezionare un oggetto firewall tra quelli disponibili

source: any source address
it: qualsiasi indirizzo sorgente

source: This field is not present for ``Output rules``, as the source address is always the firewall itself.
it: Questo campo non è presente per ``Regole di output``, poiché l'indirizzo sorgente è sempre il firewall stesso.

source: ``Source zone``: specify the traffic source zone. Choose a specific zone or select 'Any' to include traffic from any zone.
it: ``Zona sorgente``: specificare la zona di origine del traffico. Scegliere una zona specifica oppure selezionare ``Qualsiasi`` per includere il traffico proveniente da qualsiasi zona.

source: ``Destination address``: select the destination address from three different options:
it: ``Indirizzo di destinazione``: selezionare l'indirizzo di destinazione tra tre diverse opzioni:

source: any destination address
it: qualsiasi indirizzo di destinazione

source: This field is not present for ``Input rules``, as the destination address is always the firewall itself.
it: Questo campo non è presente per ``Regole di input``, poiché l'indirizzo di destinazione è sempre il firewall stesso.

source: ``Destination zone``: specify the traffic destination zone. Choose a specific zone. Bear in mind that the source and destination zones can't be the same.
it: ``Zona di destinazione``: specificare la zona di destinazione del traffico. Scegliere una zona specifica. Tenere presente che le zone di origine e di destinazione non possono essere uguali.

source: ``Destination service``: select from the list or choose 'Custom' to enter specific ports and select protocols.
it: ``Servizio di destinazione``: selezionare dall'elenco oppure scegliere ``Personalizzato`` per inserire porte specifiche e selezionare i protocolli.

source: ``Action``: define the action when the rule conditions are met:
it: ``Azione``: definire l'azione quando le condizioni della regola sono soddisfatte:

source: ``Accept``: accept the network traffic.
it: ``Accept``: accetta il traffico di rete.

source: ``Reject``: block the traffic and notify the sender host.
it: ``Rifiuta``: blocca il traffico e notifica l'host mittente.

source: ``Drop``: block the traffic, packets are dropped and no notification is sent to the sender host.
it: ``Drop``: blocca il traffico, i pacchetti vengono scartati e nessuna notifica viene inviata all'host mittente.

source: ``Rule position``: decide whether to add the rule to the bottom or top of the rule list.
it: ``Posizione della regola``: consente di decidere se aggiungere la regola in fondo o all'inizio dell'elenco delle regole.

source: ``Logging``: indicate whether traffic matching this rule should be logged. The log entry will include the rule name as a prefix. By default, logging is limited to 1 entry per second. See the :ref:`logging-limits` section for instructions on changing this limit.
it: ``Log``: indica se il traffico che corrisponde a questa regola deve essere registrato nei log. La voce di log includerà il nome della regola come prefisso. Per impostazione predefinita, la registrazione nei log è limitata a 1 voce al secondo. Consultare la sezione :ref:`logging-limits` per le istruzioni su come modificare questo limite.

source: ``Tags``: optionally, add tags for organizational purposes. Note that the 'automated' tag is reserved for system use.
it: ``Tag``: facoltativamente, aggiungere tag per scopi organizzativi. Si noti che il tag 'automated' è riservato all'uso di sistema.

source: Logging limits
it: Limiti di logging

source: Logging can be enabled on the following objects:
it: La registrazione può essere abilitata sui seguenti oggetti:

source: zones
it: zone

source: firewall rules
it: regole del firewall

source: redirect rules (port-forwarding)
it: regole di reindirizzamento (port-forwarding)

source: When the logging is enabled, the firewall will add logging limits to various rules. This ensures that logging does not overwhelm the system by setting a limit on the logging rate.
it: Quando la registrazione è abilitata, il firewall aggiungerà dei limiti di registrazione a varie regole. Questo garantisce che la registrazione non sovraccarichi il sistema impostando un limite al tasso di registrazione.

source: By default, the following logging limits are applied:
it: Per impostazione predefinita, vengono applicati i seguenti limiti di registrazione:

source: 1 log entry per second for firewall rules
it: 1 voce di log al secondo per le regole del firewall

source: 5 log entries per second for zones
it: 5 voci di log al secondo per zone

source: 1 log entry per second for redirect rules
it: 1 voce di log al secondo per le regole di reindirizzamento

source: Changing the default logging limits
it: Modifica dei limiti predefiniti di logging

source: Changing the default logging limits can impact system performance. Use caution when changing these limits.
it: La modifica dei limiti predefiniti di logging può influire sulle prestazioni del sistema. Prestare attenzione quando si modificano questi limiti.

source: Default limits are saved in the `ns_defaults` section of the firewall configuration:
it: I limiti predefiniti sono salvati nella sezione `ns_defaults` della configurazione del firewall:

source: ``zone_log_limit``: the default limit for zones
it: ``zone_log_limit``: il limite predefinito per le zone

source: ``rule_log_limit``: the default limit for firewall rules
it: ``rule_log_limit``: il limite predefinito per le regole del firewall

source: ``redirect_log_limit``: the default limit for redirect rules
it: ``redirect_log_limit``: il limite predefinito per le regole di reindirizzamento

source: Set the desired log limit for the firewall rules using the `uci` command: ::
it: Impostare il limite di log desiderato per le regole del firewall utilizzando il comando `uci`: ::

source: Run the `firewall-apply-default-logging` script to apply the new log limit: ::
it: Eseguire lo script `firewall-apply-default-logging` per applicare il nuovo limite di log: ::
