Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/flashstart.po
Languages: it

source: FlashStart DNS filter
it: Filtro DNS FlashStart

source: DNS filtering integrates with third-party DNS-based content filtering software, default supported content filter is the one provided from `FlashStart <https://www.flashstart.com>`_.
it: Il filtro DNS si integra con software di filtraggio dei contenuti basato su DNS di terze parti; il filtro dei contenuti supportato di default è quello fornito da `FlashStart <https://www.flashstart.com>`_.

source: It basically links 2 components : filter configuration and network configuration.
it: Collega fondamentalmente 2 componenti: la configurazione dei filtri e la configurazione di rete.

source: Content filter configuration takes place entirely on the third-party platform, typically it is possible to block individual websites, as well as categories of sites (e.g. adult), manage exceptions, view reports and so on.
it: La configurazione del filtro dei contenuti avviene interamente sulla piattaforma di terze parti; tipicamente è possibile bloccare singoli siti web, nonché categorie di siti (ad esempio, per adulti), gestire eccezioni, visualizzare report e così via.

source: Network configuration is completely automated and is done on NethSecurity which takes care of:
it: La configurazione della rete è completamente automatizzata ed è gestita da NethSecurity, che si occupa di:

source: connect the firewall to the specific third party instance
it: collegare il firewall all'istanza specifica di terze parti

source: redirect all DNS requests to the external service
it: reindirizzare tutte le richieste DNS al servizio esterno

source: automatically update IP addresses of all connectivities
it: aggiornare automaticamente gli indirizzi IP di tutte le connettività

source: Before configuring NethSecurity you need to create an account on FlashStart and configure the service. FlashStart is a payed service that allows you to use trial licenses. Please refer to the supplier's documentation `doc <https://cloud.flashstart.com/customerarea/support/docs>`_.
it: Prima di configurare NethSecurity è necessario creare un account su FlashStart e configurare il servizio. FlashStart è un servizio a pagamento che consente di utilizzare licenze di prova. Fare riferimento alla documentazione del fornitore `doc <https://cloud.flashstart.com/customerarea/support/docs>`_.

source: Once the account has been created and the service configured, NethSecurity can be configured.
it: Una volta che l'account è stato creato e il servizio configurato, è possibile configurare NethSecurity.

source: Configuration
it: Configurazione

source: Subscription required
it: Richiesta subscription

source: This feature is available only if the firewall has a valid subscription.
it: Questa funzionalità è disponibile solo se il firewall dispone di una subscription valida.

source: FlashStart provides cloud-based content filtering solutions integrated with NethSecurity. The two main service types, FlashStart Pro and FlashStart Pro Plus, offer different capabilities in terms of filtering granularity and profile management. Below is a brief comparison highlighting the key differences.
it: FlashStart fornisce soluzioni di filtraggio dei contenuti basate su cloud integrate con NethSecurity. I due principali tipi di servizio, FlashStart Pro e FlashStart Pro Plus, offrono capacità differenti in termini di granularità del filtraggio e gestione dei profili. Di seguito è riportato un breve confronto che evidenzia le principali differenze.

source: FlashStart Pro enables content filtering using a single filter profile, applied across the network or to selected network zones.
it: FlashStart Pro consente il filtraggio dei contenuti utilizzando un unico profilo di filtro, applicato all'intera rete o a zone di rete selezionate.

source: **Single profile filtering:** All filtered IPs follow the same rules and category blocks defined on the FlashStart platform.
it: **Filtraggio con profilo singolo:** Tutti gli IP filtrati seguono le stesse regole e i blocchi di categoria definiti sulla piattaforma FlashStart.

source: **Zone-based application:** Administrators can choose which network zones are subject to filtering.
it: **Applicazione basata su zone:** Gli amministratori possono scegliere quali zone di rete sono soggette al filtraggio.

source: **IP-based profile management:** FlashStart Pro on NethSecurity implicitly supports three traffic profiles, based on IP:
it: **Gestione dei profili basata su IP:** FlashStart Pro su NethSecurity supporta implicitamente tre profili di traffico, basati su IP:

source: Filtered IPs : Subject to the single filter profile defined in FlashStart.
it: IP filtrati : Soggetti al singolo profilo di filtro definito in FlashStart.

source: Unfiltered IPs : No filtering applied (see Exclusions below)
it: IP non filtrati : Nessun filtro applicato (vedere Esclusioni di seguito)

source: Blocked IPs : Access denied at the firewall level using firewall rules.
it: IP bloccati : Accesso negato a livello di firewall utilizzando regole del firewall.

source: **Exclusions:** Exceptions can be configured using IP addresses or CIDR blocks.
it: **Esclusioni:** È possibile configurare delle eccezioni utilizzando indirizzi IP o blocchi CIDR.

source: FlashStart Pro Plus extends functionality with support for multiple independent filtering profiles, allowing greater flexibility and user-level policy enforcement.
it: FlashStart Pro Plus estende la funzionalità con il supporto per più profili di filtraggio indipendenti, consentendo una maggiore flessibilità e l'applicazione delle policy a livello utente.

source: **Multi-profile support:** Up to 5 independent profiles can be defined, each with its own filtering configuration.
it: **Supporto multi-profilo:** Possono essere definiti fino a 5 profili indipendenti, ciascuno con la propria configurazione di filtraggio.

source: **Independent profile configuration:** Each profile can be customized individually (categories, safe search, YouTube restrictions, etc.).
it: **Configurazione indipendente del profilo:** Ogni profilo può essere personalizzato individualmente (categorie, Safe Search, restrizioni YouTube, ecc.).

source: **Filtering criteria options:** Profiles can be assigned using:
it: **Opzioni dei criteri di filtraggio:** I profili possono essere assegnati utilizzando:

source: **Firewall objects (host sets):** From the FlashStart configuration panel, administrators can associate specific host sets (defined in the firewall) with a profile.
it: **Oggetti firewall (host set):** Dal pannello di configurazione di FlashStart, gli amministratori possono associare insiemi specifici di host (definiti nel firewall) a un profilo.

source: **Active Directory users:** If the FlashStart AD connector is installed, profiles can be assigned to AD users directly, eliminating the need to rely on IP addresses.
it: **Utenti Active Directory:** Se il connettore FlashStart AD è installato, i profili possono essere assegnati direttamente agli utenti AD, eliminando la necessità di fare affidamento sugli indirizzi IP.

source: **Combined assignment (objects + users):** It is possible to use both methods in parallel.In case of conflicts, firewall object assignments take precedence over user-based assignments.
it: **Assegnazione combinata (oggetti + utenti):** È possibile utilizzare entrambi i metodi in parallelo. In caso di conflitti, le assegnazioni degli oggetti firewall hanno la precedenza su quelle basate sugli utenti.

source: Although no known bugs have been reported at this time, the Pro Plus feature is currently released as a **Beta**. We recommend testing it in a non-critical environment before deploying it in production.
it: Sebbene al momento non siano stati segnalati bug noti, la funzionalità Pro Plus è attualmente rilasciata come **Beta**. Si consiglia di testarla in un ambiente non critico prima di implementarla in produzione.

source: Common Features (Pro and Pro Plus)
it: Funzionalità comuni (Pro e Pro Plus)

source: **Same filtering capabilities:**
it: **Stesse capacità di filtraggio:**

source: URL category-based filtering (blacklists)
it: Filtraggio basato su categorie di URL (liste nere)

source: Search engine filtering (Safe Search)
it: Filtraggio dei motori di ricerca (Safe Search)

source: YouTube restricted mode
it: Modalità con restrizioni di YouTube

source: Threat protection
it: Protezione dalle minacce

source: **Cloud-managed configuration:** All filtering rules and profiles are managed through the FlashStart web interface.
it: **Configurazione gestita dal cloud:** Tutte le regole di filtraggio e i profili sono gestiti tramite l'interfaccia web di FlashStart.

source: Feature
it: Funzionalità

source: Zone-based filtering
it: Filtraggio basato su zone

source: Yes
it: Sì

source: Profile exclusions (IP/CIDR)
it: Esclusioni del profilo (IP/CIDR)

source: Number of filter profiles
it: Numero di profili filtro

source: Up to 5
it: Fino a 5

source: Filtering per AD user
it: Filtraggio per utente AD

source: Firewall object integration
it: Integrazione degli oggetti firewall

source: Conflict handling (user vs object)
it: Gestione dei conflitti (utente vs oggetto)

source: Firewall object takes priority
it: L'oggetto Firewall ha la priorità

source: Recommendations Before Configuring FlashStart DNS Filter
it: Raccomandazioni prima di configurare FlashStart DNS Filter

source: Before enabling the FlashStart DNS filter, please consider the following important recommendations:
it: Prima di abilitare il filtro DNS di FlashStart, si prega di considerare le seguenti raccomandazioni importanti:

source: **DNS Redirection Behavior** When content filtering is enabled, all DNS traffic from the clients will be automatically redirected to the external FlashStart filtering service, regardless of their configuration. **Do not make changes to the DNS servers configured in NethSecurity or in network clients.**
it: **Comportamento di reindirizzamento DNS** Quando il filtraggio dei contenuti è abilitato, tutto il traffico DNS proveniente dai client verrà automaticamente reindirizzato al servizio di filtraggio esterno FlashStart, indipendentemente dalla loro configurazione. **Non apportare modifiche ai server DNS configurati in NethSecurity o nei client di rete.**

source: **Block Alternative DNS Protocols** To preserve the effectiveness of the content filter, it is highly recommended to block alternative DNS protocols (such as DoT and DoH) using the :ref:`dpi_filter-section`.
it: **Bloccare i protocolli DNS alternativi** Per preservare l'efficacia del filtro dei contenuti, si raccomanda vivamente di bloccare i protocolli DNS alternativi (come DoT e DoH) utilizzando il :ref:`dpi_filter-section`.

source: **Avoid Conflicts with Threat Shield DNS** Use FlashStart only if you are **not already using the Threat Shield DNS service**, as using both simultaneously may lead to conflicts.
it: **Evitare conflitti con Threat Shield DNS** Utilizzare FlashStart solo se **non si sta già utilizzando il servizio Threat Shield DNS**, poiché l'uso simultaneo di entrambi potrebbe causare conflitti.

source: ``Status`` : You can enable or disable the DNS filter by using the ``Status`` toggle switch
it: ``Stato`` : È possibile abilitare o disabilitare il filtro DNS utilizzando l'interruttore ``Stato``.

source: ``Service type`` : Select the type of service you have purchased: **Pro** or **Pro Plus**
it: ``Tipo di servizio`` : Selezionare il tipo di servizio acquistato: **Pro** oppure **Pro Plus**

source: ``Username`` : Enter the same username used for your FlashStart account
it: ``Nome utente`` : Inserire lo stesso nome utente utilizzato per il proprio account FlashStart

source: ``Password`` : Enter the same password used for your FlashStart account
it: ``Password`` : Inserire la stessa password utilizzata per l'account FlashStart

source: ``Zones to Filter`` : Select the network zones you want to protect with DNS filtering. Only the selected zones will be affected by the FlashStart DNS filter.
it: ``Zone da filtrare`` : Selezionare le zone di rete che si desidera proteggere con il filtro DNS. Solo le zone selezionate saranno interessate dal filtro DNS di FlashStart.

source: ``Bypass Source IPs or Networks`` : You can specify a list of IP addresses or networks (CIDR format) that should bypass DNS filtering. Traffic from these sources will not be subject to any filtering rules.
it: ``Bypass Source IPs or Networks`` : È possibile specificare un elenco di indirizzi IP o reti (formato CIDR) che devono bypassare il filtro DNS. Il traffico proveniente da queste sorgenti non sarà soggetto ad alcuna regola di filtraggio.

source: ``Custom DNS Servers`` : If you need to define **custom DNS resolvers for specific domains**, you can configure them here. The syntax is the same used in the DNS section of NethSecurity.For reference, see the official documentation:`Domain-specific DNS servers <https://docs.nethsecurity.org/en/latest/dns_dhcp.html#domain-specific-dns-servers>`_
it: ``Server DNS personalizzati`` : Se è necessario definire **resolver DNS personalizzati per domini specifici**, è possibile configurarli qui. La sintassi è la stessa utilizzata nella sezione DNS di NethSecurity. Per riferimento, consultare la documentazione ufficiale: `Server DNS specifici per dominio <https://docs.nethsecurity.org/en/latest/dns_dhcp.html#domain-specific-dns-servers>`_

source: Once the FlashStart service has been configured on the firewall, all further configuration and management must be performed exclusively via the FlashStart web portal. No additional changes are required on the firewall itself.
it: Una volta che il servizio FlashStart è stato configurato sul firewall, tutta la configurazione e la gestione successive devono essere effettuate esclusivamente tramite il portale web di FlashStart. Non sono necessarie ulteriori modifiche sul firewall stesso.

source: Troubleshooting
it: Risoluzione dei problemi

source: 1. My public IP is not listed in the FlashStart networks
it: 1. Il mio IP pubblico non è elencato nelle reti FlashStart

source: If your public IP address does not appear in the FlashStart dashboard under registered networks, please allow up to 15 minutes. This delay may be caused by protection mechanisms on the FlashStart platform designed to mitigate repeated or automated registration attempts.
it: Se l'indirizzo IP pubblico non compare nella dashboard di FlashStart sotto le reti registrate, attendere fino a 15 minuti. Questo ritardo può essere causato da meccanismi di protezione sulla piattaforma FlashStart progettati per mitigare tentativi di registrazione ripetuti o automatizzati.

source: 2. DNS filtering does not seem to be working
it: 2. Il filtro DNS sembra non funzionare

source: If the filtering is not effective immediately after configuration:
it: Se il filtraggio non è efficace immediatamente dopo la configurazione:

source: Be aware that FlashStart may require a few minutes to propagate the applied settings across its infrastructure.
it: Si tenga presente che FlashStart potrebbe richiedere alcuni minuti per propagare le impostazioni applicate attraverso la propria infrastruttura.

source: Also consider the impact of browser DNS cache, which may delay visible effects.
it: Considerare anche l'impatto della cache DNS del browser, che potrebbe ritardare gli effetti visibili.

source: To verify whether filtering is actually in place and working, you can perform a manual DNS query **in your local client** using the `dig` command:
it: Per verificare se il filtraggio è effettivamente attivo e funzionante, è possibile eseguire una query DNS manuale **sul client locale** utilizzando il comando `dig`:

source: Replace `www.mydomain.com` with the actual domain you're testing.
it: Sostituire ``www.mydomain.com`` con il dominio effettivo che si sta testando.

source: If the domain is still being resolved and should be blocked, double-check the active profile and block settings on the FlashStart dashboard.
it: Se il dominio viene ancora risolto e dovrebbe essere bloccato, verificare nuovamente il profilo attivo e le impostazioni di blocco sulla dashboard di FlashStart.

source: This ``dig`` test must always be performed from the **client** and **never from the firewall**. The firewall is **never** filtered by FlashStart's DNS servers, as this could potentially conflict with some of the services it provides.
it: Questo test ``dig`` deve essere sempre eseguito dal **client** e **mai dal firewall**. Il firewall **non** viene **mai** filtrato dai server DNS di FlashStart, poiché ciò potrebbe potenzialmente entrare in conflitto con alcuni dei servizi che fornisce.

source: 3. Testing DNS Filtering with dig directly from the firewall
it: 3. Verifica del filtraggio DNS con dig direttamente dal firewall

source: If you want to perform tests using ``dig`` directly from the firewall, you can do so by specifying the port. Each port corresponds to a different filtering profile.
it: Se si desidera eseguire dei test utilizzando ``dig`` direttamente dal firewall, è possibile farlo specificando la porta. Ogni porta corrisponde a un diverso profilo di filtraggio.

source: If you are using **FlashStart Pro**, the port is always **5300**. You can check if the request is correctly filtered with the following command:
it: Se si utilizza **FlashStart Pro**, la porta è sempre **5300**. È possibile verificare se la richiesta viene filtrata correttamente con il seguente comando:

source: If you are using **FlashStart Pro Plus**, each profile is associated with a different port. You can send a request per profile to verify that the filtering behaves as expected.
it: Se si utilizza **FlashStart Pro Plus**, ogni profilo è associato a una porta diversa. È possibile inviare una richiesta per ciascun profilo per verificare che il filtraggio si comporti come previsto.

source: First, you need to identify the correct port for each profile. Use the following command to view the configuration:
it: Per prima cosa, è necessario identificare la porta corretta per ciascun profilo. Utilizzare il seguente comando per visualizzare la configurazione:

source: You will see multiple entries like this:
it: Si vedranno più voci come questa:

source: In this example, the profile **"Guests"** is associated with port **5301**, so you would run:
it: In questo esempio, il profilo **"Guests"** è associato alla porta **5301**, quindi si dovrebbe eseguire:

source: If you are using the DHCP service on NethSecurity, please note that FlashStart integration requires explicitly specifying the DNS server through DHCP options.Go to the DHCP section, under Advanced Settings, and add the following option: 6:dns-server,<YOUR-USUAL-DNS-SERVER>. This ensures that clients receive the correct DNS server via DHCP. In this field, enter the DNS server typically used in your network, usually the IP address of the NethSecurity interface. Do not manually specify the IP addresses of the FlashStart DNS servers, as they are automatically managed by the integration.
it: Se si utilizza il servizio DHCP su NethSecurity, si tenga presente che l'integrazione con FlashStart richiede di specificare esplicitamente il server DNS tramite le opzioni DHCP. Accedere alla sezione DHCP, sotto :guilabel:`Impostazioni avanzate`, e aggiungere la seguente opzione: 6:dns-server,<YOUR-USUAL-DNS-SERVER>. Questo garantisce che i client ricevano il server DNS corretto tramite DHCP. In questo campo, inserire il server DNS normalmente utilizzato nella rete, solitamente l'indirizzo IP dell'interfaccia NethSecurity. Non specificare manualmente gli indirizzi IP dei server DNS di FlashStart, poiché vengono gestiti automaticamente dall'integrazione.

source: DNS Server Configuration
it: Configurazione del server DNS

source: The DNS servers used by FlashStart are automatically configured by NethSecurity when the service is enabled. It's possible to customize a few options:
it: I server DNS utilizzati da FlashStart vengono configurati automaticamente da NethSecurity quando il servizio viene abilitato. È possibile personalizzare alcune opzioni:

source: **Query logging**: You can enable query logging by running the following command:
it: **Registrazione delle query**: È possibile abilitare la registrazione delle query eseguendo il seguente comando:

source: This will log DNS queries to the firewall's system log, which can be useful for tracking and troubleshooting purposes.
it: Questo registrerà le query DNS nel registro di sistema del firewall, il che può essere utile per scopi di monitoraggio e risoluzione dei problemi.

source: FlashStart platform configuration
it: Configurazione della piattaforma FlashStart

source: Before configuring FlashStart on your firewall, you must first purchase and configure the **Pro** or **Pro Plus** service on the FlashStart platform. Once the service has been purchased, you’ll need to configure the networks on the FlashStart portal.
it: Prima di configurare FlashStart sul firewall, è necessario prima acquistare e configurare il servizio **Pro** o **Pro Plus** sulla piattaforma FlashStart. Una volta acquistato il servizio, sarà necessario configurare le reti sul portale FlashStart.

source: During the configuration process, the system will guide you through the setup, follow the prompts and select the following options:
it: Durante il processo di configurazione, il sistema guiderà l'utente attraverso la procedura di impostazione; seguire le istruzioni e selezionare le seguenti opzioni:

source: Connect the router of your network → I have a dynamic IP → Nethesis Dynamic DNS → NethSecurity → Choose PRO or PRO PLUS.
it: Collega il router della tua rete → Ho un IP dinamico → Sincronizza con DNS dinamico Nethesis → NethSecurity → Scegliere PRO o PRO PLUS.

source: Starting from July 2nd, 2025, the FlashStart platform requires you to create a new username and password during this setup step. Please note that it is no longer possible to use the email-based login previously associated with your account. Once the new credentials are created, they must be used for authentication on the firewall side.
it: A partire dal 2 luglio 2025, la piattaforma FlashStart richiede la creazione di un nuovo nome utente e una nuova password durante questa fase di configurazione. Si noti che non è più possibile utilizzare l’accesso tramite email precedentemente associato all’account. Una volta create le nuove credenziali, queste dovranno essere utilizzate per l’autenticazione lato firewall.

source: Networks previously configured using the email-based login will continue to function normally as long as they are not removed. If a network is removed, the system will require a new username and password pair, and the corresponding credentials must also be updated on the NethSecurity side.
it: Le reti precedentemente configurate utilizzando l’accesso basato su email continueranno a funzionare normalmente finché non vengono rimosse. Se una rete viene rimossa, il sistema richiederà una nuova coppia di nome utente e password, e le relative credenziali dovranno essere aggiornate anche sul lato NethSecurity.

source: NethSecurity configuration
it: Configurazione di NethSecurity

source: **DNS Rebind protection**
it: **Protezione contro il DNS Rebind**
