Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/flashstart.po
Languages: it

source: DNS Rebind protection is disabled by default for FlashStart clients in order to prevent unwanted blocks when internal DNS servers resolve private or internal domains that could otherwise be flagged by the firewall’s DNS Rebind protection mechanism. If required, this protection can be manually enabled using the following configuration:
it: La protezione contro il DNS Rebind è disabilitata per impostazione predefinita per i client FlashStart, al fine di evitare blocchi indesiderati quando i server DNS interni risolvono domini privati o interni che altrimenti potrebbero essere segnalati dal meccanismo di protezione DNS Rebind del firewall. Se necessario, questa protezione può essere abilitata manualmente utilizzando la seguente configurazione:

source: Presence of an Active Directory (AD) Controller
it: Presenza di un controller Active Directory (AD)

source: If an AD controller is present, user-based profiling can be enabled. To do this, it is necessary to first install the specific FlashStart connector (please refer to the official FlashStart `documentation <https://cloud.flashstart.com/customerarea/support/docs>`_ for installation instructions), **this is currently available only for Microsoft Windows Server**.
it: Se è presente un controller AD, è possibile abilitare il profiling basato sull'utente. Per fare ciò, è necessario prima installare il connettore specifico di FlashStart (fare riferimento alla `documentazione <https://cloud.flashstart.com/customerarea/support/docs>`_ ufficiale di FlashStart per le istruzioni di installazione), **attualmente disponibile solo per Microsoft Windows Server**.

source: DNS Management in the Network
it: Gestione DNS nella rete

source: All clients on the network must route their DNS requests through NethSecurity instead of directly querying the AD controller, this prevents the clients from inheriting the AD controller’s profiling policy.
it: Tutti i client sulla rete devono instradare le loro richieste DNS attraverso NethSecurity invece di interrogare direttamente il controller AD; questo impedisce ai client di ereditare la policy di profilazione del controller AD.

source: Configuration Details
it: Dettagli di configurazione

source: The AD controller uses an external DNS resolver.
it: Il controller AD utilizza un resolver DNS esterno.

source: In the FlashStart DNS UI on NethSecurity, add the local domain of the AD controller for resolution, specifying the IP address of the AD controller for resolving these local names (e.g., `/ad.mydomain.local/192.168.55.1`).
it: Nell'interfaccia utente di FlashStart DNS su NethSecurity, aggiungere il dominio locale del controller AD per la risoluzione, specificando l'indirizzo IP del controller AD per la risoluzione di questi nomi locali (ad esempio, ``/ad.mydomain.local/192.168.55.1``).

source: Configure clients to use either an external DNS server or the firewall itself as their DNS resolver.
it: Configurare i client affinché utilizzino un server DNS esterno oppure il firewall stesso come loro resolver DNS.

source: Important Notes
it: Note importanti

source: It is necessary to prevent clients from querying the AD controller for non-local domain resolution, this can be achieved by:
it: È necessario impedire ai client di interrogare il controller AD per la risoluzione di domini non locali; questo può essere ottenuto tramite:

source: Blocking inbound UDP/TCP port 53 on the AD controller
it: Blocco della porta 53 UDP/TCP in ingresso sul controller AD

source: disabling DNS recursion for clients on the AD server, so that the server only responds to queries for its local zone.
it: disabilitare la ricorsione DNS per i client sul server AD, in modo che il server risponda solo alle query per la propria zona locale.

source: IP Blocking
it: Blocco IP

source: App blocker
it: Blocco app

source: Remote Agent for Win/Mac/Android/iOS
it: Agente remoto per Win/Mac/Android/iOS
