Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/ha_migration_7.9.po
Languages: it

source: Migration from NethSecurity 7.9 with HA
it: Migrazione da NethSecurity 7.9 con HA

source: This document describes the procedure for migrating a **NethSecurity 7.9** system configured with **High Availability (HA)** to **NethSecurity 8**, while keeping the HA setup active. Several approaches are possible for this migration; this guide outlines one recommended method.
it: Questo documento descrive la procedura per migrare un sistema **NethSecurity 7.9** configurato con **High Availability (HA)** a **NethSecurity 8**, mantenendo attiva la configurazione HA. Sono possibili diversi approcci per questa migrazione; questa guida illustra un metodo raccomandato.

source: The migration process consists of two main phases:
it: Il processo di migrazione consiste in due fasi principali:

source: upgrading the NethSecurity 7.9 system to version 8,
it: aggiornamento del sistema NethSecurity 7.9 alla versione 8,

source: reconfiguring the High Availability service between the two firewalls running NethSecurity 8.
it: riconfigurazione del servizio High Availability tra i due firewall che eseguono NethSecurity 8.

source: During the migration, the two firewalls are treated as independent systems. One device will be upgraded to NethSecurity 8 by migrating its configuration, while the other will be reset to factory defaults and reconfigured as the secondary HA node.
it: Durante la migrazione, i due firewall vengono trattati come sistemi indipendenti. Un dispositivo verrà aggiornato a NethSecurity 8 tramite la migrazione della sua configurazione, mentre l'altro verrà ripristinato alle impostazioni di fabbrica e riconfigurato come nodo secondario HA.

source: Once the migration and validation of the primary node are complete, the High Availability service will be enabled again between the two NethSecurity 8 firewalls.
it: Una volta completata la migrazione e la validazione del nodo primario, il servizio di High Availability verrà nuovamente abilitato tra i due firewall NethSecurity 8.

source: Prerequisites
it: Prerequisiti

source: Take a note of the IP addresses used for the HA interface: primary, secondary, and VIP.
it: Prendere nota degli indirizzi IP utilizzati per l'interfaccia HA: primario, secondario e VIP.

source: Review the network configuration, especially for **local (non-WAN) interfaces**. Each of these interfaces now requires **three IP addresses**: previously only one was used, but in NethSecurity 8 additional LAN interfaces are also managed through **VIPs**, ensuring failover in case of issues affecting those interfaces.
it: Esaminare la configurazione di rete, in particolare per le **interfacce locali (non-WAN)**. Ognuna di queste interfacce ora richiede **tre indirizzi IP**: in precedenza ne veniva utilizzato solo uno, ma in NethSecurity 8 anche le interfacce LAN aggiuntive sono gestite tramite **VIP**, garantendo il failover in caso di problemi che interessano tali interfacce.

source: Take a note of all required IP addresses for the additional non-WAN interfaces.
it: Prendere nota di tutti gli indirizzi IP necessari per le interfacce aggiuntive non-WAN.

source: Perform a backup of both firewalls as a precaution.
it: Eseguire un backup di entrambi i firewall come precauzione.

source: Verify **hardware compatibility** with NethSecurity 8.
it: Verificare la **compatibilità hardware** con NethSecurity 8.

source: Migration procedure
it: Procedura di migrazione

source: 1. **Power off the secondary firewall** Before starting the migration, shut down the secondary firewall to prevent conflicts during the upgrade of the primary node.
it: 1. **Spegnere il firewall secondario** Prima di iniziare la migrazione, spegnere il firewall secondario per evitare conflitti durante l'aggiornamento del nodo primario.

source: 2. **Choose the migration method** Access the *Firewall Migration* tool on your NethSecurity 7.9. You can either:
it: 2. **Scegliere il metodo di migrazione** Accedere allo strumento *Firewall Migration* su NethSecurity 7.9. È possibile:

source: Download a migrated image to create a USB key for testing and verifying configurations before performing the actual migration, or
it: Scaricare un'immagine migrata per creare una chiavetta USB da utilizzare per testare e verificare le configurazioni prima di eseguire la migrazione effettiva, oppure

source: run an **in-place migration** directly on the system.
it: eseguire una **migrazione in-place** direttamente sul sistema.

source: Choose the option that best fits your needs: the first one is safer, while the second is faster. If any issue occurs, simply power on the secondary firewall running version 7.9, which still retains the original configuration.
it: Scegliere l'opzione che meglio si adatta alle proprie esigenze: la prima è più sicura, mentre la seconda è più veloce. In caso di problemi, è sufficiente accendere il firewall secondario con la versione 7.9, che mantiene ancora la configurazione originale.

source: **Run the migration**
it: **Eseguire la migrazione**

source: If using in-place migration, once the process completes, verify that the firewall is now running NethSecurity 8 and that all features work as expected.
it: Se si utilizza la migrazione in-place, una volta completato il processo, verificare che il firewall stia ora eseguendo NethSecurity 8 e che tutte le funzionalità funzionino come previsto.

source: If you are using the USB image, create it and boot the primary firewall from it. Verify that all features are working correctly. After that, write the appliance storage using the `ns-install` command, then reboot the hardware without the USB key.
it: Se si utilizza l'immagine USB, crearla e avviare il firewall primario da essa. Verificare che tutte le funzionalità siano operative. Successivamente, scrivere lo storage dell'appliance utilizzando il comando `ns-install`, quindi riavviare l'hardware senza la chiave USB.

source: **Configure the VIP address**
it: **Configurare l'indirizzo VIP**

source: Add the VIP (HA alias IP) to allow LAN hosts to access the network correctly. This ensures that all LAN clients can reach the Internet while you proceed with the restore process, without interrupting user connectivity.
it: Aggiungere il VIP (IP alias HA) per consentire agli host LAN di accedere correttamente alla rete. Questo garantisce che tutti i client LAN possano raggiungere Internet durante il processo di ripristino, senza interrompere la connettività degli utenti.

source: Remember to do the same for every other non-WAN interface.
it: Ricordarsi di fare lo stesso per tutte le altre interfacce non-WAN.

source: 5. **Restore and reconfigure the secondary node** After confirming that the primary firewall is working as expected:
it: 5. **Ripristinare e riconfigurare il nodo secondario** Dopo aver confermato che il firewall primario funziona come previsto:

source: Disconnect all network cables from the secondary firewall to avoid conflicts with the primary.
it: Scollegare tutti i cavi di rete dal firewall secondario per evitare conflitti con quello primario.

source: Reset the secondary firewall to factory defaults.
it: Ripristinare il firewall secondario alle impostazioni di fabbrica.

source: Recreate the network configuration, ensuring that additional LAN interfaces are also managed using VIPs.
it: Ricreare la configurazione di rete, assicurandosi che anche le interfacce LAN aggiuntive siano gestite utilizzando i VIP.

source: Reconfigure High Availability between the two NethSecurity 8 systems.
it: Riconfigurare l'Alta Affidabilità tra i due sistemi NethSecurity 8.
