Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/ha_overview_features_limitations.po
Languages: it

source: Overview, Features, Limitations
it: Panoramica, Funzionalità, Limitazioni

source: NethSecurity High Availability (HA) ensures continuous network operation by providing redundancy through a cluster of two firewalls. If the primary firewall fails due to hardware issues, software problems, or maintenance, a backup firewall automatically takes over all network services and traffic handling, minimizing downtime.
it: L'Alta Disponibilità (HA) di NethSecurity garantisce la continuità operativa della rete fornendo ridondanza tramite un cluster di due firewall. Se il firewall primario si guasta a causa di problemi hardware, problemi software o manutenzione, un firewall di backup assume automaticamente la gestione di tutti i servizi di rete e del traffico, riducendo al minimo i tempi di inattività.

source: This is crucial for businesses or organizations where uninterrupted internet access, VPN connectivity, and security services are essential for daily operations, preventing loss of productivity or revenue during an outage.
it: Questo è fondamentale per aziende o organizzazioni in cui l’accesso a Internet senza interruzioni, la connettività VPN e i servizi di sicurezza sono essenziali per le operazioni quotidiane, prevenendo la perdita di produttività o di ricavi durante un’interruzione.

source: Key concepts
it: Concetti chiave

source: Some key concepts to understand before setting up HA:
it: Alcuni concetti chiave da comprendere prima di configurare HA:

source: **Primary Node**: The firewall that actively handles traffic and services.
it: **Nodo Primario**: Il firewall che gestisce attivamente il traffico e i servizi.

source: **Secondary (or backup) Node**: The firewall that automatically takes over in case of failure on the primary node.
it: **Nodo secondario (o di backup)**: Il firewall che subentra automaticamente in caso di guasto del nodo primario.

source: **Virtual IP (VIP)**: A shared IP address used by both nodes for each configured interface to ensure uninterrupted client access to services. Clients on the network should *always* use the VIP address (e.g., as their gateway, DNS server, or VPN endpoint) to ensure seamless failover.
it: **Virtual IP (VIP)**: Un indirizzo IP condiviso utilizzato da entrambi i nodi per ciascuna interfaccia configurata, al fine di garantire un accesso ininterrotto ai servizi da parte dei client. I client sulla rete dovrebbero *sempre* utilizzare l'indirizzo VIP (ad esempio, come gateway, server DNS o endpoint VPN) per garantire un failover senza interruzioni.

source: HA Roles
it: Ruoli HA

source: **Master**
it: **Principale**

source: The node that currently has all interfaces active and processes all network traffic
it: Il nodo che attualmente ha tutte le interfacce attive ed elabora tutto il traffico di rete

source: Under normal conditions, the Primary Node operates in this status.
it: In condizioni normali, il Nodo Primario opera in questo stato.

source: The node that does not process network traffic.
it: Il nodo che non elabora il traffico di rete.

source: Under normal conditions, the Secondary Node operates in this status.
it: In condizioni normali, il Nodo Secondario opera in questo stato.

source: Configuration changes must **always** be made on the **primary node**. The secondary node should be considered read-only. The only exception is the network configuration of LAN interfaces that are part of the HA cluster.
it: Le modifiche alla configurazione devono essere **sempre** effettuate sul **nodo primario**. Il nodo secondario deve essere considerato in sola lettura. L'unica eccezione riguarda la configurazione di rete delle interfacce LAN che fanno parte del cluster HA.

source: All other relevant configurations, such as firewall rules, VPN settings, or Threat Shield rules, are automatically synchronized from the primary to the secondary node.
it: Tutte le altre configurazioni rilevanti, come le regole del firewall, le impostazioni VPN o le regole di Threat Shield, vengono sincronizzate automaticamente dal nodo primario al nodo secondario.

source: This is how the HA system works:
it: Ecco come funziona il sistema HA:

source: **Heartbeat**: The primary and secondary firewalls continuously check each other's status using the VRRP protocol. If the primary fails, the secondary takes over. The VRRP protocol is carried over a dedicated LAN interface called the **HA interface**, additional information will be provided in a later section.
it: **Heartbeat**: I firewall primario e secondario controllano continuamente lo stato l’uno dell’altro utilizzando il protocollo VRRP. Se il primario si guasta, il secondario subentra. Il protocollo VRRP viene trasportato tramite un’interfaccia LAN dedicata chiamata **interfaccia HA**; ulteriori informazioni saranno fornite in una sezione successiva.

source: **Settings synchronization**: The primary firewall securely sends its settings, including details about active connections like VPNs and network routes, to the secondary firewall.
it: **Sincronizzazione delle impostazioni**: Il firewall primario invia in modo sicuro le proprie impostazioni, inclusi i dettagli sulle connessioni attive come VPN e route di rete, al firewall secondario.

source: The system automatically adjusts what each firewall does based on whether it's the active (primary) or standby (secondary) unit:
it: Il sistema regola automaticamente il comportamento di ciascun firewall in base al fatto che sia l'unità attiva (primaria) o di standby (secondaria):

source: **Secondary receives configuration updates**: When the secondary firewall gets new settings, it saves them but keeps related services (like VPNs) turned off. The secondary firewall holds a complete copy of the primary's configuration but keeps most background tasks inactive. This includes things like checking for software updates, performing remote backups, or sending reports. This ensures only the active primary firewall handles these tasks, preventing conflicts.
it: **Il secondario riceve aggiornamenti di configurazione**: Quando il firewall secondario riceve nuove impostazioni, le salva ma mantiene i servizi correlati (come le VPN) disattivati. Il firewall secondario conserva una copia completa della configurazione del primario, ma mantiene inattivi la maggior parte dei processi in background. Questo include attività come la verifica degli aggiornamenti software, l'esecuzione di backup remoti o l'invio di report. In questo modo, solo il firewall primario attivo gestisce queste attività, prevenendo conflitti.

source: **Firewall becomes active**: When a firewall takes over as the primary (either starting up normally or during a failover), it activates all necessary services and connections.
it: **Il firewall diventa attivo**: Quando un firewall assume il ruolo di primario (sia durante un avvio normale che durante un failover), attiva tutti i servizi e le connessioni necessari.

source: **Firewall becomes standby**: When a firewall is in backup mode (either at startup or when the primary comes back online), it deactivates most services and connections.
it: **Il firewall diventa standby**: Quando un firewall è in modalità di backup (sia all'avvio che quando il primario torna online), disattiva la maggior parte dei servizi e delle connessioni.

source: While the HA system is designed to be as automatic as possible, some configurations require manual intervention. For example, if you add a new LAN network interface or change an existing one, you need to inform the HA system about these changes.
it: Sebbene il sistema HA sia progettato per essere il più automatico possibile, alcune configurazioni richiedono un intervento manuale. Ad esempio, se si aggiunge una nuova interfaccia di rete LAN o si modifica una esistente, è necessario informare il sistema HA di queste modifiche.

source: Supported features and limitations
it: Funzionalità supportate e limitazioni

source: The HA cluster supports synchronization for a wide range of features, including:
it: Il cluster HA supporta la sincronizzazione per un'ampia gamma di funzionalità, tra cui:

source: Firewall rules, port forwarding, DHCP, DNS
it: Regole del firewall, port forwarding, DHCP, DNS

source: VPN configurations (OpenVPN, IPsec, WireGuard)
it: Configurazioni VPN (OpenVPN, IPsec, WireGuard)

source: QoS, Multi-WAN, DPI rules
it: QoS, Multi-WAN, regole DPI

source: Reverse proxy, ACME certificates, and more.
it: Reverse proxy, certificati ACME e altro.

source: Static routes
it: Route statiche

source: Netifyd informatics configuration
it: Configurazione informatica di Netifyd

source: Threat shield IP (banip)
it: Protezione dalle minacce IP (banip)

source: Users and objects database
it: Database di utenti e oggetti

source: SNMP server (snmpd)
it: Server SNMP (snmpd)

source: NAT helpers
it: Helper NAT

source: Dynamic DNS (ddns)
it: DNS dinamico (ddns)

source: SMTP client (msmtp)
it: Client SMTP (msmtp)

source: Backup encryption password
it: Password di cifratura del backup

source: Controller connection and subscription (ns-plug)
it: Connessione e sottoscrizione del controller (ns-plug)

source: Active connections tracking (conntrackd)
it: Monitoraggio delle connessioni attive (conntrackd)

source: Hotspot (dedalo) only on physical interfaces
it: Hotspot (dedalo) solo su interfacce fisiche

source: WAN interface types and setups
it: Tipi e configurazioni di interfacce WAN

source: Static IPv4 and static IPv6 addresses
it: Indirizzi IPv4 statici e indirizzi IPv6 statici

source: IPv4 via DHCP
it: IPv4 tramite DHCP

source: Physical Ethernet interfaces
it: Interfacce Ethernet fisiche

source: Bonded interfaces (link aggregation) composed of physical interfaces
it: Interfacce bond (aggregazione di link) composte da interfacce fisiche

source: Bridge interfaces over physical interfaces
it: Interfacce bridge su interfacce fisiche

source: VLANs on physical interfaces, bond interfaces, or bridge interfaces
it: VLAN su interfacce fisiche, interfacce bond o interfacce bridge

source: PPPoE on physical interfaces or on VLAN interfaces
it: PPPoE su interfacce fisiche o su interfacce VLAN

source: Interfaces Limitations
it: Limitazioni delle interfacce

source: Only IPv4 is supported on LAN interfaces
it: Solo IPv4 è supportato sulle interfacce LAN

source: The HA interface must be a physical interface
it: L'interfaccia HA deve essere un'interfaccia fisica

source: Bonds and bridges are supported only for additional LAN interfaces and WANs, not for the HA interface
it: I bond e i bridge sono supportati solo per interfacce LAN aggiuntive e WAN, non per l'interfaccia HA

source: The Hotspot is supported only on physical interfaces
it: L'Hotspot è supportato solo su interfacce fisiche

source: General limitations
it: Limitazioni generali

source: Extra packages not included inside the image are not supported (eg. NUT, etherwake, etc.)
it: I pacchetti aggiuntivi non inclusi nell'immagine non sono supportati (ad es. NUT, etherwake, ecc.)

source: Syslog daemon (rsyslog) configuration is not synced: if you need to send logs to a remote server, you must use the controller.
it: La configurazione del demone Syslog (rsyslog) non è sincronizzata: se è necessario inviare i log a un server remoto, occorre utilizzare il controller.

source: After the first synchronization, the secondary node will have the same hostname as the primary node. The web user interface will show the hostname of the primary node, but the dashboard will indicate the node's role (primary or secondary). Also, when accessing the SSH console, the prompt will change to indicate the node's role. See the :ref:`troubleshooting_ha-section` section for more details.
it: Dopo la prima sincronizzazione, il nodo secondario avrà lo stesso hostname del nodo primario. L'interfaccia utente web mostrerà l'hostname del nodo primario, ma la dashboard indicherà il ruolo del nodo (primario o secondario). Inoltre, quando si accede alla console SSH, il prompt cambierà per indicare il ruolo del nodo. Consultare la sezione :ref:`troubleshooting_ha-section` per ulteriori dettagli.
