Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/ha_setup_and_management.po
Languages: it

source: Setup and management
it: Configurazione e gestione

source: Requirements
it: Requisiti

source: Before setting up HA, ensure the following requirements are met:
it: Prima di configurare HA, assicurarsi che siano soddisfatti i seguenti requisiti:

source: Two firewalls with identical network devices. Each device must have the exact same name and numbering (e.g., eth0, eth1, eth2, eth3)
it: Due firewall con dispositivi di rete identici. Ogni dispositivo deve avere esattamente lo stesso nome e la stessa numerazione (ad esempio, eth0, eth1, eth2, eth3)

source: Both nodes must be connected to the same LAN; connect the LAN interfaces to the same broadcast domain (usually the same switch).
it: Entrambi i nodi devono essere collegati alla stessa LAN; collegare le interfacce LAN allo stesso dominio di broadcast (di solito allo stesso switch).

source: Static IP addresses for all LAN interfaces that will host a virtual IP.
it: Indirizzi IP statici per tutte le interfacce LAN che ospiteranno un IP virtuale.

source: Setup and configuration
it: Configurazione e impostazione

source: The HA setup process involves several steps. If you just want to see the commands, you can skip to the `Configuration example`_ section, but it's recommended to read the entire section to understand the process and requirements.
it: Il processo di configurazione HA prevede diversi passaggi. Se si desidera solo visualizzare i comandi, è possibile passare direttamente alla sezione `Configuration example`_, ma si consiglia di leggere l'intera sezione per comprendere il processo e i requisiti.

source: The setup process is as follows:
it: Il processo di configurazione è il seguente:

source: **Install the same NethSecurity version** on two identical machines (physical or virtual). See :ref:`install-section` for detailed installation instructions.
it: **Installare la stessa versione di NethSecurity** su due macchine identiche (fisiche o virtuali). Consultare :ref:`install-section` per istruzioni dettagliate sull'installazione.

source: **Connect network cables properly** to ensure redundancy. See `Network cabling`_ section below for proper cabling guidelines.
it: **Collegare correttamente i cavi di rete** per garantire la ridondanza. Consultare la sezione `Network cabling`_ di seguito per le linee guida corrette sul cablaggio.

source: **Configure the HA interface** on both nodes with static IP addresses. Create a LAN on primary and secondary node that will be needed for the cluster before proceeding with HA setup. See `HA interface`_ section below for detailed instructions.
it: **Configurare l'interfaccia HA** su entrambi i nodi con indirizzi IP statici. Creare una LAN sul nodo primario e su quello secondario che sarà necessaria per il cluster prima di procedere con la configurazione di HA. Consultare la sezione `HA interface`_ qui sotto per istruzioni dettagliate.

source: **Initialize the cluster** using the `ns-ha-config` commands to establish the HA cluster foundation. The initialization process configures the necessary services and prepares both nodes for synchronization. During the first configuration, all network interfaces that will be used in the HA cluster must must have the cable connected on both nodes, otherwise the node may enter a fault state and the HA cluster will not work properly. See `Cluster initialization`_ section below for detailed instructions.
it: **Inizializzare il cluster** utilizzando i comandi `ns-ha-config` per stabilire la base del cluster HA. Il processo di inizializzazione configura i servizi necessari e prepara entrambi i nodi per la sincronizzazione. Durante la prima configurazione, tutte le interfacce di rete che verranno utilizzate nel cluster HA devono avere il cavo collegato su entrambi i nodi, altrimenti il nodo potrebbe entrare in stato di errore e il cluster HA potrebbe non funzionare correttamente. Consultare la sezione `Cluster initialization`_ qui sotto per istruzioni dettagliate.

source: **Configure WAN interface in primary node** using the ``Interfaces and devices`` page in the web interface. WAN interfaces will be automatically configured inside the cluster and synchronized to the secondary node. See `WAN Interfaces`_ section below for more info.
it: **Configurare l'interfaccia WAN nel nodo primario** utilizzando la pagina ``Interfacce e dispositivi`` nell'interfaccia web. Le interfacce WAN verranno configurate automaticamente all'interno del cluster e sincronizzate con il nodo secondario. Consultare la sezione `WAN Interfaces`_ di seguito per ulteriori informazioni.

source: **Verify the configuration** to ensure everything is set up correctly. Use the `ns-ha-config` commands to check the status and configuration of the HA cluster. See `Verify the configuration`_ section below for detailed instructions.
it: **Verificare la configurazione** per assicurarsi che tutto sia impostato correttamente. Utilizzare i comandi `ns-ha-config` per controllare lo stato e la configurazione del cluster HA. Consultare la sezione `Verificare la configurazione`_ di seguito per istruzioni dettagliate.

source: **Configure additional LAN interfaces (optional)** for the cluster. This step is optional and depends on your network setup. You can add any additional LAN interface that require HA support. See `Additional LAN interfaces`_ section below for detailed instructions. If you need to configure an hotspot, see `Hotspot support`_ section below for specific requirements.
it: **Configurare interfacce LAN aggiuntive (opzionale)** per il cluster. Questo passaggio è opzionale e dipende dalla configurazione della rete. È possibile aggiungere qualsiasi interfaccia LAN aggiuntiva che richieda il supporto HA. Consultare la sezione `Interfacce LAN aggiuntive`_ di seguito per istruzioni dettagliate. Se è necessario configurare un hotspot, consultare la sezione `Supporto hotspot`_ di seguito per i requisiti specifici.

source: **Add extra Virtual IPs (optional)** to the primary node on relevant LAN interfaces. This step is optional and allows you to add additional IP addresses to the primary node for services that require multiple IPs. See `Extra Virtual IPs`_ section below for detailed instructions.
it: **Aggiungere IP virtuali extra (opzionale)** al nodo primario sulle interfacce LAN rilevanti. Questo passaggio è opzionale e consente di aggiungere indirizzi IP aggiuntivi al nodo primario per i servizi che richiedono più IP. Consultare la sezione `IP virtuali extra`_ di seguito per istruzioni dettagliate.

source: The detailed steps for each of these points are covered in the sections below.
it: I passaggi dettagliati per ciascuno di questi punti sono trattati nelle sezioni seguenti.

source: Sometimes, you may need to remove interfaces or aliases from the HA configuration. This can be done using the ``ns-ha-config`` command. See `Remove interfaces and virtual IPs`_ section below for detailed instructions.
it: A volte può essere necessario rimuovere interfacce o alias dalla configurazione HA. Questo può essere fatto utilizzando il comando ``ns-ha-config``. Consultare la sezione `Remove interfaces and virtual IPs`_ di seguito per istruzioni dettagliate.

source: Network cabling
it: Cablaggio di rete

source: Proper network cabling is essential to ensure high availability and seamless failover between the primary and secondary firewalls.
it: Un cablaggio di rete adeguato è essenziale per garantire un'elevata disponibilità e un failover senza interruzioni tra il firewall primario e quello secondario.

source: **General Recommendations**:
it: **Raccomandazioni generali**:

source: For each network zone (LAN, WAN, DMZ, etc.), use a dedicated switch or VLAN to connect both firewalls' interfaces.
it: Per ogni zona di rete (LAN, WAN, DMZ, ecc.), utilizzare uno switch dedicato o una VLAN per collegare le interfacce di entrambi i firewall.

source: Avoid connecting the firewalls directly to each other; always use a switch or network segment in between.
it: Evitare di collegare i firewall direttamente tra loro; utilizzare sempre uno switch o un segmento di rete intermedio.

source: Label all cables and switches for clarity and easier troubleshooting.
it: Etichettare tutti i cavi e gli switch per maggiore chiarezza e facilitare la risoluzione dei problemi.

source: **LAN Connections**:
it: **Connessioni LAN**:

source: Connect the LAN interfaces of both the primary and secondary nodes to the same network segment.
it: Collegare le interfacce LAN sia del nodo primario che di quello secondario allo stesso segmento di rete.

source: Ideally, use **two separate switches** for redundancy. Connect each firewall's LAN port to both switches (if supported), or at least ensure each firewall is connected to a different switch. This avoids a single point of failure if one switch fails.
it: Idealmente, utilizzare **due switch separati** per la ridondanza. Collegare la porta LAN di ciascun firewall a entrambi gli switch (se supportato), oppure almeno assicurarsi che ciascun firewall sia collegato a uno switch diverso. In questo modo si evita un singolo punto di guasto nel caso in cui uno switch si guasti.

source: If using two separate switches for redundancy, they must be properly interconnected and support Spanning Tree Protocol (STP) to prevent network loops. Unmanaged switches without STP support may cause broadcast storms when interconnected.
it: Se si utilizzano due switch separati per la ridondanza, è necessario che siano correttamente interconnessi e che supportino lo Spanning Tree Protocol (STP) per prevenire loop di rete. Gli switch non gestiti senza supporto STP possono causare broadcast storm quando sono interconnessi.

source: If only one switch is available, use VLAN segmentation to logically separate each network zone and minimize broadcast domains.
it: Se è disponibile solo uno switch, utilizzare la segmentazione VLAN per separare logicamente ciascuna zona di rete e minimizzare i domini di broadcast.

source: Repeat this process for **each network interface** configured for HA (e.g., LAN, GUEST, DMZ). Each interface should be connected to its corresponding network segment, preferably through redundant switches.
it: Ripetere questo processo per **ogni interfaccia di rete** configurata per HA (ad esempio, LAN, GUEST, DMZ). Ogni interfaccia deve essere collegata al relativo segmento di rete, preferibilmente tramite switch ridondanti.

source: **WAN Connections**:
it: **Connessioni WAN**:

source: Connect the WAN interfaces of both nodes to the ISP or upstream router.
it: Collegare le interfacce WAN di entrambi i nodi all'ISP o al router upstream.

source: For best redundancy, use the same approach as with the LAN connections.
it: Per la massima ridondanza, utilizzare lo stesso approccio adottato per le connessioni LAN.

source: If only one WAN switch/router is available, both firewalls should connect to it, but this introduces a single point of failure.
it: Se è disponibile solo uno switch/router WAN, entrambi i firewall dovrebbero collegarsi ad esso, ma questo introduce un singolo punto di guasto.

source: If your ISP provides a router with HA capability (e.g., VRRP or HSRP), you can connect both firewalls' WAN ports directly to the ISP's redundant routers.
it: Se il proprio ISP fornisce un router con funzionalità HA (ad esempio, VRRP o HSRP), è possibile collegare direttamente le porte WAN di entrambi i firewall ai router ridondanti dell'ISP.

source: Alternatively, you can configure MultiWAN directly in NethSecurity to manage multiple WAN uplinks and failover.
it: In alternativa, è possibile configurare MultiWAN direttamente in NethSecurity per gestire più uplink WAN e il failover.

source: This setup ensures that if any single firewall or switch fails, network connectivity is maintained through the secondary node and the remaining switch.
it: Questa configurazione garantisce che, in caso di guasto di un singolo firewall o switch, la connettività di rete venga mantenuta tramite il nodo secondario e lo switch rimanente.

source: The below diagram illustrates the recommended redundant network setup, switches are omitted for clarity.
it: Il diagramma seguente illustra la configurazione di rete ridondante consigliata; gli switch sono omessi per chiarezza.

source: High Availability network diagram showing proper cabling
it: Diagramma di rete High Availability che mostra il cablaggio corretto

source: Interfaces management
it: Gestione delle interfacce

source: Interfaces can be categorized as follows:
it: Le interfacce possono essere classificate come segue:

source: **HA interface**:
it: **Interfaccia HA**:

source: This is the interface used for VRRP communication. It has to be configured on the primary and the secondary node, then it must be added to the HA configuration during initialization. This interface requires three distinct IP addresses: one on the primary node, one on the secondary node and a VIP (Virtual IP) that moves between units when their roles change (Master/Backup). `HA interface`_
it: Questa è l'interfaccia utilizzata per la comunicazione VRRP. Deve essere configurata sia sul nodo primario che su quello secondario, quindi deve essere aggiunta alla configurazione HA durante l'inizializzazione. Questa interfaccia richiede tre indirizzi IP distinti: uno sul nodo primario, uno sul nodo secondario e un VIP (Virtual IP) che si sposta tra le unità quando i loro ruoli cambiano (Master/Backup). `HA interface`_

source: **Additional LAN interfaces**:
it: **Interfacce LAN aggiuntive**:

source: Any interface that is not a WAN, such as another LAN, a guest network, or a DMZ. These are also managed using the three-address logic (primary IP, secondary IP, and VIP), they have to be configured on the primary and the secondary node, then they must be added to the HA configuration after initialization. A fault on any of these interfaces triggers a failover between units. They are configured by adding them as LAN interfaces. `Additional LAN interfaces`_
it: Qualsiasi interfaccia che non sia una WAN, come un'altra LAN, una rete guest o una DMZ. Anche queste vengono gestite utilizzando la logica a tre indirizzi (IP primario, IP secondario e VIP), devono essere configurate sia sul nodo primario che su quello secondario, quindi devono essere aggiunte alla configurazione HA dopo l'inizializzazione. Un guasto su una qualsiasi di queste interfacce attiva un failover tra le unità. Vengono configurate aggiungendole come interfacce LAN. `Interfacce LAN aggiuntive`_

source: **WAN interfaces**:
it: **Interfacce WAN**:

source: These interfaces are treated as special cases. WANs may have limitations when using the three-address scheme (for example, when public IPs are assigned), and it is essential to prevent conflicts between HA mechanisms and MultiWAN management. For this reason, WAN interfaces do not trigger a failover, ensuring proper MultiWAN handling, especially in complex or high-value installations. WAN interfaces only need to be configured on the primary node; they are automatically replicated to the secondary node, further details are provided in the dedicated section below.
it: Queste interfacce sono trattate come casi speciali. Le WAN possono presentare limitazioni nell'utilizzo dello schema a tre indirizzi (ad esempio, quando vengono assegnati IP pubblici), ed è essenziale prevenire conflitti tra i meccanismi di HA e la gestione MultiWAN. Per questo motivo, le interfacce WAN non attivano un failover, garantendo una corretta gestione MultiWAN, soprattutto in installazioni complesse o di alto valore. Le interfacce WAN devono essere configurate solo sul nodo primario; vengono replicate automaticamente sul nodo secondario. Ulteriori dettagli sono forniti nella sezione dedicata di seguito.

source: HA interface
it: Interfaccia HA

source: The HA cluster requires static IP addresses for all LAN interfaces that will host a virtual IP. Follow these steps:
it: Il cluster HA richiede indirizzi IP statici per tutte le interfacce LAN che ospiteranno un IP virtuale. Seguire questi passaggi:

source: Power on the secondary node, access the web interface and set a physical interface with a static LAN IP address (e.g., `192.168.100.239`).
it: Accendere il nodo secondario, accedere all'interfaccia web e configurare un'interfaccia fisica con un indirizzo IP LAN statico (ad esempio, ``192.168.100.239``).

source: Power on the primary node, access the web interface and set a physical interface with a static LAN IP address (e.g., `192.168.100.238`).
it: Accendere il nodo primario, accedere all'interfaccia web e configurare un'interfaccia fisica con un indirizzo IP LAN statico (ad esempio, ``192.168.100.238``).

source: These static IP addresses are used to access the nodes directly, even if the HA cluster is disabled. Consider them *management IP addresses*.
it: Questi indirizzi IP statici vengono utilizzati per accedere direttamente ai nodi, anche se il cluster HA è disabilitato. Considerarli come *indirizzi IP di gestione*.

source: Cluster initialization
it: Inizializzazione del cluster

source: The setup process configures `keepalived` for failover, `rsync` over SSH for configuration synchronization, and `conntrackd` to sync the connection tracking table. All this data passes through the HA interface, which is the one configured during the initialization phase. Use the ``ns-ha-config`` script to simplify the process.
it: Il processo di configurazione imposta `keepalived` per il failover, `rsync` su SSH per la sincronizzazione della configurazione e `conntrackd` per sincronizzare la tabella di connection tracking. Tutti questi dati passano attraverso l'interfaccia HA, che viene configurata durante la fase di inizializzazione. Utilizzare lo script ``ns-ha-config`` per semplificare il processo.

source: Before diving into the actual setup, it's important to ensure that both nodes are properly configured and meet the necessary requirements.
it: Prima di procedere con la configurazione effettiva, è importante assicurarsi che entrambi i nodi siano configurati correttamente e soddisfino i requisiti necessari.

source: Access the console or SSH into the primary node and run the following commands.
it: Accedere alla console o connettersi tramite SSH al nodo primario ed eseguire i seguenti comandi.

source: Check requirements
it: Verificare i requisiti

source: For the primary node::
it: Per il nodo primario::

source: This checks:
it: Questo controlla:

source: The HA interface exists and has a static IP.
it: L'interfaccia HA esiste ed ha un IP statico.

source: If DHCP server is running:
it: Se il server DHCP è in esecuzione:

source: ``3: router`` DHCP option is set (should be the virtual IP).
it: L'opzione DHCP ``3: router`` è impostata (dovrebbe essere l'IP virtuale).

source: ``6: DNS server`` DHCP option is set.
it: L'opzione DHCP ``6: DNS server`` è impostata.

source: For the secondary node::
it: Per il nodo secondario::

source: Secondary node is reachable via SSH on port 22 with root user.
it: Il nodo secondario è raggiungibile tramite SSH sulla porta 22 con l'utente root.

source: The script will request the root password for the secondary node. You can also pipe the password: ::
it: Lo script richiederà la password di root per il nodo secondario. È anche possibile passare la password tramite pipe: ::

source: Ensure the secondary node can be reached via SSH from the primary node on standard port 22.
it: Assicurarsi che il nodo secondario sia raggiungibile tramite SSH dal nodo primario sulla porta standard 22.

source: Initialize nodes
it: Inizializzare i nodi

source: Initialize the primary node::
it: Inizializzare il nodo primario::

source: Where the ``primary_node_ip`` is the static IP of the primary node already set for the HA interface, and ``backup_node_ip`` is the static LAN IP of the secondary node The ``virtual_ip`` is the virtual IP address for the HA interface where all LAN hosts should point to, it must be specified in CIDR notation.
it: Dove ``primary_node_ip`` è l'indirizzo IP statico del nodo primario già configurato per l'interfaccia HA, e ``backup_node_ip`` è l'indirizzo IP LAN statico del nodo secondario. Il ``virtual_ip`` è l'indirizzo IP virtuale per l'interfaccia HA a cui tutti gli host LAN devono puntare; deve essere specificato in notazione CIDR.

source: This script will:
it: Questo script:

source: Initialize `keepalived` with the virtual IP for the LAN interface.
it: Inizializzare `keepalived` con l’IP virtuale per l’interfaccia LAN.

source: Configure `conntrackd`.
it: Configurare `conntrackd`.

source: Generate a random password and public key for synchronization.
it: Generare una password casuale e una chiave pubblica per la sincronizzazione.

source: Configure `dropbear` (SSH server) to listen on port `65022` and allow only key-based authentication for sync.
it: Configurare `dropbear` (server SSH) per ascoltare sulla porta `65022` e consentire solo l'autenticazione tramite chiave per la sincronizzazione. 1. Modificare il file di configurazione o lo script di avvio di `dropbear` per includere le seguenti opzioni:: dropbear -p 65022 -s -g -j - ``-p 65022``: imposta la porta di ascolto su ``65022``. - ``-s``: disabilita l'autenticazione tramite password. - ``-g``: disabilita l'autenticazione tramite gruppo di login. - ``-j``: disabilita l'autenticazione tramite login PAM. 2. Assicurarsi che le chiavi pubbliche degli utenti autorizzati siano presenti nel file ``~/.ssh/authorized_keys`` dell'utente utilizzato per la sincronizzazione. 3. Riavviare il servizio `dropbear` per applicare le modifiche. .. note:: In questo modo, `dropbear` accetterà solo connessioni SSH sulla porta ``65022`` e solo tramite autenticazione con chiave pubblica.

source: Initialize the secondary node, always execute the command on the primary node::
it: Inizializzare il nodo secondario, eseguire sempre il comando sul nodo primario::

source: The script will ask for the root password of the secondary node. You can also pipe the password: ::
it: Lo script richiederà la password di root del nodo secondario. È anche possibile passare la password tramite pipe: ::

source: At this point, the nodes are configured to communicate over LAN, and the LAN virtual IP will failover.
it: A questo punto, i nodi sono configurati per comunicare tramite LAN e l'indirizzo IP virtuale della LAN effettuerà il failover.

source: WAN interfaces
it: Interfacce WAN

source: The system does not require any special configuration for the WAN interfaces. Just configure them inside the ``Interfaces and devices`` page on the primary node and they will be automatically managed by the HA scripts.
it: Il sistema non richiede alcuna configurazione speciale per le interfacce WAN. È sufficiente configurarle all'interno della pagina ``Interfacce e dispositivi`` sul nodo primario e saranno gestite automaticamente dagli script HA.

source: WAN aliases can be added from the same network configuration page and will be automatically synchronized to the secondary node.
it: Gli alias WAN possono essere aggiunti dalla stessa pagina di configurazione della rete e verranno sincronizzati automaticamente con il nodo secondario.

source: WAN interfaces are brought up on the primary node and kept down on the secondary node. Please note that the web interface on the secondary may not be consistent: it may show the interface as "up" even if it's down. This is a known limitation and will be addressed in a future release.
it: Le interfacce WAN vengono attivate sul nodo primario e mantenute inattive sul nodo secondario. Si noti che l'interfaccia web sul nodo secondario potrebbe non essere coerente: potrebbe mostrare l'interfaccia come "attiva" anche se è inattiva. Questa è una limitazione nota e verrà risolta in una versione futura.

source: Verify the configuration
it: Verificare la configurazione
