Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/ha_setup_and_management.po
Languages: it

source: The cluster is now ready to be used. You can check the status of the cluster and verify that the configuration is correct.
it: Il cluster è ora pronto per essere utilizzato. È possibile verificare lo stato del cluster e accertarsi che la configurazione sia corretta.

source: Verify current configuration: ::
it: Verificare la configurazione attuale: ::

source: Check the status of the HA cluster. The first sync may take up to 5 minutes. ::
it: Verificare lo stato del cluster HA. La prima sincronizzazione può richiedere fino a 5 minuti. ::

source: Initial status might show ``Last Sync Status: SSH Connection Failed``. After sync, it should show ``Last Sync Status: Up to Date``.
it: Lo stato iniziale potrebbe mostrare ``Last Sync Status: SSH Connection Failed``. Dopo la sincronizzazione, dovrebbe mostrare ``Last Sync Status: Up to Date``.

source: Additional LAN interfaces
it: Interfacce LAN aggiuntive

source: It's possible to add additional LAN interfaces to the HA cluster after the initial setup. Before adding an interface, ensure that the interface is configured with a static IP address on the primary node and on the secondary node, much like the HA interface configured during the initial setup. Interfaces can be ethernets, bridges, VLANs, or bonds, but make sure the secondary node has the same interface with the same name and with the same device hierarchy (e.g., if the interface is a VLAN, the parent interface must also exist on the secondary node).
it: È possibile aggiungere ulteriori interfacce LAN al cluster HA dopo la configurazione iniziale. Prima di aggiungere un'interfaccia, assicurarsi che l'interfaccia sia configurata con un indirizzo IP statico sia sul nodo primario che su quello secondario, analogamente a quanto fatto per l'interfaccia HA durante la configurazione iniziale. Le interfacce possono essere ethernet, bridge, VLAN o bond, ma è necessario che il nodo secondario disponga della stessa interfaccia con lo stesso nome e con la stessa gerarchia dei dispositivi (ad esempio, se l'interfaccia è una VLAN, anche l'interfaccia padre deve essere presente sul nodo secondario).

source: You can use this command to add any non-WAN interface, like a second LAN, DMZ or GUEST interface to the HA cluster.
it: È possibile utilizzare questo comando per aggiungere qualsiasi interfaccia non-WAN, come una seconda LAN, DMZ o un'interfaccia GUEST al cluster HA.

source: Add additional interfaces as needed::
it: Aggiungere interfacce aggiuntive secondo necessità::

source: The following checks are performed:
it: Vengono eseguiti i seguenti controlli:

source: virtual IP address must be in CIDR notation (e.g., `192.168.100.1/24`)
it: l'indirizzo IP virtuale deve essere in notazione CIDR (ad esempio, ``192.168.100.1/24``)

source: make sure a device with given static IP address exists on the node
it: assicurarsi che un dispositivo con l'indirizzo IP statico specificato esista sul nodo

source: If DHCP server is running, the following
it: Se il server DHCP è in esecuzione, il seguente

source: Example: ::
it: Esempio: ::

source: Hotspot support
it: Supporto hotspot

source: The hotspot feature is supported in HA clusters, but there are important requirements:
it: La funzionalità hotspot è supportata nei cluster HA, ma ci sono requisiti importanti:

source: It must be configured on physical network interfaces only, VLAN interfaces are not supported.
it: Deve essere configurato solo sulle interfacce di rete fisiche; le interfacce VLAN non sono supportate.

source: The secondary node must have the exact same network devices as the primary node.
it: Il nodo secondario deve avere esattamente gli stessi dispositivi di rete del nodo primario.

source: To maintain hotspot functionality during failover, the MAC address of the interface running the hotspot on the primary node is automatically copied to the corresponding interface on the secondary node when a switchover occurs. This behavior prevents the use of VLAN interfaces for the hotspot.
it: Per mantenere la funzionalità hotspot durante il failover, l'indirizzo MAC dell'interfaccia che esegue l'hotspot sul nodo primario viene automaticamente copiato sull'interfaccia corrispondente del nodo secondario quando si verifica uno switchover. Questo comportamento impedisce l'utilizzo di interfacce VLAN per l'hotspot.

source: Note that active sessions are stored in RAM and will be lost during a switchover; clients must re-authenticate unless auto-login is enabled.
it: Si noti che le sessioni attive sono memorizzate nella RAM e andranno perse durante uno switchover; i client dovranno autenticarsi nuovamente a meno che l'accesso automatico non sia abilitato.

source: Extra Virtual IPs
it: IP virtuali extra

source: A Virtual IP (VIP) is an additional IP address assigned to a network interface that will be migrated to the secondary node in case of failover. You can add Virtual IPs to the primary node on relevant interfaces.
it: Un IP Virtuale (VIP) è un indirizzo IP aggiuntivo assegnato a un'interfaccia di rete che verrà migrato al nodo secondario in caso di failover. È possibile aggiungere IP Virtuali al nodo primario sulle interfacce rilevanti.

source: This is useful for services that require multiple IP addresses on the same interface, such as virtual servers or load balancing.
it: Questo è utile per i servizi che richiedono più indirizzi IP sulla stessa interfaccia, come i server virtuali o il bilanciamento del carico.

source: Use the ``ns-ha-config`` command to register the virtual IP in the HA cluster configuration.
it: Utilizzare il comando ``ns-ha-config`` per registrare l'IP virtuale nella configurazione del cluster HA.

source: Virtual IPs must be explicitly set on the primary node. ::
it: Gli IP virtuali devono essere impostati esplicitamente sul nodo primario. ::

source: **Note:** the virtual IP will appear as an extra IP address on the network interface inside the ``Interfaces and devices`` page of the web interface, but it will not be listed in the aliases section.
it: **Nota:** l'IP virtuale apparirà come un indirizzo IP aggiuntivo sull'interfaccia di rete all'interno della pagina ``Interfacce e dispositivi`` dell'interfaccia web, ma non sarà elencato nella sezione degli alias.

source: Remove interfaces and Virtual IPs
it: Rimuovere interfacce e IP virtuali

source: Remove an interface from HA configuration: ::
it: Rimuovere un'interfaccia dalla configurazione HA: ::

source: This removes the interface from `keepalived`, so it will be excluded from the HA configuration. Also, the virtual IP address associated with the interface will be moved to the network interface of the primary node.
it: Questo rimuove l'interfaccia da `keepalived`, quindi verrà esclusa dalla configurazione HA. Inoltre, l'indirizzo IP virtuale associato all'interfaccia verrà spostato sull'interfaccia di rete del nodo primario.

source: Remove a virtual IP from HA configuration: ::
it: Rimuovere un IP virtuale dalla configurazione HA: ::

source: Configuration example
it: Esempio di configurazione

source: Assuming:
it: Supponendo:

source: Primary Node LAN IP: `192.168.100.238`
it: IP LAN del nodo primario: ``192.168.100.238``

source: Secondary Node LAN IP: `192.168.100.239`
it: IP LAN nodo secondario: ``192.168.100.239``

source: LAN Interface Name: `lan`
it: Nome interfaccia LAN: ``lan``

source: Secondary Node Root Password: `backup_root_password`
it: Password di root del nodo secondario: ``backup_root_password``

source: Execute the following commands on the **primary node**:
it: Eseguire i seguenti comandi sul **nodo primario**:

source: Check requirements: ::
it: Verificare i requisiti: ::

source: Setup the cluster: ::
it: Configurare il cluster: ::
