Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/high_availability.po
Languages: it

source: This feature is in beta and may not be fully functional or stable. Use it at your own risk, and ensure you have backups of your configuration.
it: Questa funzionalità è in versione beta e potrebbe non essere completamente funzionante o stabile. Utilizzarla a proprio rischio e assicurarsi di avere copie di backup della configurazione.

source: NethSecurity High Availability (HA) ensures continuous network operation by providing redundancy through a cluster of two firewalls. If the primary firewall fails due to hardware issues, software problems, or maintenance, a backup firewall automatically takes over all network services and traffic handling, minimizing downtime.
it: L'High Availability (HA) di NethSecurity garantisce la continuità operativa della rete fornendo ridondanza tramite un cluster di due firewall. Se il firewall primario si guasta a causa di problemi hardware, malfunzionamenti software o manutenzione, un firewall di backup assume automaticamente il controllo di tutti i servizi di rete e della gestione del traffico, riducendo al minimo i tempi di inattività.

source: This is crucial for businesses or organizations where uninterrupted internet access, VPN connectivity, and security services are essential for daily operations, preventing loss of productivity or revenue during an outage.
it: Questo è fondamentale per aziende o organizzazioni in cui l’accesso a Internet senza interruzioni, la connettività VPN e i servizi di sicurezza sono essenziali per le operazioni quotidiane, prevenendo la perdita di produttività o di ricavi durante un’interruzione.

source: Key concepts
it: Concetti chiave

source: Some key concepts to understand before setting up HA:
it: Alcuni concetti chiave da comprendere prima di configurare HA:

source: **Primary Node**: The firewall that actively handles traffic and services.
it: **Nodo primario**: Il firewall che gestisce attivamente il traffico e i servizi.

source: **Backup Node**: The firewall that automatically takes over in case of failure on the primary node.
it: **Nodo di backup**: Il firewall che subentra automaticamente in caso di guasto del nodo primario.

source: **Virtual IP (VIP)**: A shared IP address used by both nodes for each configured interface to ensure uninterrupted client access to services. Clients on the network should *always* use the VIP address (e.g., as their gateway, DNS server, or VPN endpoint) to ensure seamless failover.
it: **Virtual IP (VIP)**: Un indirizzo IP condiviso utilizzato da entrambi i nodi per ciascuna interfaccia configurata, al fine di garantire un accesso ininterrotto ai servizi da parte dei client. I client sulla rete dovrebbero *sempre* utilizzare l'indirizzo VIP (ad esempio, come gateway, server DNS o endpoint VPN) per garantire un failover senza interruzioni.

source: Configuration changes must **always** be made on the **primary node**. The backup node should be considered read-only. Most configurations, such as firewall rules, VPN settings, or Threat Shield rules, are automatically synchronized from the primary to the backup node.
it: Le modifiche alla configurazione devono essere **sempre** effettuate sul **nodo primario**. Il nodo di backup deve essere considerato di sola lettura. La maggior parte delle configurazioni, come le regole del firewall, le impostazioni VPN o le regole di Threat Shield, vengono sincronizzate automaticamente dal nodo primario al nodo di backup.

source: This is how the HA system works:
it: Ecco come funziona il sistema HA:

source: **Heartbeat**: The primary and backup firewalls continuously check each other's status using the VRRP protocol. If the primary fails, the backup takes over.
it: **Heartbeat**: I firewall primario e di backup controllano continuamente lo stato l'uno dell'altro utilizzando il protocollo VRRP. Se il primario si guasta, il backup subentra.

source: **Settings synchronization**: The primary firewall securely sends its settings, including details about active connections like VPNs and network routes, to the backup firewall.
it: **Sincronizzazione delle configurazione**: Il firewall primario invia in modo sicuro le proprie impostazioni, inclusi i dettagli sulle connessioni attive come VPN e rotte di rete, al firewall di backup.

source: The system automatically adjusts what each firewall does based on whether it's the active (primary) or standby (backup) unit:
it: Il sistema regola automaticamente il comportamento di ciascun firewall in base al fatto che sia l'unità attiva (primaria) o in standby (backup):

source: **Backup receives configuration updates**: When the backup firewall gets new settings, it saves them but keeps related services (like VPNs) turned off. The backup firewall holds a complete copy of the primary's configuration but keeps most background tasks inactive. This includes things like checking for software updates, performing remote backups, or sending reports. This ensures only the active primary firewall handles these tasks, preventing conflicts.
it: **Il backup riceve aggiornamenti di configurazione**: Quando il firewall di backup riceve nuove impostazioni, le salva ma mantiene i servizi correlati (come le VPN) disattivati. Il firewall di backup conserva una copia completa della configurazione del primario, ma mantiene la maggior parte delle attività in background inattive. Questo include operazioni come la verifica degli aggiornamenti software, l'esecuzione di backup remoti o l'invio di report. In questo modo, solo il firewall primario attivo gestisce queste attività, evitando conflitti.

source: **Firewall becomes active**: When a firewall takes over as the primary (either starting up normally or during a failover), it activates all necessary services and connections.
it: **Il firewall diventa attivo**: Quando un firewall assume il ruolo di primario (sia durante un avvio normale che durante un failover), attiva tutti i servizi e le connessioni necessari.

source: **Firewall becomes standby**: When a firewall is in backup mode (either at startup or when the primary comes back online), it deactivates most services and connections.
it: **Il firewall diventa in standby**: Quando un firewall è in modalità di backup (sia all'avvio che quando il primario torna online), disattiva la maggior parte dei servizi e delle connessioni.

source: While the HA system is designed to be as automatic as possible, some configurations require manual intervention. For example, if you add a new network interface or change an existing one, you need to inform the HA system about these changes. Specific actions are needed to ensure the backup node is aware of the new network configuration:
it: Sebbene il sistema HA sia progettato per essere il più automatico possibile, alcune configurazioni richiedono un intervento manuale. Ad esempio, se si aggiunge una nuova interfaccia di rete o si modifica una esistente, è necessario informare il sistema HA di queste modifiche. Sono necessarie azioni specifiche per garantire che il nodo di backup sia a conoscenza della nuova configurazione di rete:

source: Beside the first LAN and WAN configured in the initial setup, all other interfaces must be explicitly added to the HA cluster. This is done using the ``ns-ha-config add-lan-interface`` or ``ns-ha-config add-wan-interface`` command. This command registers the new interface in the HA cluster configuration and associates a Virtual IP (VIP) with it for failover.
it: Oltre alla prima LAN e WAN configurate durante la configurazione iniziale, tutte le altre interfacce devono essere aggiunte esplicitamente al cluster HA. Questo viene fatto utilizzando il comando ``ns-ha-config add-lan-interface`` oppure ``ns-ha-config add-wan-interface``. Questo comando registra la nuova interfaccia nella configurazione del cluster HA e le associa un Virtual IP (VIP) per il failover.

source: Similarly, when adding an IP alias to an interface on the primary node, you must also register this alias within the HA cluster configuration using ``ns-ha-config add-alias``.
it: Analogamente, quando si aggiunge un alias IP a un'interfaccia sul nodo primario, è necessario registrare anche questo alias nella configurazione del cluster HA utilizzando ``ns-ha-config add-alias``.

source: Supported features and limitations
it: Funzionalità supportate e limitazioni

source: The HA cluster supports synchronization for a wide range of features, including:
it: Il cluster HA supporta la sincronizzazione per un'ampia gamma di funzionalità, tra cui:

source: Firewall rules, port forwarding, DHCP, DNS
it: Regole del firewall, port forwarding, DHCP, DNS

source: VPN configurations (OpenVPN, IPsec, WireGuard)
it: Configurazioni VPN (OpenVPN, IPsec, WireGuard)

source: QoS, Multi-WAN, DPI rules
it: QoS, Multi-WAN, regole DPI

source: Reverse proxy, ACME certificates, and more.
it: Reverse proxy, certificati ACME e altro.

source: Static routes
it: Route statiche

source: Netifyd informatics configuration
it: Configurazione informatica di Netifyd

source: Threat shield IP (banip)
it: Protezione dalle minacce IP (banip)

source: Users and objects database
it: Database di utenti e oggetti

source: SNMP server (snmpd)
it: Server SNMP (snmpd)

source: NAT helpers
it: Helper NAT

source: Dynamic DNS (ddns)
it: DNS dinamico (ddns)

source: SMTP client (msmtp)
it: Client SMTP (msmtp)

source: Backup encryption password
it: Password di cifratura del backup

source: Controller connection and subscription (ns-plug)
it: Connessione al controller e subscription (ns-plug)

source: Active connections tracking (conntrackd)
it: Monitoraggio delle connessioni attive (conntrackd)

source: Be aware of the following current limitations:
it: Si tengano presente le seguenti limitazioni attuali:

source: IPv4 only (IPv6 is not supported).
it: Solo IPv4 (IPv6 non è supportato).

source: VLANs are supported only on physical interfaces.
it: Le VLAN sono supportate solo sulle interfacce fisiche.

source: Extra packages such as NUT are not supported.
it: Pacchetti aggiuntivi come NUT non sono supportati.

source: Syslog daemon (rsyslog) configuration is not synced: if you need to send logs to a remote server, you must use the controller.
it: La configurazione del demone Syslog (rsyslog) non è sincronizzata: se è necessario inviare i log a un server remoto, occorre utilizzare il controller.

source: PPPoE or DHCP WAN is not supported (see Static IP requirement)
it: PPPoE o DHCP WAN non sono supportati (vedere il requisito IP statico)

source: Also note that after the first synchronization, the backup node will have the same hostname as the primary node. The web user interface will show the hostname of the primary node, but the dashboard will indicate the node's role (primary or backup). Also, when accessing the SSH console, the prompt will change to indicate the node's role. See the :ref:`troubleshooting_ha-section` section for more details.
it: Si noti inoltre che, dopo la prima sincronizzazione, il nodo di backup avrà lo stesso hostname del nodo primario. L'interfaccia utente web mostrerà l'hostname del nodo primario, ma la dashboard indicherà il ruolo del nodo (primario o backup). Inoltre, quando si accede alla console SSH, il prompt cambierà per indicare il ruolo del nodo. Consultare la sezione :ref:`troubleshooting_ha-section` per ulteriori dettagli.

source: Requirements
it: Requisiti

source: Before setting up HA, ensure the following requirements are met:
it: Prima di configurare l'HA, assicurarsi che siano soddisfatti i seguenti requisiti:

source: Two firewalls with identical network devices. Each device must have the exact same name and numbering (e.g., eth0, eth1, eth2, eth3)
it: Due firewall con dispositivi di rete identici. Ogni dispositivo deve avere esattamente lo stesso nome e la stessa numerazione (ad esempio, eth0, eth1, eth2, eth3)

source: Both nodes must be connected to the same LAN; connect the LAN interfaces to the same broadcast domain (usually the same switch).
it: Entrambi i nodi devono essere collegati alla stessa LAN; collegare le interfacce LAN allo stesso dominio di broadcast (di solito lo stesso switch).

source: Static IP addresses for all interfaces that will host a virtual IP.
it: Indirizzi IP statici per tutte le interfacce che ospiteranno un IP virtuale.

source: Setup and configuration
it: Configurazione e impostazione

source: The HA setup process involves several steps. If you just want to see the commands, you can skip to the `Configuration example`_ section, but it's recommended to read the entire section to understand the process and requirements.
it: Il processo di configurazione HA prevede diversi passaggi. Se si desidera solo visualizzare i comandi, è possibile passare direttamente alla sezione `Esempio di configurazione`_, ma si consiglia di leggere l'intera sezione per comprendere il processo e i requisiti.

source: The setup process is as follows:
it: Il processo di configurazione è il seguente:

source: **Install the same NethSecurity version** on two identical machines (physical or virtual). See :ref:`install-section` for detailed installation instructions.
it: **Installare la stessa versione di NethSecurity** su due macchine identiche (fisiche o virtuali). Consultare :ref:`install-section` per istruzioni dettagliate sull'installazione.

source: **Connect network cables properly** to ensure redundancy. See `Network cabling`_ section below for proper cabling guidelines.
it: **Collegare correttamente i cavi di rete** per garantire la ridondanza. Consultare la sezione `Network cabling`_ di seguito per le linee guida corrette sul cablaggio.

source: **Configure LAN interfaces** on both nodes with static IP addresses. Create any VLANs or other network devices that will be needed for the cluster before proceeding with HA setup. See `LAN interfaces`_ section below for detailed instructions.
it: **Configurare le interfacce LAN** su entrambi i nodi con indirizzi IP statici. Creare eventuali VLAN o altri dispositivi di rete necessari per il cluster prima di procedere con la configurazione HA. Consultare la sezione `LAN interfaces`_ di seguito per istruzioni dettagliate.

source: **Initialize the cluster** using the `ns-ha-config` commands to establish the HA cluster foundation. The initialization process configures the necessary services and prepares both nodes for synchronization. During the first configuration, all network interfaces that will be used in the HA cluster must must have the cable connected on both nodes, otherwise the node may enter a fault state and the HA cluster will not work properly. See `Cluster initialization`_ section below for detailed instructions.
it: **Inizializzare il cluster** utilizzando i comandi `ns-ha-config` per stabilire la base del cluster HA. Il processo di inizializzazione configura i servizi necessari e prepara entrambi i nodi per la sincronizzazione. Durante la prima configurazione, tutte le interfacce di rete che verranno utilizzate nel cluster HA devono avere il cavo collegato su entrambi i nodi, altrimenti il nodo potrebbe entrare in stato di errore e il cluster HA potrebbe non funzionare correttamente. Consultare la sezione `Cluster initialization`_ di seguito per istruzioni dettagliate.

source: **Add WAN interface** to cluster configuration to ensure proper failover for internet connectivity. This step is crucial for maintaining internet access during failover scenarios. See `WAN Interfaces`_ section below for detailed instructions.
it: **Aggiungere l'interfaccia WAN** alla configurazione del cluster per garantire un corretto failover della connettività Internet. Questo passaggio è fondamentale per mantenere l'accesso a Internet durante gli scenari di failover. Consultare la sezione `WAN Interfaces`_ di seguito per istruzioni dettagliate.

source: **Verify the configuration** to ensure everything is set up correctly. Use the `ns-ha-config` commands to check the status and configuration of the HA cluster. See `Verify the configuration`_ section below for detailed instructions.
it: **Verificare la configurazione** per assicurarsi che tutto sia impostato correttamente. Utilizzare i comandi `ns-ha-config` per controllare lo stato e la configurazione del cluster HA. Consultare la sezione `Verificare la configurazione`_ di seguito per istruzioni dettagliate.

source: **Configure additional interfaces** for the cluster as needed (optional). This step is optional and depends on your network setup. You can add any additional interfaces that require HA support. See `Additional interfaces`_ section below for detailed instructions. If you need to configure an hotspot, see `Hotspot support`_ section below for specific requirements.
it: **Configurare interfacce aggiuntive** per il cluster secondo necessità (opzionale). Questo passaggio è facoltativo e dipende dalla configurazione della rete. È possibile aggiungere tutte le interfacce aggiuntive che richiedono il supporto HA. Consultare la sezione `Interfacce aggiuntive`_ di seguito per istruzioni dettagliate. Se è necessario configurare un hotspot, vedere la sezione `Supporto hotspot`_ di seguito per i requisiti specifici.

source: **Add IP aliases** to the primary node on relevant interfaces (optional). This step is optional and allows you to add additional IP addresses to the primary node for services that require multiple IPs. See `Network aliases`_ section below for detailed instructions.
it: **Aggiungere alias IP** al nodo primario sulle interfacce rilevanti (opzionale). Questo passaggio è facoltativo e consente di aggiungere indirizzi IP aggiuntivi al nodo primario per i servizi che richiedono più IP. Consultare la sezione `Alias di rete`_ di seguito per istruzioni dettagliate.

source: The detailed steps for each of these points are covered in the sections below.
it: I passaggi dettagliati per ciascuno di questi punti sono trattati nelle sezioni seguenti.

source: Sometimes, you may need to remove interfaces or aliases from the HA configuration. This can be done using the `ns-ha-config` commands. See `Remove interfaces and aliases`_ section below for detailed instructions.
it: A volte può essere necessario rimuovere interfacce o alias dalla configurazione HA. Questo può essere fatto utilizzando i comandi `ns-ha-config`. Consultare la sezione `Remove interfaces and aliases`_ qui sotto per istruzioni dettagliate.

source: Network cabling
it: Cablaggio di rete

source: Proper network cabling is essential to ensure high availability and seamless failover between the primary and backup firewalls.
it: Un cablaggio di rete adeguato è essenziale per garantire un'elevata disponibilità e un failover senza interruzioni tra il firewall primario e quello di backup.

source: **General Recommendations**:
it: **Raccomandazioni generali**:

source: For each network zone (LAN, WAN, DMZ, etc.), use a dedicated switch or VLAN to connect both firewalls' interfaces.
it: Per ogni zona di rete (LAN, WAN, DMZ, ecc.), utilizzare uno switch dedicato o una VLAN per collegare le interfacce di entrambi i firewall.

source: Avoid connecting the firewalls directly to each other; always use a switch or network segment in between.
it: Evitare di collegare i firewall direttamente tra loro; utilizzare sempre uno switch o un segmento di rete intermedio.

source: Label all cables and switches for clarity and easier troubleshooting.
it: Etichettare tutti i cavi e gli switch per maggiore chiarezza e per facilitare la risoluzione dei problemi.

source: **LAN Connections**:
it: **Connessioni LAN**:

source: Connect the LAN interfaces of both the primary and backup nodes to the same network segment.
it: Collegare le interfacce LAN sia del nodo primario che di quello di backup allo stesso segmento di rete.

source: Ideally, use **two separate switches** for redundancy. Connect each firewall's LAN port to both switches (if supported), or at least ensure each firewall is connected to a different switch. This avoids a single point of failure if one switch fails.
it: Idealmente, utilizzare **due switch separati** per la ridondanza. Collegare la porta LAN di ciascun firewall a entrambi gli switch (se supportato), oppure almeno assicurarsi che ogni firewall sia collegato a uno switch diverso. In questo modo si evita un singolo punto di guasto nel caso in cui uno switch si guasti.

source: If using two separate switches for redundancy, they must be properly interconnected and support Spanning Tree Protocol (STP) to prevent network loops. Unmanaged switches without STP support may cause broadcast storms when interconnected.
it: Se si utilizzano due switch separati per la ridondanza, è necessario che siano correttamente interconnessi e che supportino lo Spanning Tree Protocol (STP) per prevenire loop di rete. Gli switch non gestiti senza supporto STP possono causare broadcast storm quando sono interconnessi.

source: If only one switch is available, use VLAN segmentation to logically separate each network zone and minimize broadcast domains.
it: Se è disponibile solo uno switch, utilizzare la segmentazione VLAN per separare logicamente ciascuna zona di rete e minimizzare i domini di broadcast.

source: Repeat this process for **each network interface** configured for HA (e.g., LAN, GUEST, DMZ). Each interface should be connected to its corresponding network segment, preferably through redundant switches.
it: Ripetere questo processo per **ogni interfaccia di rete** configurata per HA (ad esempio, LAN, GUEST, DMZ). Ogni interfaccia deve essere collegata al relativo segmento di rete, preferibilmente tramite switch ridondanti.

source: **WAN Connections**:
it: **Connessioni WAN**:

source: Connect the WAN interfaces of both nodes to the ISP or upstream router.
it: Collegare le interfacce WAN di entrambi i nodi all'ISP o al router upstream.

source: For best redundancy, use the same approach as with the LAN connections.
it: Per la massima ridondanza, utilizzare lo stesso approccio adottato per le connessioni LAN.

source: If only one WAN switch/router is available, both firewalls should connect to it, but this introduces a single point of failure.
it: Se è disponibile solo uno switch/router WAN, entrambi i firewall dovrebbero collegarsi ad esso, ma questo introduce un singolo punto di guasto.

source: If your ISP provides a router with HA capability (e.g., VRRP or HSRP), you can connect both firewalls' WAN ports directly to the ISP's redundant routers.
it: Se il proprio ISP fornisce un router con funzionalità HA (ad esempio, VRRP o HSRP), è possibile collegare direttamente le porte WAN di entrambi i firewall ai router ridondanti dell'ISP.

source: Alternatively, you can configure MultiWAN directly in NethSecurity to manage multiple WAN uplinks and failover.
it: In alternativa, è possibile configurare MultiWAN direttamente in NethSecurity per gestire più uplink WAN e il failover.

source: This setup ensures that if any single firewall or switch fails, network connectivity is maintained through the backup node and the remaining switch.
it: Questa configurazione garantisce che, se un singolo firewall o switch dovesse guastarsi, la connettività di rete venga mantenuta tramite il nodo di backup e lo switch rimanente.

source: The below diagram illustrates the recommended redundant network setup, switches are omitted for clarity.
it: Il diagramma seguente illustra la configurazione di rete ridondante consigliata; gli switch sono omessi per chiarezza.

source: High Availability network diagram showing proper cabling
it: Diagramma di rete per l'Alta Disponibilità che mostra il cablaggio corretto

source: LAN interfaces
it: Interfacce LAN

source: The HA cluster requires static IP addresses for all interfaces that will host a virtual IP. Follow these steps:
it: Il cluster HA richiede indirizzi IP statici per tutte le interfacce che ospiteranno un IP virtuale. Seguire questi passaggi:
