Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/high_availability.po
Languages: it

source: On a primary node, the `master.became_master` should be `1` or more, indicating it has successfully taken over as the master. Also the `master.advertisements.sent` should be greater than `0`, indicating it is actively sending advertisements to the backup node.
it: Su un nodo primario, il valore di `master.became_master` dovrebbe essere `1` o superiore, indicando che ha assunto con successo il ruolo di master. Inoltre, `master.advertisements.sent` dovrebbe essere maggiore di `0`, indicando che sta inviando attivamente annunci al nodo di backup.

source: On a backup node, the `master.advertisements.received` should be greater than `0`, indicating it is receiving advertisements from the primary node. If the `master.became_master` is `0`, it means the node has not taken over as the master, which is expected for a backup node.
it: Su un nodo di backup, il valore di `master.advertisements.received` dovrebbe essere maggiore di `0`, indicando che sta ricevendo annunci dal nodo primario. Se `master.became_master` è `0`, significa che il nodo non è subentrato come master, il che è previsto per un nodo di backup.

source: VRRP traffic
it: Traffico VRRP

source: The primary node sends VRRP advertisements to the backup node every second. You can check the VRRP traffic using the following command on the primary node: ::
it: Il nodo primario invia annunci VRRP al nodo di backup ogni secondo. È possibile verificare il traffico VRRP utilizzando il seguente comando sul nodo primario: ::

source: Replace `<lan_interface>` with the name of the LAN interface (e.g., `eth0`).
it: Sostituire `<lan_interface>` con il nome dell'interfaccia LAN (ad esempio, ``eth0``).

source: The output should show VRRP packets being sent from the primary node to the backup node. Some example output: ::
it: L'output dovrebbe mostrare i pacchetti VRRP inviati dal nodo primario al nodo di backup. Un esempio di output: ::

source: 192.168.100.238 > 192.168.100.239: VRRPv2, Advertisement, vrid 100, prio 200, authtype simple, intvl 1s, length 24, addrs(2): 192.168.122.49,192.168.100.240 auth "1655e3d3"
it: 192.168.100.238 > 192.168.100.239: VRRPv2, Annuncio, vrid 100, priorità 200, tipo autenticazione semplice, intervallo 1s, lunghezza 24, indirizzi(2): 192.168.122.49,192.168.100.240 auth "1655e3d3"

source: If the same command is run on the backup node, it should show VRRP packets being received from the primary node.
it: Se lo stesso comando viene eseguito sul nodo di backup, dovrebbe mostrare i pacchetti VRRP ricevuti dal nodo primario.

source: Logs
it: Log

source: All logs are stored in ``/var/log/messages`` on both nodes.
it: Tutti i log sono memorizzati in ``/var/log/messages`` su entrambi i nodi.

source: You can examine specific components of the HA system in logs:
it: È possibile esaminare componenti specifici del sistema HA nei log:

source: Check rsync synchronization logs::
it: Controllare i log di sincronizzazione di rsync::

source: Examine SSH connection activities for syncing::
it: Esaminare le attività di connessione SSH per la sincronizzazione::

source: View keepalived status changes and events::
it: Visualizzare le modifiche di stato e gli eventi di keepalived:

source: Track network configuration imports on backup node::
it: Traccia le importazioni della configurazione di rete sul nodo di backup:

source: When log files are not sufficient, you can enable debug logging for specific components:
it: Quando i file di log non sono sufficienti, è possibile abilitare la registrazione dei log di debug per componenti specifici:

source: Debug the `ns-ha-config` script: ::
it: Eseguire il debug dello script `ns-ha-config`: ::

source: View active `keepalived` configuration: ::
it: Visualizzare la configurazione attiva di ``keepalived``: ::

source: Enable `keepalived` debug logging (on primary): ::
it: Abilitare la registrazione di debug di `keepalived` (sul primario): ::

source: Then, search for ``Keepalived_vrrp`` in the ``/var/log/messages`` file.
it: Quindi, cercare ``Keepalived_vrrp`` nel file ``/var/log/messages``.

source: Reset the configuration
it: Reimpostare la configurazione

source: To completely remove the HA configuration: ::
it: Per rimuovere completamente la configurazione HA: ::

source: Stop and disable `keepalived` and `conntrackd`.
it: Arrestare e disabilitare ``keepalived`` e ``conntrackd``.

source: Remove HA configuration files.
it: Rimuovere i file di configurazione HA.

source: Clean up `dropbear` configuration including SSH keys.
it: Pulire la configurazione di `dropbear`, inclusi le chiavi SSH.

source: The network configuration of the nodes remains unchanged. You can manage them as standalone nodes using their static management IPs.
it: La configurazione di rete dei nodi rimane invariata. È possibile gestirli come nodi standalone utilizzando i loro indirizzi IP di gestione statici.
