Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/high_availability.po
Languages: it

source: Power on the backup node, access the web interface and set a static LAN IP address (e.g., `192.168.100.239`).
it: Accendere il nodo di backup, accedere all'interfaccia web e impostare un indirizzo IP LAN statico (ad esempio, ``192.168.100.239``).

source: Power on the primary node, access the web interface and set a static LAN IP address (e.g., `192.168.100.238`).
it: Accendere il nodo primario, accedere all'interfaccia web e impostare un indirizzo IP LAN statico (ad esempio, ``192.168.100.238``).

source: These static IP addresses are used to access the nodes directly, even if the HA cluster is disabled. Consider them *management IP addresses*.
it: Questi indirizzi IP statici vengono utilizzati per accedere direttamente ai nodi, anche se il cluster HA è disabilitato. Considerarli come *indirizzi IP di gestione*.

source: Cluster initialization
it: Inizializzazione del cluster

source: The setup process configures `keepalived` for failover, `rsync` over SSH for configuration synchronization, and `conntrackd` to sync the connection tracking table. Use the `ns-ha-config` script to simplify the process.
it: Il processo di configurazione imposta `keepalived` per il failover, `rsync` su SSH per la sincronizzazione della configurazione e `conntrackd` per sincronizzare la tabella di tracciamento delle connessioni. Utilizzare lo script `ns-ha-config` per semplificare il processo.

source: Before diving into the actual setup, it's important to ensure that both nodes are properly configured and meet the necessary requirements.
it: Prima di procedere con la configurazione effettiva, è importante assicurarsi che entrambi i nodi siano configurati correttamente e soddisfino i requisiti necessari.

source: Access the console or SSH into the primary node and run the following commands.
it: Accedere alla console o connettersi tramite SSH al nodo primario ed eseguire i seguenti comandi.

source: Check requirements
it: Verificare i requisiti

source: For the primary node::
it: Per il nodo primario::

source: This checks:
it: Questo controlla:

source: LAN interface has a static IP. If the ``lan_interface`` parameter is not provided, it searches for a LAN interface named ``lan``.
it: L'interfaccia LAN ha un IP statico. Se il parametro ``lan_interface`` non viene fornito, viene cercata un'interfaccia LAN chiamata ``lan``.

source: At least one WAN interface exists. If the ``wan_interface`` parameter is not provided, it searches for a WAN interface named ``wan``. The WAN interface must be configured with a static IP address; PPPoE and DHCP are not supported.
it: Esiste almeno un'interfaccia WAN. Se il parametro ``wan_interface`` non viene fornito, viene cercata un'interfaccia WAN chiamata ``wan``. L'interfaccia WAN deve essere configurata con un indirizzo IP statico; PPPoE e DHCP non sono supportati.

source: If DHCP server is running:
it: Se il server DHCP è in esecuzione:

source: ``Force DHCP server start`` option is enabled.
it: L'opzione ``Forza l'avvio del server DHCP`` è abilitata.

source: ``3: router`` DHCP option is set (should be the virtual IP).
it: L'opzione DHCP ``3: router`` è impostata (dovrebbe essere l'IP virtuale).

source: ``6: DNS server`` DHCP option is set.
it: L'opzione DHCP ``6: DNS server`` è impostata.

source: For the backup node::
it: Per il nodo di backup::

source: Backup node is reachable via SSH on port 22 with root user.
it: Il nodo di backup è raggiungibile tramite SSH sulla porta 22 con l'utente root.

source: At least one WAN interface exists.
it: Esiste almeno un'interfaccia WAN.

source: WAN interface can be omitted on the backup node, but bear in mind that in case of failover, the UI of the backup node will show an unknown interface. It's recommended to configure the WAN interface on the backup node as well, even if it does not have a static IP address.
it: L'interfaccia WAN può essere omessa sul nodo di backup, ma si tenga presente che, in caso di failover, l'interfaccia utente del nodo di backup mostrerà un'interfaccia sconosciuta. Si consiglia di configurare comunque l'interfaccia WAN anche sul nodo di backup, anche se non dispone di un indirizzo IP statico.

source: The script will request the root password for the backup node. You can also pipe the password: ::
it: Lo script richiederà la password di root per il nodo di backup. È anche possibile passare la password tramite pipe: ::

source: Ensure the backup node can be reached via SSH from the primary node on standard port 22.
it: Assicurarsi che il nodo di backup sia raggiungibile tramite SSH dal nodo primario sulla porta standard 22.

source: Initialize nodes
it: Inizializzare i nodi

source: Initialize the primary node::
it: Inizializzare il nodo primario::

source: Where the ``primary_node_ip`` is the static IP of the primary node already set for the LAN interface, and ``backup_node_ip`` is the static LAN IP of the backup node The ``virtual_ip`` is the virtual IP address for the LAN interface where all LAN hosts should point to. The ``lan_interface`` parameter is optional and specifies the LAN interface name (default is `lan`).
it: Dove ``primary_node_ip`` è l'indirizzo IP statico del nodo primario già configurato per l'interfaccia LAN, e ``backup_node_ip`` è l'indirizzo IP statico LAN del nodo di backup. Il ``virtual_ip`` è l'indirizzo IP virtuale per l'interfaccia LAN a cui tutti gli host LAN devono puntare. Il parametro ``lan_interface`` è opzionale e specifica il nome dell'interfaccia LAN (il valore predefinito è `lan`).

source: This script will:
it: Questo script:

source: Initialize `keepalived` with the virtual IP for the LAN interface.
it: Inizializzare `keepalived` con l'indirizzo IP virtuale per l'interfaccia LAN.

source: Configure `conntrackd`.
it: Configurare `conntrackd`.

source: Generate a random password and public key for synchronization.
it: Generare una password casuale e una chiave pubblica per la sincronizzazione.

source: Configure `dropbear` (SSH server) to listen on port `65022` and allow only key-based authentication for sync.
it: Configurare `dropbear` (server SSH) per ascoltare sulla porta `65022` e consentire solo l'autenticazione tramite chiave per la sincronizzazione.

source: Initialize the backup node (always execute the command on the primary node)::
it: Inizializzare il nodo di backup (eseguire sempre il comando sul nodo primario)::

source: The script will ask for the root password of the backup node. You can also pipe the password: ::
it: Lo script richiederà la password di root del nodo di backup. È anche possibile passare la password tramite pipe: ::

source: At this point, the nodes are configured to communicate over LAN, and the LAN virtual IP will failover.
it: A questo punto, i nodi sono configurati per comunicare tramite LAN e l'indirizzo IP virtuale della LAN effettuerà il failover.

source: WAN interfaces
it: Interfacce WAN

source: The WAN interface is the first interface to be added to the HA cluster. Remember that the WAN interface must be configured with a static IP address, so make sure also to setup
it: L'interfaccia WAN è la prima interfaccia da aggiungere al cluster HA. Ricordare che l'interfaccia WAN deve essere configurata con un indirizzo IP statico, quindi assicurarsi anche di configurare

source: :ref:`DNS forwarders <forwarding_servers-section>`.
it: :ref:`Inoltratori DNS <forwarding_servers-section>`.

source: Configure the WAN interface::
it: Configurare l'interfaccia WAN::

source: Where ``<interface>`` is the name of the WAN interface (e.g., `wan`, `eth1`, etc.), Ensure you provide the virtual IP in CIDR notation (e.g., `192.168.1.100/24`) and the gateway IP. The script configures the interface on both nodes using fake IP addresses from the `169.254.x.0/24` range and sets up the virtual IP in `keepalived`.
it: Dove ``<interface>`` è il nome dell'interfaccia WAN (ad esempio, `wan`, `eth1`, ecc.), assicurarsi di fornire l'IP virtuale in notazione CIDR (ad esempio, `192.168.1.100/24`) e l'IP del gateway. Lo script configura l'interfaccia su entrambi i nodi utilizzando indirizzi IP fittizi dalla gamma `169.254.x.0/24` e imposta l'IP virtuale in `keepalived`.

source: Verify the configuration
it: Verificare la configurazione

source: The cluster is now ready to be used. You can check the status of the cluster and verify that the configuration is correct.
it: Il cluster è ora pronto per essere utilizzato. È possibile verificare lo stato del cluster e controllare che la configurazione sia corretta.

source: Verify current configuration: ::
it: Verificare la configurazione attuale: ::

source: Check the status of the HA cluster. The first sync may take up to 5 minutes. ::
it: Verificare lo stato del cluster HA. La prima sincronizzazione può richiedere fino a 5 minuti. ::

source: Initial status might show `Last Sync Status: SSH Connection Failed`. After sync, it should show `Last Sync Status: Up to Date`.
it: Lo stato iniziale potrebbe mostrare `Last Sync Status: SSH Connection Failed`. Dopo la sincronizzazione, dovrebbe mostrare `Last Sync Status: Up to Date`.

source: Additional interfaces
it: Interfacce aggiuntive

source: It's possible to add additional interfaces to the HA cluster after the initial setup. Before adding an interface, ensure that the interface is configured with a static IP address on the primary node and on the secondary node, much like the LAN interface configured during the initial setup. Interfaces can be ethernets, bridges, VLANs, or bonds. Please note that VLANs over logical interfaces are not supported.
it: È possibile aggiungere interfacce aggiuntive al cluster HA dopo la configurazione iniziale. Prima di aggiungere un'interfaccia, assicurarsi che l'interfaccia sia configurata con un indirizzo IP statico sia sul nodo primario che su quello secondario, analogamente a quanto fatto per l'interfaccia LAN durante la configurazione iniziale. Le interfacce possono essere di tipo ethernet, bridge, VLAN o bond. Si noti che le VLAN su interfacce logiche non sono supportate.

source: You can use this command to add any non-WAN interface, like a second LAN, DMZ or GUEST interface to the HA cluster.
it: È possibile utilizzare questo comando per aggiungere qualsiasi interfaccia non-WAN, come una seconda LAN, DMZ o un'interfaccia GUEST, al cluster HA.

source: Add additional interfaces as needed::
it: Aggiungere interfacce aggiuntive secondo necessità::

source: The following checks are performed:
it: Vengono eseguiti i seguenti controlli:

source: virtual IP address must be in CIDR notation (e.g., `192.168.100.1/24`)
it: l'indirizzo IP virtuale deve essere in notazione CIDR (ad esempio, ``192.168.100.1/24``)

source: make sure a device with given static IP address exists on the node
it: verificare che un dispositivo con l'indirizzo IP statico specificato esista sul nodo

source: If DHCP server is running, the following
it: Se il server DHCP è in esecuzione, quanto segue

source: Example: ::
it: Esempio: ::

source: Hotspot support
it: Supporto hotspot

source: The hotspot feature is supported in HA clusters, but there are important requirements:
it: La funzionalità hotspot è supportata nei cluster HA, ma ci sono requisiti importanti:

source: The backup node must have the exact same network devices as the primary node. For example, if the primary node has a VLAN interface named ``eth1.1``, the backup node must also have a ``eth1.1`` interface with the same name and configuration. If the interfaces do not match, the hotspot will not function correctly after a failover.
it: Il nodo di backup deve avere esattamente gli stessi dispositivi di rete del nodo primario. Ad esempio, se il nodo primario ha un'interfaccia VLAN chiamata ``eth1.1``, anche il nodo di backup deve avere un'interfaccia ``eth1.1`` con lo stesso nome e la stessa configurazione. Se le interfacce non corrispondono, l'hotspot non funzionerà correttamente dopo un failover.

source: The hotspot can only operate on a physical interface or a VLAN interface.
it: L'hotspot può funzionare solo su un'interfaccia fisica o su un'interfaccia VLAN.

source: To maintain hotspot functionality during failover, the MAC address of the interface running the hotspot on the primary node is automatically copied to the corresponding interface on the backup node when a switchover occurs.
it: Per mantenere la funzionalità dell'hotspot durante il failover, l'indirizzo MAC dell'interfaccia che esegue l'hotspot sul nodo primario viene automaticamente copiato sull'interfaccia corrispondente del nodo di backup quando si verifica uno switchover.

source: Note that active sessions are stored in RAM and will be lost during a switchover; clients must re-authenticate unless auto-login is enabled.
it: Si noti che le sessioni attive sono memorizzate nella RAM e andranno perse durante uno switchover; i client dovranno autenticarsi nuovamente a meno che l'accesso automatico non sia abilitato.

source: Network aliases
it: Alias di rete

source: You can add IP aliases to the primary node on relevant interfaces. This is useful for services that require multiple IP addresses on the same interface, such as virtual servers or load balancing. First, on the primary node, access the web interface and add the alias to the network interface.
it: È possibile aggiungere alias IP al nodo primario sulle interfacce rilevanti. Questo è utile per i servizi che richiedono più indirizzi IP sulla stessa interfaccia, come i server virtuali o il bilanciamento del carico. Per prima cosa, sul nodo primario, accedere all'interfaccia web e aggiungere l'alias all'interfaccia di rete.

source: Then, use the `ns-ha-config` command to register the alias in the HA cluster configuration.
it: Quindi, utilizzare il comando `ns-ha-config` per registrare l'alias nella configurazione del cluster HA.

source: Aliases must be explicitly set on the primary node. ::
it: Gli alias devono essere impostati esplicitamente sul nodo primario. ::

source: Example of a WAN alias: ::
it: Esempio di un alias WAN: ::

source: **Note:** the alias will not appear in the network configuration page of the backup node.
it: **Nota:** l'alias non apparirà nella pagina di configurazione di rete del nodo di backup.

source: Remove interfaces and aliases
it: Rimuovere interfacce e alias

source: Remove an interface from HA configuration: ::
it: Rimuovere un'interfaccia dalla configurazione HA: ::

source: This removes the interface from `keepalived` and from the backup node's network configuration. Also, the virtual IP address associated with the interface will be moved to the network interface of the primary node.
it: Questo rimuove l'interfaccia da `keepalived` e dalla configurazione di rete del nodo di backup. Inoltre, l'indirizzo IP virtuale associato all'interfaccia verrà spostato sull'interfaccia di rete del nodo primario.

source: Remove an alias from HA configuration: ::
it: Rimuovere un alias dalla configurazione di HA: ::

source: This removes the alias from `keepalived` but not from the backup node's network configuration. Then, proceed to remove the alias using the primary node's web interface.
it: Questo rimuove l'alias da `keepalived` ma non dalla configurazione di rete del nodo di backup. Successivamente, procedere a rimuovere l'alias utilizzando l'interfaccia web del nodo primario.

source: Configuration example
it: Esempio di configurazione

source: Assuming:
it: Supponendo:

source: Primary Node LAN IP: `192.168.100.238`
it: IP LAN del nodo primario: ``192.168.100.238``

source: Backup Node LAN IP: `192.168.100.239`
it: IP LAN del nodo di backup: ``192.168.100.239``

source: LAN Virtual IP: `192.168.100.240/24`
it: IP virtuale LAN: ``192.168.100.240/24``

source: WAN Interface: `wan` (e.g., `eth1`)
it: Interfaccia WAN: ``wan`` (ad es., ``eth1``)

source: WAN Virtual IP: `192.168.122.49/24`
it: IP virtuale WAN: ``192.168.122.49/24``

source: WAN Gateway: `192.168.122.1`
it: Gateway WAN: ``192.168.122.1``

source: Backup Node Root Password: `backup_root_password`
it: Password root del nodo di backup: ``backup_root_password``

source: Execute the following commands on the **primary node**:
it: Eseguire i seguenti comandi sul **nodo primario**:

source: Check requirements and initialize: ::
it: Verificare i requisiti e inizializzare: ::

source: Add WAN interface: ::
it: Aggiungere interfaccia WAN: ::

source: Alerting
it: Avvisi

source: Subscription required
it: Subscription richiesta

source: This feature is available only if the firewall and the controller have a valid subscription.
it: Questa funzionalità è disponibile solo se il firewall e il controller dispongono di una subscription valida.

source: The HA cluster provides automated monitoring and notifications to help administrators respond quickly to failover events or synchronization issues.
it: Il cluster HA fornisce monitoraggio e notifiche automatiche per aiutare gli amministratori a rispondere rapidamente a eventi di failover o a problemi di sincronizzazione.

source: The following alerts are available:
it: I seguenti avvisi sono disponibili:

source: **ha:sync:failed**: Triggered when the configuration synchronization between primary and backup nodes fails. This usually indicates that the backup node is unreachable due to network issues, hardware failure, or service interruption.
it: **ha:sync:failed**: Attivato quando la sincronizzazione della configurazione tra il nodo primario e quello di backup fallisce. Questo di solito indica che il nodo di backup non è raggiungibile a causa di problemi di rete, guasto hardware o interruzione del servizio.

source: **ha:primary:failed**: Triggered during failover events when the primary node becomes unavailable.
it: **ha:primary:failed**: Attivato durante eventi di failover quando il nodo primario diventa non disponibile.

source: Maintenance
it: Manutenzione

source: The HA cluster is designed to be highly available and requires minimal maintenance. However, there are times when you may need to perform maintenance on either the primary or backup node.
it: Il cluster HA è progettato per essere altamente disponibile e richiede una manutenzione minima. Tuttavia, ci sono situazioni in cui potrebbe essere necessario eseguire operazioni di manutenzione sia sul nodo primario che su quello di backup.

source: Backup node
it: Nodo di backup

source: The backup node can be switched off for maintenance without affecting the primary node.
it: Il nodo di backup può essere spento per la manutenzione senza influire sul nodo primario.

source: Stop `keepalived` on the **backup node**: ::
it: Arrestare `keepalived` sul **nodo di backup**: ::

source: Perform maintenance.
it: Eseguire la manutenzione.

source: Start `keepalived` on the **backup node**: ::
it: Avviare `keepalived` sul **nodo di backup**: ::

source: Primary node
it: Nodo primario

source: The primary node can be switched off for maintenance, the backup node will take over the virtual IP addresses and all services.
it: Il nodo primario può essere spento per la manutenzione; il nodo di backup assumerà gli indirizzi IP virtuali e tutti i servizi.

source: Stop `keepalived` on the **primary node**: ::
it: Arrestare `keepalived` sul **nodo primario**: ::

source: Start `keepalived` on the **primary node**: ::
it: Avviare `keepalived` sul **nodo primario**: ::

source: Remote access
it: Accesso remoto

source: The primary node is accessible both from the LAN and WAN interfaces. Therefore, the backup node is accessible from the LAN interface only. When connecting to the backup node from a remote network, you need to access the primary node first and then connect to the backup node using SSH.
it: Il nodo primario è accessibile sia dalle interfacce LAN che WAN. Pertanto, il nodo di backup è accessibile solo dall'interfaccia LAN. Quando si effettua una connessione al nodo di backup da una rete remota, è necessario accedere prima al nodo primario e poi collegarsi al nodo di backup utilizzando SSH.

source: After connecting to the primary node, use the following command to access the backup node: ::
it: Dopo essersi connessi al nodo primario, utilizzare il seguente comando per accedere al nodo di backup: ::

source: This command will establish an SSH connection to the backup node using the SSH key generated during the HA setup.
it: Questo comando stabilirà una connessione SSH al nodo di backup utilizzando la chiave SSH generata durante la configurazione dell'HA.

source: Upgrade
it: Aggiorna

source: The backup node does not receive system updates automatically because it does not have direct Internet access. To update the backup node, you need to connect to the primary node and run the update command on the backup node: ::
it: Il nodo di backup non riceve aggiornamenti di sistema automaticamente perché non ha accesso diretto a Internet. Per aggiornare il nodo di backup, è necessario connettersi al nodo primario ed eseguire il comando di aggiornamento sul nodo di backup: ::

source: This command will download the latest image, upload it to the backup node, and install it. As a normal upgrade, the backup node will reboot after the installation.
it: Questo comando scaricherà l'immagine più recente, la caricherà sul nodo di backup e la installerà. Come per un normale aggiornamento, il nodo di backup verrà riavviato dopo l'installazione.

source: Troubleshooting
it: Risoluzione dei problemi

source: Troubleshooting the HA setup can be challenging, especially if the backup node is not reachable or the primary node is not responding as expected.
it: La risoluzione dei problemi della configurazione HA può essere complessa, soprattutto se il nodo di backup non è raggiungibile o se il nodo primario non risponde come previsto.

source: Remember the backup node does not have direct internet access in its normal standby state. Therefore:
it: Ricordare che il nodo di backup non ha accesso diretto a Internet nel suo normale stato di standby. Pertanto:

source: It cannot resolve external DNS names.
it: Non è in grado di risolvere nomi DNS esterni.

source: It cannot reach the Controller or other external portals.
it: Non è possibile raggiungere il Controller o altri portali esterni.

source: It will not receive system updates.
it: Non riceverà aggiornamenti di sistema.

source: The following instructions can help you identify and resolve common issues. To start troubleshooting, you need to access the SSH console of both nodes.
it: Le seguenti istruzioni possono aiutare a identificare e risolvere i problemi comuni. Per iniziare la risoluzione dei problemi, è necessario accedere alla console SSH di entrambi i nodi.

source: Identifying the nodes
it: Identificazione dei nodi

source: Since the backup node hostname syncs with the primary, the bash prompt changes to indicate the node's role:
it: Poiché l'hostname del nodo di backup si sincronizza con quello del nodo primario, il prompt di bash cambia per indicare il ruolo del nodo:

source: Primary node prompt: ``root@NethSec [P]:~#``
it: Prompt del nodo primario: ``root@NethSec [P]:~#``

source: Backup node prompt: ``root@NethSec [B]:~#``
it: Prompt del nodo di backup: ``root@NethSec [B]:~#``

source: Keepalived status
it: Stato di Keepalived

source: Execute ``ns-ha-config status`` to check Keepalived statistics. Extract from the output: ``` Keepalived Statistics:
it: Eseguire ``ns-ha-config status`` per verificare le statistiche di Keepalived. Estratto dall'output: ``` Statistiche di Keepalived: ```
