Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/hotspot.po
Languages: it

source: Hotspot main goal is to provide internet connectivity via wi-fi to casual users. Users are sent to a captive portal from which they can access the network by authenticating themselves via social login, sms, email or a voucher code. The hotspot service allows the regulation, accountability and pricing of Internet access in public places, like squares, hotels, stations and many others.
it: L'obiettivo principale dell'Hotspot è fornire connettività Internet tramite wi-fi agli utenti occasionali. Gli utenti vengono reindirizzati a un captive portal dal quale possono accedere alla rete autenticandosi tramite social login, sms, email o un codice voucher. Il servizio hotspot consente la regolamentazione, la tracciabilità e la tariffazione dell'accesso a Internet in luoghi pubblici, come piazze, hotel, stazioni e molti altri.

source: Main features
it: Funzionalità principali

source: Network isolation between corporate and guests
it: Isolamento della rete tra azienda e ospiti

source: Customizable captive portal page
it: Pagina del captive portal personalizzabile

source: Many authentication modes supported (Social Login, SMS, Email or Voucher code)
it: Sono supportate molte modalità di autenticazione (Social Login, SMS, Email o codice Voucher)

source: AutoLogin support
it: Supporto AutoLogin

source: Hotspot manager with different accesses type (admin, customer, desk)
it: Gestore hotspot con diversi tipi di accesso (admin, cliente, desk)

source: Export of accounts and connections report
it: Esportazione del report di account e connessioni

source: How it works?
it: Come funziona?

source: The implementation is based on 2 components:
it: L'implementazione si basa su 2 componenti:

source: A hotspot manager section running on a cloud server, a dedicated WebUI allows you to perform tasks as:
it: Una sezione del gestore hotspot in esecuzione su un server cloud, una WebUI dedicata consente di eseguire attività quali:

source: create a hotspot instance: usually each instance is referred to a specific location (e.g. Art Cafè, Ritz Hotel and so on)
it: creare un'istanza hotspot: di solito ogni istanza fa riferimento a una posizione specifica (ad esempio, Art Cafè, Ritz Hotel e così via)

source: edit the captive portal page
it: modificare la pagina del captive portal

source: choose what type of login to use
it: scegliere quale tipo di accesso utilizzare

source: see session and users logged
it: vedere sessione e utenti connessi

source: A client part running on NethSecurity (in nethspot terminology this client is called "unit") .
it: Una parte client in esecuzione su NethSecurity (in terminologia nethspot questo client è chiamato "unità").

source: It has to be physically connected to the Access Points network
it: Deve essere fisicamente connesso alla rete degli Access Points

source: It assigns IP addresses to devices
it: Assegna indirizzi IP ai dispositivi

source: It redirects devices to the captive portal
it: Reindirizza i dispositivi al captive portal

source: This manual only cover the client part. If you're interested on the hotspot manager section please refer to `Icaro project <https://nethesis.github.io/icaro>`_ if you want to create your own instance of Icaro or contact info@nethesis.it if you want to use SaaS provided by Nethesis and located at `my.nethspot.com <https://my.nethspot.com>`_.
it: Questo manuale copre solo la parte client. Se si è interessati alla sezione hotspot manager, fare riferimento al `progetto Icaro <https://nethesis.github.io/icaro>`_ per creare una propria istanza di Icaro oppure contattare info@nethesis.it se si desidera utilizzare il servizio SaaS fornito da Nethesis e disponibile su `my.nethspot.com <https://my.nethspot.com>`_.

source: Status
it: Stato

source: This section shows all users connected to the system, distinguishing those who have authenticated from those who have simply received an IP address, it provides further information such as MAC address, traffic carried out and so on. More detailed informations are available in the hotspot manager.
it: Questa sezione mostra tutti gli utenti connessi al sistema, distinguendo tra coloro che si sono autenticati e coloro che hanno semplicemente ricevuto un indirizzo IP; vengono fornite ulteriori informazioni come l'indirizzo MAC, il traffico effettuato e così via. Informazioni più dettagliate sono disponibili nel gestore hotspot.

source: Settings
it: Impostazioni

source: This section allows you to associate a unit with a specific hotspot instance created in the hotspot manager.
it: Questa sezione consente di associare un'unità a una specifica istanza di hotspot creata nel gestore degli hotspot.

source: Before associating the unit you must create an instance in the hotspot manager.
it: Prima di associare l'unità è necessario creare un'istanza nel gestore degli hotspot.

source: Multiple geographically separated units (NethSecurity) can be connected to the same centralized hotspot instance, creating a conference in which all users access the same captive portal and in which they can reuse the same login in all connected units.
it: Più unità geograficamente separate (NethSecurity) possono essere collegate alla stessa istanza centralizzata di hotspot, creando una conferenza in cui tutti gli utenti accedono allo stesso captive portal e possono riutilizzare le stesse credenziali di accesso in tutte le unità collegate.

source: Login to your hotspot manager
it: Accedere al proprio gestore hotspot

source: This operation is mandatory to associate your unit with the created hotspot instance, use the same user and password of your hotspot manager, the ``Hostname`` field at default points to my.nethspot.com.
it: Questa operazione è obbligatoria per associare l'unità all'istanza hotspot creata; utilizzare lo stesso utente e la stessa password del proprio hotspot manager. Il campo ``Nome host`` per impostazione predefinita punta a my.nethspot.com.

source: Once you have logged in you can continue to fill in the following fields. This login access will remain active for 24 hours without any need to login again.
it: Una volta effettuato l'accesso, è possibile continuare a compilare i seguenti campi. Questo accesso rimarrà attivo per 24 ore senza la necessità di effettuare nuovamente il login.

source: Register your unit
it: Registrare l'unità

source: ``Parent Hotspot`` : choose which instance you want to connect your unit to
it: ``Hotspot parent`` : scegliere a quale istanza si desidera collegare l'unità

source: ``Unit name`` : your NethSecurity's name
it: ``Nome unità`` : il nome del proprio NethSecurity

source: ``Unit description`` : insert a brief description so that you can identify your unit more easily
it: ``Descrizione unità`` : inserire una breve descrizione per identificare più facilmente l'unità

source: ``Network device`` : Specify a network device to be used by the hotspot service. The device can be either physical or a VLAN; however, it is crucial that the device is not already configured. The UI will display all currently available options and the hotspot will intercept all connections on this network interface, enforcing authentication for connected clients.
it: ``Dispositivo di rete`` : Specificare un dispositivo di rete da utilizzare per il servizio hotspot. Il dispositivo può essere sia fisico che una VLAN; tuttavia, è fondamentale che il dispositivo non sia già configurato. L'interfaccia utente mostrerà tutte le opzioni attualmente disponibili e l'hotspot intercetterà tutte le connessioni su questa interfaccia di rete, imponendo l'autenticazione per i client connessi.

source: ``Network address`` : clients will receive an IP address belonging to this network (use CIDR format). The first address of the network class is always assigned to the NethSecurity hotspot interface. The total number of clients that can be managed at the same time depends on the DHCP range you specified. If you need to provide hotspot service for more than 253 devices, consider using a larger netmask (/23 or /22 or even larger) and be sure to have an appropriate range.
it: ``Indirizzo di rete`` : i client riceveranno un indirizzo IP appartenente a questa rete (utilizzare il formato CIDR). Il primo indirizzo della classe di rete viene sempre assegnato all'interfaccia hotspot di NethSecurity. Il numero totale di client che possono essere gestiti contemporaneamente dipende dall'intervallo DHCP specificato. Se è necessario fornire il servizio hotspot per più di 253 dispositivi, considerare l'utilizzo di una netmask più ampia (/23 o /22 o anche superiore) e assicurarsi di avere un intervallo appropriato.

source: ``DHCP limit`` : by default, the system uses the entire network range. However, you can define a more specific range by adjusting the maximum number of leases. The first address of DHCP range is automatically calculated
it: ``Limite DHCP`` : per impostazione predefinita, il sistema utilizza l'intera gamma della rete. Tuttavia, è possibile definire un intervallo più specifico regolando il numero massimo di lease. Il primo indirizzo dell'intervallo DHCP viene calcolato automaticamente.

source: After having fulfilled the form click :guilabel:`Save` button to register the unit.
it: Dopo aver compilato il modulo, fare clic sul pulsante :guilabel:`Salva` per registrare l'unità.

source: Please verify in the hotspot manager-> Units that your unit has been properly registered. Each properly registered unit must show its MAC address in the hotspot manager. If the MAC address is missing please unregister the unit and try to do the registration again.
it: Verificare in Hotspot manager -> Units che l'unità sia stata registrata correttamente. Ogni unità registrata correttamente deve mostrare il proprio indirizzo MAC nel Hotspot manager`. Se l'indirizzo MAC è assente, annullare la registrazione dell'unità e ripetere la procedura di registrazione.

source: Unregister your unit
it: Annullare la registrazione dell'unità

source: If you made some error registering your unit (es. unit was associated to a wrong hotspot instance) or you want to remove this service, do the login in the hotspot section of NethSecurity and click to :guilabel:`Unregister unit`. Your unit will be removed both from the NethSecurity and from the remote hotspot manager, the interface used in your Nethsecurity will be freed up and you can use it for other purposes.
it: Se è stato commesso un errore durante la registrazione dell'unità (ad esempio, l'unità è stata associata a un'istanza hotspot errata) oppure si desidera rimuovere questo servizio, effettuare l'accesso nella sezione hotspot di NethSecurity e fare clic su :guilabel:`Rimuovi registrazione unità hotspot`. L'unità verrà rimossa sia da NethSecurity sia dal gestore hotspot remoto, l'interfaccia utilizzata in NethSecurity verrà liberata e potrà essere utilizzata per altri scopi.

source: Change DNS settings
it: Modificare le impostazioni DNS

source: By default the DNS server used by the hotspot is from OpenDNS, to change the DNS settings manual configuration is required. Please follow the steps below from the terminal:
it: Per impostazione predefinita, il server DNS utilizzato dall'hotspot è quello di OpenDNS; per modificare le impostazioni DNS è necessaria una configurazione manuale. Seguire i passaggi riportati di seguito dal terminale:

source: Edit the UCI configuration file with the following commands:
it: Modificare il file di configurazione UCI con i seguenti comandi:

source: Save the changes with the following command:
it: Salvare le modifiche con il seguente comando:

source: Restart the dedalo service with:
it: Riavviare il servizio dedalo con:

source: Restore default DNS settings
it: Ripristinare le impostazioni DNS predefinite

source: To restore the default DNS settings, use the following commands:
it: Per ripristinare le impostazioni DNS predefinite, utilizzare i seguenti comandi:

source: Then repeat the steps 2 and 3 in the previous section to apply the changes.
it: Quindi ripetere i passaggi 2 e 3 della sezione precedente per applicare le modifiche.
