Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/index.po
Languages: it

source: About
it: Informazioni

source: Installation
it: Installazione

source: System
it: Sistema

source: Network
it: Rete

source: Users and objects
it: Utenti e oggetti

source: Security
it: Sicurezza

source: Advanced (CLI)
it: Avanzate (CLI)

source: Best practices
it: Best practice

source: NethSecurity administrator manual
it: Manuale dell'amministratore di NethSecurity

source: `Official site <https://www.nethsecurity.org>`_
it: `Sito ufficiale <https://www.nethsecurity.org>`_

source: `Developer manual <https://nethserver.github.io/nethsecurity/>`_
it: `Manuale sviluppatori <https://nethserver.github.io/nethsecurity/>`_

source: Help on `Community <http://community.nethserver.org>`_
it: Aiuto su `Community <http://community.nethserver.org>`_

source: External links
it: Collegamenti esterni

source: High Availability
it: Alta disponibilit√†
