Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/install.po
Languages: it

source: Installation
it: Installazione

source: To begin the installation process, start by :ref:`downloading <download-section>` the latest image. Once the download is complete, you have two methods to install NethSecurity:
it: Per iniziare il processo di installazione, per prima cosa :ref:`scaricare <download-section>` l'immagine più recente. Una volta completato il download, sono disponibili due metodi per installare NethSecurity:

source: Direct disk installation: write the downloaded image directly to your computer's disk. This method allows for a straightforward installation process directly onto your system's storage.
it: Installazione diretta su disco: scrivere l'immagine scaricata direttamente sul disco del computer. Questo metodo consente un processo di installazione semplice e diretto sul dispositivo di memorizzazione.

source: USB boot installation: alternatively, you can create a bootable USB stick using the downloaded image. Boot the system from the USB stick and type a command to initiate the installation process.
it: Installazione tramite avvio da USB: in alternativa, è possibile creare una chiavetta USB avviabile utilizzando l'immagine scaricata. Avviare il sistema dalla chiavetta USB e digitare un comando per avviare il processo di installazione.

source: Choose the method that best suits your needs and proceed with the installation process for NethSecurity.
it: Scegliere il metodo che meglio si adatta alle proprie esigenze e procedere con il processo di installazione di NethSecurity.

source: Install on bare metal
it: Installazione su bare metal

source: NethSecurity can be run from a USB stick or installed directly to any bootable device like hard disks or SD cards.
it: NethSecurity può essere eseguito da una chiavetta USB o installato direttamente su qualsiasi dispositivo avviabile come dischi rigidi o schede SD.

source: attach the target disk/stick/card to a desktop Linux machine
it: collegare il disco/chiavetta/scheda di destinazione a una macchina Linux desktop

source: find the disk/stick/card device name, in this example the device is named ``/dev/sdd``
it: trovare il nome del dispositivo disco/chiavetta/scheda, in questo esempio il dispositivo è denominato ``/dev/sdd``

source: as ``root`` user, write the downloaded image to the device:
it: come utente ``root``, scrivere l'immagine scaricata sul dispositivo:

source: unplug the disk/stick/card from the desktop and plug it into the server
it: scollegare il disco/chiavetta/scheda dal desktop e collegarlo al server

source: boot the server, select the correct device (USB, SD card or hard disk) from boot menu
it: avviare il server, selezionare il dispositivo corretto (USB, scheda SD o disco rigido) dal menu di avvio

source: the server is installed and ready to be used
it: il server è installato ed è pronto per essere utilizzato

source: Writing the image on Windows
it: Scrittura dell'immagine su Windows

source: Writing the image on a Windows machine is not recommended because it may mess up the disk partitioning.
it: Scrivere l'immagine su una macchina Windows non è consigliato perché potrebbe compromettere la partizione del disco.

source: If you're running a desktop Windows machine, you will need extra software for point 2. First, make sure to format the USB drive then unmount it. Use one of the following tools to write the USB stick:
it: Se si utilizza una macchina desktop Windows, sarà necessario un software aggiuntivo per il punto 2. Prima di tutto, assicurarsi di formattare l'unità USB e poi smontarla. Utilizzare uno dei seguenti strumenti per scrivere sulla chiavetta USB:

source: Install from USB to disk
it: Installare da USB su disco

source: connect to the server using VGA, serial console or SSH
it: connettersi al server utilizzando VGA, console seriale o SSH

source: login with :ref:`default credentials <default_credentials-section>`
it: accedere con :ref:`credenziali predefinite <default_credentials-section>`

source: execute ``ns-install`` and follow the instructions
it: Eseguire ``ns-install`` e seguire le istruzioni

source: The firewall will be halted at the end of the installation. Once the firewall has been shutdown, you can safely remove the USB stick and boot the server again.
it: Il firewall verrà arrestato al termine dell'installazione. Una volta che il firewall è stato spento, è possibile rimuovere in sicurezza la chiavetta USB e riavviare nuovamente il server.

source: Install on virtual machines
it: Installazione su macchine virtuali

source: You can use the downloaded image as a virtual machine disk:
it: È possibile utilizzare l'immagine scaricata come disco per una macchina virtuale:

source: extract the downloaded image:
it: estrarre l'immagine scaricata:

source: create a new virtual machine and select the uncompressed image as disk
it: creare una nuova macchina virtuale e selezionare l'immagine non compressa come disco

source: boot the virtual machine
it: avviare la macchina virtuale

source: If you wish to save the logs locally, it is recommended to attach an additional virtual hard drive to the virtual machine and select it as the destination for logs in the ``Storage`` page under the ``System`` section.
it: Se si desidera salvare i log localmente, è consigliato collegare un disco rigido virtuale aggiuntivo alla macchina virtuale e selezionarlo come destinazione per i log nella pagina ``Storage`` sotto la sezione ``Sistema``.

source: Install on Proxmox
it: Installazione su Proxmox

source: The image can be imported inside `Proxmox <https://www.proxmox.com/>`_.
it: L'immagine può essere importata all'interno di `Proxmox <https://www.proxmox.com/>`_.

source: First, make sure to have 2 different network bridges. In this example we are going to use ``vmbr0`` and ``vmbr1``. The described procedure can be also done using the Proxmox UI.
it: Per prima cosa, assicurarsi di avere 2 bridge di rete differenti. In questo esempio verranno utilizzati ``vmbr0`` e ``vmbr1``. La procedura descritta può essere eseguita anche tramite l'interfaccia utente di Proxmox.

source: Create the virtual machine, in this example the machine will have id ``401``::
it: Creare la macchina virtuale, in questo esempio la macchina avrà l'id ``401``::

source: Download the image:
it: Scaricare l'immagine:

source: Extract the image:
it: Estrarre l'immagine:

source: Import the extracted images a virtual machine disk:
it: Importare le immagini estratte come disco della macchina virtuale:

source: Attach the disk to the virtual machine: ::
it: Collegare il disco alla macchina virtuale: ::

source: Setup the boot order: ::
it: Impostare l'ordine di avvio: ::

source: Finally, start the virtual machine.
it: Infine, avviare la macchina virtuale.

source: QEMU guest agent
it: Agente guest QEMU

source: QEMU guest agent is not part of the NethSecurity image but can be installed from the command line. The agent can work when the virtual machine is running on KVM, Proxmox, or other QEMU-based hypervisors.
it: L'agente guest QEMU non fa parte dell'immagine NethSecurity ma può essere installato dalla riga di comando. L'agente può funzionare quando la macchina virtuale è in esecuzione su KVM, Proxmox o altri hypervisor basati su QEMU.

source: First, make sure the virtual machine is running, then connect to the machine using SSH or the Proxmox console and execute the following commands: ::
it: Per prima cosa, assicurarsi che la macchina virtuale sia in esecuzione, quindi connettersi alla macchina utilizzando SSH o la console di Proxmox ed eseguire i seguenti comandi: ::

source: After the installation, start the service: ::
it: Dopo l'installazione, avviare il servizio: ::

source: The QEMU guest agent will be available on the virtual machine and automatically started at boot.
it: Il QEMU guest agent sarà disponibile sulla macchina virtuale e verrà avviato automaticamente all'avvio.

source: Please note that after an image upgrade the QEMU guest agent will be removed and you will need to reinstall it. See :ref:`restore_extra_packages-section` for more info.
it: Si noti che dopo un aggiornamento dell'immagine il QEMU guest agent verrà rimosso e sarà necessario reinstallarlo. Consultare :ref:`restore_extra_packages-section` per ulteriori informazioni.

source: Install on VMWare
it: Installazione su VMWare

source: `VMWare <https://www.vmware.com>`_ may encounter issues when importing raw disk images directly. To ensure a smooth import, first decompress the image file, then convert the raw image to the VMWare native ``.vmdk`` format before proceeding.
it: `VMWare <https://www.vmware.com>`_ può riscontrare problemi durante l'importazione diretta di immagini disco raw. Per garantire un'importazione senza problemi, decomprimere prima il file immagine, quindi convertire l'immagine raw nel formato nativo ``.vmdk`` di VMWare prima di procedere.

source: On Windows, you can use a software like `V2V Converter <https://www.starwindsoftware.com/starwind-v2v-converter>`_.
it: Su Windows, è possibile utilizzare un software come `V2V Converter <https://www.starwindsoftware.com/starwind-v2v-converter>`_.

source: On Linux you can use the ``qemu-img`` command. Example: ::
it: Su Linux è possibile utilizzare il comando ``qemu-img``. Esempio: ::

source: Replace:
it: Sostituire:

source: ``<source_image.raw>`` with the actual path to your raw disk image
it: ``<source_image.raw>`` con il percorso effettivo della propria immagine disco raw

source: ``<destination_image.vmdk>`` with your desired .vmdk filename
it: ``<destination_image.vmdk>`` con il nome file .vmdk desiderato

source: VMware open-vm-tools are not part of the NethSecurity image but can be installed from the command line. The tools can work only when the virtual machine is running on VMWare hypervisors.
it: Gli open-vm-tools di VMware non fanno parte dell'immagine di NethSecurity, ma possono essere installati dalla riga di comando. Gli strumenti funzionano solo quando la macchina virtuale è in esecuzione su hypervisor VMware.

source: First make sure the virtual machine is running, then connect to the machine using SSH or the VMWare console and execute the following commands: ::
it: Per prima cosa, assicurarsi che la macchina virtuale sia in esecuzione, quindi connettersi alla macchina utilizzando SSH o la console VMWare ed eseguire i seguenti comandi: ::

source: The VMware open-vm-tools will be available on the virtual machine and automatically started at boot.
it: Gli open-vm-tools di VMware saranno disponibili sulla macchina virtuale e verranno avviati automaticamente all'avvio.

source: Please note that after an image upgrade the VMware open-vm-tools will be removed and you will need to reinstall it. See :ref:`restore_extra_packages-section` for more info.
it: Si noti che dopo un aggiornamento dell'immagine, il pacchetto VMware open-vm-tools verrà rimosso e sarà necessario reinstallarlo. Consultare :ref:`restore_extra_packages-section` per ulteriori informazioni.

source: Install on Hyper-V
it: Installazione su Hyper-V

source: To ensure a smooth import on HYper-V, first decompress the image file, then convert the raw image to the Hyper-V native ``.vhdx`` format before proceeding.
it: Per garantire un'importazione senza problemi su Hyper-V, decomprimere prima il file immagine, quindi convertire l'immagine raw nel formato nativo di Hyper-V ``.vhdx`` prima di procedere.

source: ``<destination_image.vhdx>`` with your desired .vhdx filename
it: ``<destination_image.vhdx>`` con il nome file .vhdx desiderato

source: Install on VirtualBox
it: Installazione su VirtualBox

source: `VirtualBox <https://www.virtualbox.org>`_ may encounter issues when importing raw disk images directly. To ensure a smooth import, first decompress the image file, then convert the raw image to the VirtualBox native ``.vdi`` format before proceeding.
it: `VirtualBox <https://www.virtualbox.org>`_ può riscontrare problemi durante l'importazione diretta di immagini disco raw. Per garantire un'importazione senza problemi, decomprimere prima il file immagine, quindi convertire l'immagine raw nel formato nativo ``.vdi`` di VirtualBox prima di procedere.

source: On Windows, Linux and macOS you can use the built-in `VBoxManage` tool. Example: ::
it: Su Windows, Linux e macOS è possibile utilizzare lo strumento integrato `VBoxManage`. Esempio: ::

source: ``<destination_image.vdi>`` with your desired .vdi filename
it: ``<destination_image.vdi>`` con il nome file .vdi desiderato

source: Default network configuration
it: Configurazione di rete predefinita

source: When you first boot NethSecurity, the system will try to configure the network interfaces.
it: Al primo avvio di NethSecurity, il sistema tenterà di configurare le interfacce di rete.

source: By default, the network configuration will be as follows:
it: Per impostazione predefinita, la configurazione di rete sarà la seguente:

source: The LAN interface will be configured with a static IP address of 192.168.1.1.
it: L'interfaccia LAN verrà configurata con un indirizzo IP statico di 192.168.1.1.

source: The WAN interface will be configured to use DHCP to obtain an IP address from your ISP.
it: L'interfaccia WAN sarà configurata per utilizzare DHCP al fine di ottenere un indirizzo IP dal proprio ISP.

source: An exception to this default network configuration is virtual machines running on KVM and on Digital Ocean cloud provider (droplet). In this case, the network configuration will be as follows:
it: Un'eccezione a questa configurazione di rete predefinita riguarda le macchine virtuali in esecuzione su KVM e sul provider cloud Digital Ocean (droplet). In questo caso, la configurazione di rete sarà la seguente:

source: The LAN interface will be configured to use DHCP to obtain an IP address from the virtualization platform.
it: L'interfaccia LAN sarà configurata per utilizzare DHCP al fine di ottenere un indirizzo IP dalla piattaforma di virtualizzazione.

source: **Note:** If you are using NethSecurity in a production environment, you may need to modify the default network configuration to meet your specific needs. For example, you may need to configure the LAN interface with a different IP address or configure the WAN interface to use a static IP address.
it: **Nota:** Se si utilizza NethSecurity in un ambiente di produzione, potrebbe essere necessario modificare la configurazione di rete predefinita per soddisfare esigenze specifiche. Ad esempio, potrebbe essere necessario configurare l'interfaccia LAN con un indirizzo IP diverso oppure configurare l'interfaccia WAN per utilizzare un indirizzo IP statico.

source: The recommended installation method for NethSecurity is on internal storage, for reasons of robustness and performance. For this purpose, NethSecurity provides a specific command to install its contents from the USB stick onto the internal disk:
it: Il metodo di installazione raccomandato per NethSecurity è su memoria interna, per motivi di robustezza e prestazioni. A tal fine, NethSecurity fornisce un comando specifico per installare i suoi contenuti dalla chiavetta USB sul disco interno:

source: The USB stick should be used only for the initial installation of NethSecurity; any other use is strongly discouraged. To update NethSecurity or perform a factory reset, there are already documented options available via the web UI and the command-line console. In case the firewall access password is lost and you need to perform a factory reset, we recommend booting into failsafe mode and performing the reset from there, as described in the documentation (:ref:failsafe mode <failsafe-section>).
it: La chiavetta USB dovrebbe essere utilizzata solo per l'installazione iniziale di NethSecurity; qualsiasi altro uso è fortemente sconsigliato. Per aggiornare NethSecurity o eseguire un ripristino alle impostazioni di fabbrica, sono già disponibili opzioni documentate tramite l'interfaccia web e la console a riga di comando. Nel caso in cui si perda la password di accesso al firewall e sia necessario eseguire un ripristino alle impostazioni di fabbrica, si consiglia di avviare in modalità failsafe ed effettuare il ripristino da lì, come descritto nella documentazione (:ref:modalità failsafe <failsafe-section>).

source: The following virtual machine settings are known to work well with NethSecurity:
it: Le seguenti impostazioni della macchina virtuale sono note per funzionare bene con NethSecurity:

source: Guest OS: Other 5.x or later Linux
it: Sistema operativo guest: Altro Linux 5.x o successivo

source: SCSI Controller: VMWare Paravirtual
it: Controller SCSI: VMWare Paravirtual

source: Network Adapters: E1000
it: Adattatori di rete: E1000

source: Firmware: BIOS (not UEFI)
it: Firmware: BIOS (non UEFI)
