Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/introduction.po
Languages: it

source: Introduction
it: Introduzione

source: About NethSecurity
it: Informazioni su NethSecurity

source: NethSecurity is based on `OpenWrt <https://openwrt.org>`_, a popular Linux distribution for embedded devices. This gives it a number of advantages, including:
it: NethSecurity è basato su `OpenWrt <https://openwrt.org>`_, una popolare distribuzione Linux per dispositivi embedded. Questo offre numerosi vantaggi, tra cui:

source: flexibility: it can be installed on a wide range of hardware
it: flessibilità: può essere installato su un'ampia gamma di hardware

source: customization: it can be customized to meet the specific needs of each organization
it: personalizzazione: può essere personalizzato per soddisfare le esigenze specifiche di ciascuna organizzazione

source: community support: it benefits from the large and active `NethServer community <https://community.nethserver.org>`_
it: supporto della community: beneficia della grande e attiva `community NethServer <https://community.nethserver.org>`_

source: NethSecurity includes a variety of security features, including:
it: NethSecurity include una varietà di funzionalità di sicurezza, tra cui:

source: Firewall: NethSecurity's firewall provides stateful packet inspection and filtering to protect networks from unauthorized access
it: Firewall: il firewall di NethSecurity offre la stateful inspection dei pacchetti e il filtraggio per proteggere le reti da accessi non autorizzati

source: DNS content filtering: NethSecurity's content filtering feature blocks users from accessing inappropriate or malicious websites
it: Filtraggio dei contenuti DNS: la funzionalità di filtraggio dei contenuti di NethSecurity blocca l’accesso degli utenti a siti web inappropriati o dannosi

source: Deep Packet Inspection (DPI): NethSecurity uses Netifyd to perform DPI, which allows it to inspect the contents of packets and identify malicious or unwanted traffic
it: Deep Packet Inspection (DPI): NethSecurity utilizza Netifyd per eseguire la DPI, che consente di ispezionare il contenuto dei pacchetti e identificare il traffico dannoso o indesiderato.

source: `Icaro hotspot <https://nethesis.github.io/icaro/>`_: Iedalo hotspot is a captive portal solution that can be used to manage and authenticate users on wireless networks.
it: `Icaro hotspot <https://nethesis.github.io/icaro/>`_: Icaro hotspot è una soluzione di captive portal che può essere utilizzata per gestire e autenticare gli utenti sulle reti wireless.

source: In addition to these security features, NethSecurity also includes a number of other features, such as:
it: Oltre a queste funzionalità di sicurezza, NethSecurity include anche una serie di altre funzionalità, come:

source: quality of service (QoS): NethSecurity's QoS feature allows administrators to prioritize traffic and ensure that critical applications always have the bandwidth they need.
it: qualità del servizio (QoS): la funzionalità QoS di NethSecurity consente agli amministratori di dare priorità al traffico e garantire che le applicazioni critiche dispongano sempre della larghezza di banda necessaria.

source: IPv6 support: NethSecurity supports IPv6, the next-generation internet protocol
it: Supporto IPv6: NethSecurity supporta IPv6, il protocollo Internet di nuova generazione

source: Get support
it: Ottenere supporto

source: You want to know more or look for some help? Check out our great `community <https://community.nethserver.org>`_!
it: Vuoi saperne di più o cerchi aiuto? Dai un'occhiata alla nostra fantastica `community <https://community.nethserver.org>`_!

source: If you're looking for more technical details, take a look to the `developer manual <https://nethserver.github.io/nethsecurity/>`_.
it: Se si desiderano ulteriori dettagli tecnici, consultare il `manuale per sviluppatori <https://nethserver.github.io/nethsecurity/>`_.

source: Bugs can be discussed and reported inside the `community forum <https://community.nethserver.org>`_. A public issue tracker is available at `GitHub <https://github.com/NethServer/nethsecurity/issues>`_.
it: I bug possono essere discussi e segnalati all'interno del `forum della community <https://community.nethserver.org>`_. Un sistema pubblico di tracciamento delle segnalazioni è disponibile su `GitHub <https://github.com/NethServer/nethsecurity/issues>`_.

source: NethSecurity is an Unified Threat Management (UTM) solution that provides a comprehensive suite of security features, including firewall, content filtering, deep packet inspection (DPI) using Netifyd, hotspot, VPN, and an optional remote controller. It is designed to be easy to install and configure, making it a good choice for both small and medium-sized businesses (SMBs) as well as enterprise organizations.
it: NethSecurity è una soluzione di Unified Threat Management (UTM) che offre una suite completa di funzionalità di sicurezza, tra cui firewall, filtraggio dei contenuti, ispezione approfondita dei pacchetti (DPI) tramite Netifyd, hotspot, VPN e un controller remoto opzionale. È progettato per essere facile da installare e configurare, rendendola una scelta adatta sia per piccole e medie imprese (PMI) che per organizzazioni di livello enterprise.

source: VPN: OpenVPN, IPSec and Wireguard are popular open-source VPN protocol that can be used to create secure tunnels between networks.
it: VPN: OpenVPN, IPSec e Wireguard sono protocolli VPN open-source popolari che possono essere utilizzati per creare tunnel sicuri tra reti.

source: Remote controller: NethSecurity offers a remote controller feature, enabling administrators to centrally manage multiple NethSecurity installations from a single interface.
it: Controller remoto: NethSecurity offre una funzionalità di controller remoto, che consente agli amministratori di gestire centralmente più installazioni di NethSecurity da un'unica interfaccia.

source: Privacy Policy: to address privacy requirements, use this :ref:`command <privacy_policy-section>` to enable a Privacy Policy link on the homepage.
it: Informativa sulla privacy: per soddisfare i requisiti di privacy, utilizzare questo :ref:`comando <privacy_policy-section>` per abilitare un collegamento all'Informativa sulla privacy nella pagina principale.
