Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/ips.po
Languages: it

source: Snort 3 is an open-source network Intrusion Prevention System that is capable of performing real-time traffic analysis and packet logging on IP networks. It can perform protocol analysis, content searching/matching, and can be used to detect a variety of attacks and probes, such as buffer overflows, stealth port scans, CGI attacks, SMB probes, OS fingerprinting attempts, and much more.
it: Snort 3 è un sistema open-source di prevenzione delle intrusioni di rete (Intrusion Prevention System) in grado di eseguire l'analisi del traffico in tempo reale e la registrazione dei pacchetti sulle reti IP. Può effettuare l'analisi dei protocolli, la ricerca/corrispondenza di contenuti e può essere utilizzato per rilevare una varietà di attacchi e sonde, come buffer overflow, scansioni di porte stealth, attacchi CGI, sonde SMB, tentativi di fingerprinting del sistema operativo e molto altro.

source: Enable IPS
it: Abilitare IPS

source: IPS is disabled by default, to enable it, navigate to the ``IPS`` page under the ``Security`` section. The interface will prompt that the service is disabled and will provide a quick link to browse directly to the ``Settings`` tab.
it: IPS è disabilitato per impostazione predefinita; per abilitarlo, navigare alla pagina ``IPS`` nella sezione ``Sicurezza``. L'interfaccia segnalerà che il servizio è disabilitato e fornirà un collegamento rapido per accedere direttamente alla scheda ``Impostazioni``.

source: Once toggled the :guilabel:`Status` switch, you'll need to pick a policy for your rules. Rules are grouped into policies, each policy is a set of rules that are optimized for a specific use case. The policies are:
it: Una volta attivato l'interruttore :guilabel:`Stato`, sarà necessario scegliere una policy per le proprie regole. Le regole sono raggruppate in policy; ogni policy è un insieme di regole ottimizzato per uno specifico caso d'uso. Le policy sono:

source: **connectivity**: prioritizes performance over security, minimizing false positives and ensuring high device performance while detecting common threats.
it: **connettività**: dà priorità alle prestazioni rispetto alla sicurezza, riducendo al minimo i falsi positivi e garantendo elevate prestazioni del dispositivo, pur rilevando le minacce comuni.

source: **balanced**: recommended for initial deployments, balancing security and performance. and relatively high performance rate with evaluation and testing tools.
it: **bilanciato**: consigliato per le implementazioni iniziali, bilancia sicurezza e prestazioni, offrendo un livello di prestazioni relativamente elevato con strumenti di valutazione e test.

source: **security**: for high-security environments with lower bandwidth and higher false positive tolerance. It provides the maximum protection while minimizing the risk of bringing the network down.
it: **sicurezza**: per ambienti ad alta sicurezza con larghezza di banda ridotta e una maggiore tolleranza ai falsi positivi. Fornisce la massima protezione riducendo al minimo il rischio di interrompere la rete.

source: Once the policy is selected, click on the :guilabel:`Save` button to save the changes.
it: Una volta selezionata la policy, fare clic sul pulsante :guilabel:`Salva` per salvare le modifiche.

source: Access to Snort rules via Oinkcode
it: Accesso alle regole Snort tramite Oinkcode

source: NethSecurity supports the use of a Snort subscription to obtain ``Registered`` and ``Subscriber`` rules through the Oinkcode. The `Oinkcode` is a unique code assigned to registered users on Snort.org, this code is required to authenticate the download of Snort rules.
it: NethSecurity supporta l'utilizzo di un abbonamento Snort per ottenere regole ``Registered`` e ``Subscriber`` tramite l'Oinkcode. L'`Oinkcode` è un codice univoco assegnato agli utenti registrati su Snort.org; questo codice è necessario per autenticare il download delle regole Snort.

source: Available rule categories
it: Categorie di regole disponibili

source: **Community Rules (Free rules)**: Available to all registered users without restrictions. Maintained by the Snort community. Provide basic protection but receive less frequent updates compared to official rules. No Oinkcode is required to access these rules.
it: **Regole della Community (Regole gratuite)**: Disponibili per tutti gli utenti registrati senza restrizioni. Mantenute dalla community di Snort. Forniscono una protezione di base ma ricevono aggiornamenti meno frequenti rispetto alle regole ufficiali. Non è necessario alcun Oinkcode per accedere a queste regole.

source: **Registered Rules (Free rules with delay)**: Official rules updated by the Snort team. Available for free to registered users, but with a 30-day delay compared to the latest version. Oinkcode is required to access these rules.
it: **Regole Registrate (Regole gratuite con ritardo)**: Regole ufficiali aggiornate dal team Snort. Disponibili gratuitamente per gli utenti registrati, ma con un ritardo di 30 giorni rispetto alla versione più recente. È necessario un Oinkcode per accedere a queste regole.

source: How to obtain and use the Oinkcode
it: Come ottenere e utilizzare l'Oinkcode

source: Register on Snort.org
it: Registrarsi su Snort.org

source: Retrieve your Oinkcode from the account profile section
it: Recuperare il proprio Oinkcode dalla sezione del profilo account

source: On NethSecurity, paste your personal code into the `Oinkcode` field. You can verify if the code is valid by clicking on the :guilabel:`Test code` button
it: Su NethSecurity, incollare il proprio codice personale nel campo `Oinkcode`. È possibile verificare se il codice è valido facendo clic sul pulsante :guilabel:`Verifica codice`.

source: Today event list
it: Elenco eventi di oggi

source: The IPS automatically checks traffic inside the network and generates alerts or blocks traffic based on the ruleset. A browsable list can be found under the ``Today event list`` tab. While browsing the list, you can see the rules that triggered the alert, the source and destination IP addresses, the protocol and the action taken by the system.
it: L'IPS controlla automaticamente il traffico all'interno della rete e genera avvisi o blocca il traffico in base al set di regole. Un elenco consultabile è disponibile nella scheda ``Eventi di oggi``. Durante la consultazione dell'elenco, è possibile vedere le regole che hanno generato l'avviso, gli indirizzi IP di origine e destinazione, il protocollo e l'azione intrapresa dal sistema.

source: This list can be filtered using the filter box at the top of the page. Additionally, for every record shown, it's possible to jump right to the rule documentation by clicking on the rule ID.
it: Questo elenco può essere filtrato utilizzando la casella di filtro nella parte superiore della pagina. Inoltre, per ogni record visualizzato, è possibile accedere direttamente alla documentazione della regola facendo clic sull'ID della regola.

source: By clicking on the menu icon on the right side of the record, it's possible to open a pre-filled form to suppress or disable the rule that generated the alert.
it: Facendo clic sull'icona del menu sul lato destro del record, è possibile aprire un modulo precompilato per sopprimere o disabilitare la regola che ha generato l'avviso.

source: Source and destination bypass
it: Bypass di origine e destinazione

source: All traffic that goes through the firewall is analyzed by the IPS. To bypass the IPS for specific source or destination IP addresses, the system supports bypass rules both for IPv4 and IPv6 addresses.
it: Tutto il traffico che passa attraverso il firewall viene analizzato dall'IPS. Per escludere l'IPS per specifici indirizzi IP di origine o destinazione, il sistema supporta regole di bypass sia per indirizzi IPv4 che IPv6.

source: To do so, browse to the `Filter bypass` tab and press the :guilabel:`Add bypass` button. A form will be provided to add the bypass rule based of the source or destination IP address with the following fields:
it: Per farlo, accedere alla scheda `Bypass filtro` e premere il pulsante :guilabel:`Aggiungi bypass`. Verrà fornito un modulo per aggiungere la regola di bypass in base all'indirizzo IP di origine o destinazione con i seguenti campi:

source: ``Address type``: if the ip provided is IPv4 or IPv6
it: ``Tipo di indirizzo``: se l'IP fornito è IPv4 o IPv6

source: ``IP address``: the IP address to bypass
it: ``Indirizzo IP``: l'indirizzo IP da escludere

source: ``Direction``: if the bypass is for the source or destination IP address
it: ``Direzione``: se il bypass riguarda l'indirizzo IP di origine o di destinazione

source: ``Description``: a description of the bypass rule, it is optional and can be omitted
it: ``Descrizione``: una descrizione della regola di bypass; è opzionale e può essere omessa

source: Disable rules
it: Disabilitare regole

source: In some environments, rules can be too restrictive or generate too many false positives. To avoid this, it is possible to disable some rules. A disabled rule is a rule that is not included in the Snort ruleset.
it: In alcuni ambienti, le regole possono essere troppo restrittive o generare troppi falsi positivi. Per evitare ciò, è possibile disabilitare alcune regole. Una regola disabilitata è una regola che non viene inclusa nel set di regole di Snort.

source: Browse to the `Disabled Rules` tab and press the :guilabel:`Disable rule` button. The system will prompt for the following fields:
it: Passare alla scheda `Regole disabilitate` e premere il pulsante :guilabel:`Disabilita regola`. Il sistema richiederà i seguenti campi:

source: ``GID``: the rule GID, it is a number and usually is always `1`
it: ``GID``: il GID della regola, è un numero e di solito è sempre `1`

source: ``SID``: the rule SID, it is a number
it: ``SID``: il SID della regola, è un numero

source: ``Description``: a description of the disabled rule, it is optional and can be omitted
it: ``Descrizione``: una descrizione della regola disabilitata; è opzionale e può essere omessa

source: Suppressed alerts
it: Allarmi silenziati

source: A suppression rule is a rule that is ignored by Snort for a specific IP address or CIDR. The rule is still evaluated for all other IP addresses.
it: Una regola di soppressione è una regola che viene ignorata da Snort per un indirizzo IP o CIDR specifico. La regola viene comunque valutata per tutti gli altri indirizzi IP.

source: To add a suppression rule, browse to the `Suppressed alerts` tab and press the :guilabel:`Suppress alert` button. Fill the fields with the following information:
it: Per aggiungere una regola di soppressione, accedere alla scheda `Allarmi silenziati` e premere il pulsante :guilabel:`Silenzia allarme`. Compilare i campi con le seguenti informazioni:

source: ``Direction``: if the suppression is for the source or destination IP address
it: ``Direzione``: se la soppressione riguarda l'indirizzo IP di origine o di destinazione

source: ``IP address``: the IP address to suppress the alert for, can be a CIDR range
it: ``Indirizzo IP``: l'indirizzo IP per cui sopprimere l'avviso; può essere un intervallo CIDR

source: ``Description``: a description of the suppression rule, it is optional and can be omitted
it: ``Descrizione``: una descrizione della regola di soppressione; è facoltativa e può essere omessa

source: **Subscriber Rules (Paid rules, real-time updates)**: Immediate access to the most up-to-date rules without any delay. Available only to users with a Snort Subscriber Rule Set subscription. Oinkcode is required to access these rules.
it: **Regole per abbonati (regole a pagamento, aggiornamenti in tempo reale)**: Accesso immediato alle regole più aggiornate senza alcun ritardo. Disponibile solo per gli utenti con un abbonamento Snort Subscriber Rule Set. È necessario un Oinkcode per accedere a queste regole.
