Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/ipsec_tunnels.po
Languages: it

source: IPsec tunnels
it: Tunnel IPsec

source: IPsec tunnels, are a crucial component of modern network security. These tunnels provide a secure and encrypted communication pathway over the internet or any untrusted network, ensuring the confidentiality and integrity of data in transit.
it: I tunnel IPsec sono una componente cruciale della sicurezza delle reti moderne. Questi tunnel forniscono un percorso di comunicazione sicuro e cifrato attraverso Internet o qualsiasi rete non affidabile, garantendo la riservatezza e l'integrità dei dati in transito.

source: IPsec (IP Security) protocol is the ‘de facto’ standard in VPN tunnels, it’s typically used to create net to net tunnels and it’s supported from all manufacturers. You can use this protocol to create VPN tunnels between a NethSecurity and a device from another manufacturer as well as VPN tunnels between 2 NethSecurity.
it: Il protocollo IPsec (IP Security) è lo standard ‘de facto’ nei tunnel VPN, viene tipicamente utilizzato per creare tunnel net-to-net ed è supportato da tutti i produttori. Questo protocollo può essere utilizzato per creare tunnel VPN tra un NethSecurity e un dispositivo di un altro produttore, così come tunnel VPN tra due NethSecurity.

source: NethSecurity by default uses Route-Based VPNs, so each tunnel rely on a specific tun type device.
it: NethSecurity per impostazione predefinita utilizza VPN basate su routing (Route-Based VPN), quindi ogni tunnel utilizza un proprio device tun specifico.

source: Configuration
it: Configurazione

source: The configuration of an IPsec tunnel includes 2 peers which we will call A and B which can be:
it: La configurazione di un tunnel IPsec include 2 peer che chiameremo A e B, i quali possono essere:

source: 1 Nethsecurity and 1 third-party firewall
it: 1 Nethsecurity e 1 firewall di terze parti

source: Devices A and B must be configured with parameters which, depending on the specific section, will be identical or mirrored.
it: I dispositivi A e B devono essere configurati con parametri che, a seconda della sezione specifica, saranno identici o speculari.

source: The parameters that must be configured in a mirrored way between the 2 devices are typically those linked to the network:
it: I parametri che devono essere configurati in modo speculare tra i 2 dispositivi sono tipicamente quelli legati alla rete:

source: the WAN interface used by the tunnel
it: l'interfaccia WAN utilizzata dal tunnel

source: the 2 (or more) networks we want to connect (local network, remote network)
it: le 2 (o più) reti che si desidera connettere (rete locale, rete remota)

source: the local and remote identifiers (typically the public IPs of the WANs of the 2 firewalls, but others can also be used)
it: gli identificatori locali e remoti (tipicamente gli IP pubblici delle WAN dei 2 firewall, ma possono essere utilizzati anche altri)

source: Therefore:
it: Pertanto:

source: The WAN IP address of firewall A must coincide with the Remote IP address of firewall B
it: L'indirizzo IP WAN del firewall A deve coincidere con l'indirizzo IP remoto del firewall B

source: the local network of firewall A must coincide with the remote network of firewall B
it: la rete locale del firewall A deve coincidere con la rete remota del firewall B

source: the local ID of firewall A must coincide with the remote ID of firewall B
it: l'ID locale del firewall A deve coincidere con l'ID remoto del firewall B

source: All other parameters, however, must be identical in both firewalls to allow correct communication (encryption key, IKE and ESP configuration, etc.). NethSecurity uses a shared key as the only method to encrypt data.
it: Tutti gli altri parametri, tuttavia, devono essere identici su entrambi i firewall per consentire una comunicazione corretta (chiave di cifratura, configurazione IKE ed ESP, ecc.). NethSecurity utilizza una chiave condivisa come unico metodo per cifrare i dati.

source: How to create a new IPsec tunnel
it: Come creare un nuovo tunnel IPsec

source: Click :guilabel:`Add IPsec tunnel` button to configure a new tunnel. Assign a name to this tunnel then configure it, the configuration is split in 3 steps. The first step contains only network-related parameters, while the others contain all the remaining parameters that must be identical in both firewalls to allow correct communication.
it: Fare clic sul pulsante :guilabel:`Aggiungi tunnel IPsec` per configurare un nuovo tunnel. Assegnare un nome a questo tunnel e poi configurarlo; la configurazione è suddivisa in 3 passaggi. Il primo passaggio contiene solo i parametri relativi alla rete, mentre gli altri contengono tutti i restanti parametri che devono essere identici su entrambi i firewall per consentire una comunicazione corretta.

source: Once you completed the configuration a new tunnel will be shown in the IPSec page.
it: Una volta completata la configurazione, un nuovo tunnel verrà visualizzato nella pagina IPSec.

source: If an endpoint is behind a NAT, we suggest to set the values for Local and Remote identifier fields to custom unique names with an "email like" syntax, e.g. nsec@site-a and otherdevice@site-b.
it: Se un endpoint si trova dietro NAT, si consiglia di impostare i valori dei campi Identificatore locale e Identificatore remoto su nomi univoci personalizzati con una sintassi simile a quella di un indirizzo email, ad esempio nsec@site-a e otherdevice@site-b.

source: Multiple Networks management
it: Gestione di più reti

source: A single IPsec tunnel can handle multiple local and remote networks. In this case, NethSecurity always creates multiple child SAs to ensure broad compatibility with remote devices. The behavior remains the same for IKEv1 or IKEv2.
it: Un singolo tunnel IPsec può gestire più reti locali e remote. In questo caso, NethSecurity crea sempre più child SA per garantire un'ampia compatibilità con i dispositivi remoti. Il comportamento rimane invariato sia per IKEv1 che per IKEv2.

source: IPsec tunnel in a MultiWAN scenario
it: Tunnel IPsec in uno scenario MultiWAN

source: In a multi-WAN scenario, it’s crucial to ensure that each tunnel's remote endpoint is reached through the same WAN interface configured for the IPsec tunnel.
it: In uno scenario multi-WAN, è fondamentale garantire che ciascun endpoint remoto del tunnel venga raggiunto attraverso la stessa interfaccia WAN configurata per il tunnel IPsec.

source: To enforce this behavior, a static route must be created so that traffic to the remote IP is directed through the gateway of the specific WAN interface assigned to the tunnel.
it: Per imporre questo comportamento, è necessario creare una rotta statica affinché il traffico verso l'IP remoto venga instradato attraverso il gateway dell'interfaccia WAN specifica assegnata al tunnel.

source: For example, if the tunnel is over WAN1 and the remote endpoint is ``11.22.33.44``, the static route would specify that traffic to ``11.22.33.44`` uses the WAN1 gateway.
it: Ad esempio, se il tunnel è su WAN1 e l'endpoint remoto è ``11.22.33.44``, la rotta statica specificherà che il traffico verso ``11.22.33.44`` utilizza il gateway WAN1.
