Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/logs.po
Languages: it

source: Logs
it: Log

source: Logs are initially written to a temporary in-memory directory to prevent potential errors on the root file system in case of a failure.
it: I log vengono inizialmente scritti in una directory temporanea in memoria per prevenire potenziali errori sul file system root in caso di un guasto.

source: **Local Storage**: Logs can be written directly to storage. This can be configured from the UI, see the :ref:`storage-section`.
it: **Archiviazione locale**: I log possono essere scritti direttamente nell'archiviazione. Questa opzione può essere configurata dall'interfaccia utente, vedere la sezione :ref:`storage-section`.

source: **Remote Controller**: Logs can be automatically forwarded to a :ref:`remote controller <controller_logs-section>`.
it: **Controller remoto**: I log possono essere inoltrati automaticamente a un :ref:`controller remoto <controller_logs-section>`.

source: **Custom Syslog Forwarder**: Logs can be sent to a remote syslog server.
it: **Syslog Forwarder personalizzato**: I log possono essere inviati a un server syslog remoto.

source: The next paragraph will explain how to configure this latter option.
it: Il paragrafo seguente spiegherà come configurare quest'ultima opzione.

source: Forwarding to a remote server
it: Inoltro a un server remoto

source: It is sufficient to configure the UCI database with the desired options, then commit the changes, and finally restart the service. Temporary logs will continue to be visible in ``/var/log/messages`` and will also be sent to the remote server.
it: È sufficiente configurare il database UCI con le opzioni desiderate, quindi confermare le modifiche e infine riavviare il servizio. I log temporanei continueranno a essere visibili in ``/var/log/messages`` e saranno anche inviati al server remoto.

source: Most syslog servers are configured to listen on UDP port 514 by default.
it: La maggior parte dei server syslog sono configurati per ascoltare sulla porta UDP 514 per impostazione predefinita.

source: Example configuration for sending logs to the syslog server with IP 192.168.1.88 on UDP port 514. The configuration is named ``clm`` (custom log manager):
it: Esempio di configurazione per l'invio dei log al server syslog con IP 192.168.1.88 sulla porta UDP 514. La configurazione è denominata ``clm`` (custom log manager):

source: Once configured, simply commit the changes with the command: ::
it: Una volta configurato, è sufficiente confermare le modifiche con il comando: ::

source: And finally, restart the service: ::
it: E infine, riavviare il servizio: ::

source: By default the forwarder uses the TraditionalFileFormat (RFC 3164) for the logs. It is possible also to configure RFC 5424 using the same syntax: ::
it: Per impostazione predefinita, il forwarder utilizza il TraditionalFileFormat (RFC 3164) per i log. È anche possibile configurare RFC 5424 utilizzando la stessa sintassi: ::

source: It is possible to configure multiple forwarders by repeating the operation using a different configuration name like ``clm2``.
it: È possibile configurare più forwarder ripetendo l'operazione utilizzando un nome di configurazione diverso come ``clm2``.

source: Log rotation size
it: Dimensione rotazione log

source: **Get current size**: Retrieve the current log rotation size in bytes.
it: **Ottieni dimensione attuale**: Recupera la dimensione attuale della rotazione del log in byte.

source: **Set new size**: Change the log rotation size to a specified value, ensuring that the new size is a positive integer and not less than 52428800 bytes (50 MB).
it: **Imposta nuova dimensione**: Modificare la dimensione di rotazione dei log a un valore specificato, assicurandosi che la nuova dimensione sia un intero positivo e non inferiore a 52428800 byte (50 MB).

source: **Configuration safety**: If the specified size is below the minimum threshold, the script warns the user and does not make any changes to the configuration.
it: **Sicurezza della configurazione**: Se la dimensione specificata è inferiore alla soglia minima, lo script avvisa l'utente e non apporta alcuna modifica alla configurazione.

source: Usage
it: Utilizzo

source: To use the script, run it with the following syntax:
it: Per utilizzare lo script, eseguirlo con la seguente sintassi:

source: **get**: Outputs the current log rotation size in bytes.
it: **get**: Restituisce la dimensione attuale della rotazione dei log in byte.

source: **set <size>**: Sets the log rotation size to the specified value (in bytes).
it: **set <size>**: Imposta la dimensione di rotazione del log al valore specificato (in byte).

source: Example
it: Esempio

source: To get the current log rotation size:
it: Per ottenere la dimensione attuale della rotazione dei log:

source: To set a new log rotation size to 104857600 bytes (100 MB):
it: Per impostare una nuova dimensione di rotazione dei log a 104857600 byte (100 MB):

source: The service rsyslog is restarted automatically after the size is set.
it: Il servizio rsyslog viene riavviato automaticamente dopo che la dimensione è stata impostata.

source: All changes to the log rotation size are directly written in the Rsyslog configuration file ``/etc/rsyslog.conf``.
it: Tutte le modifiche alla dimensione della rotazione dei log vengono scritte direttamente nel file di configurazione di Rsyslog ``/etc/rsyslog.conf``.

source: The ``/var/log/messages`` log file is stored in RAM. Once it reaches a predefined size limit, the log is rotated and compressed to conserve space. The rotated log is saved as ``/var/log/messages.1.gz`` in gzip format. The system retains only two versions of the log: the active log file and the latest rotated, compressed file. From version 1.4.0, by default, the log rotation threshold is set to 10% of the tmpfs filesystem mounted at ``/tmp``.
it: Il file di log ``/var/log/messages`` è memorizzato nella RAM. Una volta raggiunto un limite di dimensione predefinito, il log viene ruotato e compresso per risparmiare spazio. Il log ruotato viene salvato come ``/var/log/messages.1.gz`` in formato gzip. Il sistema mantiene solo due versioni del log: il file di log attivo e l'ultimo file ruotato e compresso. Dalla versione 1.4.0, per impostazione predefinita, la soglia di rotazione del log è impostata al 10% del filesystem tmpfs montato su ``/tmp``.

source: The ``ns-log-size`` script manages the log rotation size for the Rsyslog service. It allows to **get** and **set** the log rotation size defined in bytes for the log file located at ``/var/log/messages``.
it: Lo script ``ns-log-size`` gestisce la dimensione di rotazione dei log per il servizio Rsyslog. Consente di **ottenere** e **impostare** la dimensione di rotazione dei log, definita in byte, per il file di log situato in ``/var/log/messages``.
