Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/migration.po
Languages: it

source: **1. Policy inheritance for incoming traffic**
it: **1. Ereditarietà delle policy per il traffico in ingresso**

source: All traffic incoming from a NethSecurity interface automatically inherits the same policies as the connected interface, regardless of the originating network. This includes automatic masquerading when traffic is destined for the internet.
it: Tutto il traffico in ingresso da un'interfaccia NethSecurity eredita automaticamente le stesse policy dell'interfaccia a cui è collegata, indipendentemente dalla rete di origine. Questo include il masquerading automatico quando il traffico è destinato a Internet.

source: Let's look at an example:
it: Vediamo un esempio:

source: A local interface named "office" is operating on the 192.168.1.0/24 network segment and is assigned to the "lan" zone. A gateway with IP 192.168.1.220 is connected to the same switch as the "office" interface, providing access to the remote network 10.10.10.0/24. The remote network 10.10.10.0/24 must use NethSecurity to reach the internet.
it: Un'interfaccia locale denominata ``office`` opera sul segmento di rete 192.168.1.0/24 ed è assegnata alla zona ``lan``. Un gateway con IP 192.168.1.220 è collegato allo stesso switch dell'interfaccia ``office``, fornendo accesso alla rete remota 10.10.10.0/24. La rete remota 10.10.10.0/24 deve utilizzare NethSecurity per accedere a Internet.

source: In NethSecurity, no additional configuration is needed, all packets sent to the "office" interface are correctly routed, even if they originate from a different network segment. Masquerading is also applied to all outbound packets.
it: In NethSecurity, non è necessaria alcuna configurazione aggiuntiva: tutti i pacchetti inviati all'interfaccia ``office`` vengono instradati correttamente, anche se provengono da un segmento di rete diverso. Il masquerading viene inoltre applicato a tutti i pacchetti in uscita.

source: **2. No need to create new zones for different segments**
it: **2. Non è necessario creare nuove zone per segmenti diversi**

source: Just like policies, standard rules can be applied to this traffic without needing to create a new zone. If you want to apply different policies for this segment, you can simply create standard firewall rules. For convenience, you can use a host set with the CIDR network in firewall objects.
it: Proprio come le policy, le regole standard possono essere applicate a questo traffico senza la necessità di creare una nuova zona. Se si desidera applicare policy diverse per questo segmento, è sufficiente creare regole firewall standard. Per comodità, è possibile utilizzare un set di host con la rete CIDR negli oggetti firewall.

source: **3. Routing works seamlessly without extra rules**
it: **3. Il routing funziona senza problemi senza regole aggiuntive**

source: Routing for this specific network segment functions correctly without any additional rules or zones. In NethServer 7, it was mandatory to create a zone to ensure proper routing for incoming packets, as mentioned in the initial port forwarding's example.
it: Il routing per questo specifico segmento di rete funziona correttamente senza la necessità di regole o zone aggiuntive. In NethServer 7, era obbligatorio creare una zona per garantire il corretto instradamento dei pacchetti in ingresso, come menzionato nell'esempio iniziale di port forwarding.

source: USB-to-Ethernet adapters
it: Adattatori USB-Ethernet

source: It may rarely happen that the NethServer 7 being migrated has a USB to Ethernet adapter connected to add a network device. These adapters should not be used in a firewall and are **not supported on NethSecurity 8**. However, it is possible to install certain specific drivers for experimental purposes, not for production environments. These drivers might be useful for temporarily managing the migrated firewall while awaiting hardware with all the necessary network cards. More information can be found in the :ref:`network section <network-section>`.
it: Può raramente accadere che il NethServer 7 in fase di migrazione abbia collegato un adattatore USB a Ethernet per aggiungere un dispositivo di rete. Questi adattatori non dovrebbero essere utilizzati in un firewall e **non sono supportati su NethSecurity 8**. Tuttavia, è possibile installare alcuni driver specifici per scopi sperimentali, non per ambienti di produzione. Questi driver possono essere utili per gestire temporaneamente il firewall migrato in attesa di hardware dotato di tutte le schede di rete necessarie. Maggiori informazioni sono disponibili nella :ref:`sezione di rete <network-section>`.

source: If you are using these adapters, remember that they will not work until the correct driver is installed. Keep in mind that NethSecurity 8 may not have the correct driver for the adapter you are using on NethServer 7. In this case, you will need to use a different adapter.
it: Se si utilizzano questi adattatori, ricordare che non funzioneranno fino a quando non sarà installato il driver corretto. Tenere presente che NethSecurity 8 potrebbe non disporre del driver corretto per l'adattatore utilizzato su NethServer 7. In questo caso, sarà necessario utilizzare un adattatore diverso.

source: If you are using a USB to Ethernet adapter for a RED/WAN interface, be aware that you won't be able to download the necessary modules to make it work properly on NethSecurity 8 unless you have other RED/WAN interfaces running on network cards directly connected to the motherboard.
it: Se si utilizza un adattatore da USB a Ethernet per un'interfaccia RED/WAN, è importante sapere che non sarà possibile scaricare i moduli necessari per farlo funzionare correttamente su NethSecurity 8 a meno che non siano presenti altre interfacce RED/WAN che utilizzano schede di rete collegate direttamente alla scheda madre.

source: When present, interface labels from the source system are adopted as interface names in NethSecurity 8, with the exception of WAN interfaces, which retain their original names.
it: Quando presenti, le etichette delle interfacce dal sistema di origine vengono adottate come nomi delle interfacce in NethSecurity 8, con l'eccezione delle interfacce WAN, che mantengono i loro nomi originali.
