Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/migration.po
Languages: it

source: NethServer 7 migration
it: Migrazione NethServer 7

source: Migration is the process to convert a NethServer 7 machine (*source*) into a NethSecurity (*destination*).
it: La migrazione è il processo per convertire una macchina NethServer 7 (*sorgente*) in una NethSecurity (*destinazione*).

source: Migrating the firewall configuration from NethServer 7 to NethSecurity is a crucial process to ensure the continuity and security of your network services.
it: La migrazione della configurazione del firewall da NethServer 7 a NethSecurity è un processo cruciale per garantire la continuità e la sicurezza dei servizi di rete.

source: Migration requirements:
it: Requisiti per la migrazione:

source: ensure access to Cockpit on NethServer 7
it: garantire l'accesso a Cockpit su NethServer 7

source: install the ``Firewall Migration`` application on NethServer 7. After installation, the application will be available in the Cockpit applications list
it: installare l'applicazione ``Firewall Migration`` su NethServer 7. Dopo l'installazione, l'applicazione sarà disponibile nell'elenco delle applicazioni di Cockpit

source: Migration scenarios:
it: Scenari di migrazione:

source: Migration in-place (firewall only): if the original NethServer 7 only contains the firewall module, you can perform an in-place migration and reuse the existing hardware. This scenario simplifies the migration process without the need for additional hardware.
it: Migrazione in-place (solo firewall): se il NethServer 7 originale contiene solo il modulo firewall, è possibile eseguire una migrazione in-place e riutilizzare l'hardware esistente. Questo scenario semplifica il processo di migrazione senza la necessità di hardware aggiuntivo.

source: Migration with other installed modules: if NethServer 7 contains additional modules such as the mail server, suitable hardware is required to run NethSecurity. In this case you will need to :ref:`import the configuration <import_migration-section>` on a freshly installed NethSecurity.
it: Migrazione con altri moduli installati: se NethServer 7 contiene moduli aggiuntivi come il mail server, è necessario disporre di hardware adeguato per eseguire NethSecurity. In questo caso sarà necessario :ref:`importare la configurazione <import_migration-section>` su un NethSecurity appena installato.

source: Migration from NethServer 6 is not supported. If you are running NethServer 6.x, you must first upgrade to NethServer 7 before migrating to NethSecurity.
it: La migrazione da NethServer 6 non è supportata. Se si sta utilizzando NethServer 6.x, è necessario prima eseguire l'aggiornamento a NethServer 7 prima di migrare a NethSecurity.

source: Testing the migration
it: Test della migrazione

source: This method allows for thorough testing without affecting your existing installation. A test system will boot from an USB drive leaving the existing installation untouched.
it: Questo metodo consente di effettuare test approfonditi senza influire sull'installazione esistente. Un sistema di test verrà avviato da una chiavetta USB lasciando l'installazione attuale invariata.

source: To perform a test migration, follow these steps:
it: Per eseguire una migrazione di prova, seguire questi passaggi:

source: Access ``Firewall Migration`` page on NethServer 7 Cockpit: the page will list all migrated configurations
it: Accedere alla pagina ``Firewall Migration`` su NethServer 7 Cockpit: la pagina elencherà tutte le configurazioni migrate

source: Download the live USB image: click :guilabel:`Download` in the ``Download live USB image`` section
it: Scaricare l'immagine live USB: fare clic su :guilabel:`Scarica` nella sezione ``Download live USB image``

source: Prepare the USB drive: write the downloaded image using your preferred method to an USB drive, see the :ref:`installation section <install-section>` for more info on how to copy the image on a disk.
it: Preparare l'unità USB: scrivere l'immagine scaricata utilizzando il metodo preferito su un'unità USB, vedere la :ref:`sezione di installazione <install-section>` per ulteriori informazioni su come copiare l'immagine su un disco.

source: Boot from USB drive: shutdown the firewall, plug the USB drive and restart it, ensuring it boots from the USB drive. This is typically done through BIOS/UEFI settings
it: Avvio da unità USB: spegnere il firewall, collegare l'unità USB e riavviarlo, assicurandosi che l'avvio avvenga dall'unità USB. Questo viene generalmente effettuato tramite le impostazioni del BIOS/UEFI.

source: Migration boot: during the boot process, the system loads from the USB drive instead of the internal hard drive
it: Avvio di migrazione: durante il processo di avvio, il sistema viene caricato dall'unità USB invece che dal disco rigido interno

source: Testing environment: your system now operates using the migrated system stored on the USB. Any changes or tests performed occur within this isolated environment
it: Ambiente di test: il sistema ora opera utilizzando il sistema migrato memorizzato sulla USB. Eventuali modifiche o test effettuati avvengono all'interno di questo ambiente isolato.

source: Remember, after testing, you can simply remove the USB drive, reboot the firewall normally, and it will resume using the original setup, leaving your existing installation untouched.
it: Ricordare che, dopo il test, è sufficiente rimuovere la chiavetta USB, riavviare normalmente il firewall e questo riprenderà a utilizzare la configurazione originale, lasciando l'installazione esistente invariata.

source: Migration in-place
it: Migrazione in-place

source: If the initial NethServer 7 setup includes only the firewall module, you can seamlessly migrate and reuse the current hardware. This approach streamlines the migration, eliminating the necessity for extra hardware.
it: Se la configurazione iniziale di NethServer 7 include solo il modulo firewall, è possibile migrare e riutilizzare l'hardware attuale senza interruzioni. Questo approccio semplifica la migrazione, eliminando la necessità di hardware aggiuntivo.

source: To perform the in-place migration from NethServer 7 to NethSecurity, follow these steps:
it: Per eseguire la migrazione in-place da NethServer 7 a NethSecurity, seguire questi passaggi:

source: Backup your data: the in-place migration is a destructive process. It is strongly recommended to create a full backup of the machine before proceeding. This step is crucial to ensure data safety in case of any issues during the migration.
it: Eseguire il backup dei dati: la migrazione in-place è un processo distruttivo. Si consiglia vivamente di creare un backup completo della macchina prima di procedere. Questo passaggio è fondamentale per garantire la sicurezza dei dati in caso di eventuali problemi durante la migrazione.

source: Download configuration archive as a precaution: as a precaution, download the archive containing the exported configuration by clicking :guilabel:`Download` in the ``Download exported archive`` section. Keep this archive in a secure location; it may be useful if the in-place migration fails.
it: Scaricare l'archivio di configurazione come precauzione: come misura precauzionale, scaricare l'archivio contenente la configurazione esportata facendo clic su :guilabel:`Scarica` nella sezione ``Download exported archive``. Conservare questo archivio in un luogo sicuro; potrebbe essere utile nel caso in cui la migrazione in-place fallisca.

source: Initiate the migration: when ready, click the :guilabel:`Migrate` button to start the migration process. This signals the system to begin migrating from NethServer 7 to NethSecurity.
it: Avviare la migrazione: quando si è pronti, fare clic sul pulsante :guilabel:`Migra` per avviare il processo di migrazione. Questo segnala al sistema di iniziare la migrazione da NethServer 7 a NethSecurity.

source: Select the target disk: choose the disk where NethSecurity will be installed. Note that NethSecurity does not support RAID. If the original NethServer 7 server has more than one disk, the other disks will remain unchanged and unused during the migration process.
it: Selezionare il disco di destinazione: scegliere il disco su cui verrà installato NethSecurity. Si noti che NethSecurity non supporta RAID. Se il server NethServer 7 originale dispone di più di un disco, gli altri dischi rimarranno invariati e inutilizzati durante il processo di migrazione.

source: Confirm and start the process: after selecting the disk, click :guilabel:`Migrate` to confirm. The system will download the NethSecurity image and write it to the selected disk. Subsequently, the system will automatically reboot.
it: Confermare e avviare il processo: dopo aver selezionato il disco, fare clic su :guilabel:`Migra` per confermare. Il sistema scaricherà l'immagine di NethSecurity e la scriverà sul disco selezionato. Successivamente, il sistema si riavvierà automaticamente.

source: Complete the migration on first boot: upon the first boot of NethSecurity, the configuration from NethServer 7 will be automatically migrated. Ensure to carefully verify all settings and services to confirm they have been migrated correctly.
it: Completare la migrazione al primo avvio: al primo avvio di NethSecurity, la configurazione da NethServer 7 verrà migrata automaticamente. Assicurarsi di verificare attentamente tutte le impostazioni e i servizi per confermare che siano stati migrati correttamente.

source: After completing the migration, follow the :ref:`post-migration steps <post-migration-section>` to ensure the system is correctly configured.
it: Dopo aver completato la migrazione, seguire i :ref:`passaggi post-migrazione <post-migration-section>` per assicurarsi che il sistema sia configurato correttamente.

source: Migration with other installed modules
it: Migrazione con altri moduli installati

source: This scenario involves exporting a special configuration archive from NethServer 7 and importing it into NethSecurity.
it: Questo scenario prevede l'esportazione di un archivio di configurazione speciale da NethServer 7 e l'importazione dello stesso in NethSecurity.

source: This method is recommended when the original NethServer 7 setup includes additional modules, such as the mail server. To perform this migration, you will need to install NethSecurity on new hardware and then import the configuration into the newly installed NethSecurity system.
it: Questo metodo è consigliato quando la configurazione originale di NethServer 7 include moduli aggiuntivi, come il mail server. Per eseguire questa migrazione, sarà necessario installare NethSecurity su un nuovo hardware e poi importare la configurazione nel sistema NethSecurity appena installato.

source: To perform the migration from NethServer 7 to NethSecurity, follow these steps:
it: Per eseguire la migrazione da NethServer 7 a NethSecurity, seguire questi passaggi:

source: Install NethSecurity on a new machine: follow the :ref:`installation instructions <install-section>`
it: Installare NethSecurity su una nuova macchina: seguire le :ref:`istruzioni di installazione <install-section>`

source: Download the archive with exported configuration: click :guilabel:`Download` in the ``Download export archive`` section
it: Scaricare l'archivio con la configurazione esportata: fare clic su :guilabel:`Scarica` nella sezione ``Download export archive``

source: Access the ``Backup & Restore`` page on NethSecurity and go to the ``Migration`` tab, then click :guilabel:`Upload migration file` and select the archive downloaded in the previous step
it: Accedere alla pagina ``Backup & Restore`` su NethSecurity e andare nella scheda ``Migrazione``, quindi fare clic su :guilabel:`Carica file di migrazione` e selezionare l'archivio scaricato nel passaggio precedente.

source: When importing the configuration onto new hardware, the MAC addresses of the network interfaces change, requiring a decision on how to remap these interfaces. The user interface displays the interfaces of the source machine on the left and those of the destination machine on the right. If the source machine had configured VLANs, the user must remap the physical interface, and the system will automatically recreate the VLAN on the underlying interface.
it: Quando si importa la configurazione su un nuovo hardware, gli indirizzi MAC delle interfacce di rete cambiano, rendendo necessaria una decisione su come rimappare queste interfacce. L'interfaccia utente mostra le interfacce della macchina di origine a sinistra e quelle della macchina di destinazione a destra. Se la macchina di origine aveva VLAN configurate, è necessario rimappare l'interfaccia fisica e il sistema ricreerà automaticamente la VLAN sull'interfaccia sottostante.

source: Click :guilabel:`Migrate` to start the migration process
it: Fare clic su :guilabel:`Migra` per avviare il processo di migrazione

source: Post migration steps
it: Passaggi post-migrazione

source: The in-place migration process is executed when the system is offline. Since the registration process requires an active Internet connections, the subscription is not migrated during the in-place migration. If you have performed an in-place migration, you must :ref:`register the system <subscription-section>` again. This step is not necessary if you have performed a migration with the exported archive method.
it: Il processo di migrazione in-place viene eseguito quando il sistema è offline. Poiché il processo di registrazione richiede una connessione Internet attiva, la subscription non viene migrata durante la migrazione in-place. Se è stata eseguita una migrazione in-place, è necessario :ref:`registrare nuovamente il sistema <subscription-section>`. Questo passaggio non è necessario se è stata eseguita una migrazione utilizzando il metodo dell'archivio esportato.

source: When using a remote LDAP or Active Directory server to authenticate OpenVPN Road Warrior clients, make sure that the remote server is reachable from the new NethSecurity machine by verifying also the DNS name resolution. If necessary, update the DNS configuration on the new machine. Also review the :ref:`remote user database page <remote_user_databases-section>` to check if all users have been correctly imported.
it: Quando si utilizza un server LDAP remoto o Active Directory per autenticare i client OpenVPN Road Warrior, assicurarsi che il server remoto sia raggiungibile dalla nuova macchina NethSecurity verificando anche la risoluzione dei nomi DNS. Se necessario, aggiornare la configurazione DNS sulla nuova macchina. Inoltre, consultare la :ref:`pagina del database utenti remoto <remote_user_databases-section>` per verificare che tutti gli utenti siano stati importati correttamente.

source: Then, verify that all services are working correctly. If you encounter any issues, refer to the :ref:`troubleshooting section <troubleshooting-section>`.
it: Quindi, verificare che tutti i servizi funzionino correttamente. In caso di problemi, consultare la :ref:`sezione di risoluzione dei problemi <troubleshooting-section>`.

source: The migration process is logged inside a special log file located at ``/root/migration.log``. This file contains all the actions performed during the migration process. Please note that the log file is deleted after an image upgrade.
it: Il processo di migrazione viene registrato in un file di log speciale situato in ``/root/migration.log``. Questo file contiene tutte le azioni eseguite durante il processo di migrazione. Si noti che il file di log viene eliminato dopo un aggiornamento dell'immagine.

source: Migrated configurations
it: Configurazioni migrate

source: During the migration, the following configurations will be imported from NethServer 7:
it: Durante la migrazione, le seguenti configurazioni verranno importate da NethServer 7:

source: Password of the *root* user: it can be used to access the system via SSH and the web interface
it: Password dell'utente *root*: può essere utilizzata per accedere al sistema tramite SSH e l'interfaccia web

source: Network configuration: everything should be migrated except for bridges over bonds that are not supported
it: Configurazione di rete: tutto dovrebbe essere migrato ad eccezione dei bridge su bond che non sono supportati

source: Date and timezone
it: Data e fuso orario

source: DHCP servers and reservations: DHCP server on bonds interfaces are not supported
it: Server DHCP e prenotazioni: i server DHCP sulle interfacce bond non sono supportati

source: DNS configuration with host definition: TFTP options are migrated, but not the content of the TFTP server. To re-enable the service make sure to manually setup ``tftp_root`` option
it: Configurazione DNS con definizione host: le opzioni TFTP vengono migrate, ma non il contenuto del server TFTP. Per riabilitare il servizio, assicurarsi di configurare manualmente l'opzione ``tftp_root``.

source: Static IPv4 routes
it: Route IPv4 statiche

source: Port forwards
it: Reindirizzamenti di porta

source: Firewall zones: zones are migrated and should retain the same behavior of the original configuration: green zones will be mapped to ``lan``, red zones to ``wan``, orange zones to ``dmz``, and blue zones to ``guest`` zones; if a blue zone was present on NethServer 7, rules for accepting DNS and DHCP requests will be automatically added
it: Zone firewall: le zone vengono migrate e dovrebbero mantenere lo stesso comportamento della configurazione originale: le zone verdi saranno mappate su ``lan``, le zone rosse su ``wan``, le zone arancioni su ``dmz`` e le zone blu su ``guest``; se una zona blu era presente su NethServer 7, le regole per l'accettazione delle richieste DNS e DHCP verranno aggiunte automaticamente

source: Firewall rules: rules using NDPI services are not supported; source and destination objects, including zones, are not currently supported and will be converted to rules with IP/CIDR addresses; all NAT helpers are automatically loaded after the migration with standard kernel parameters
it: Regole firewall: le regole che utilizzano servizi NDPI non sono supportate; gli oggetti di origine e destinazione, incluse le zone, non sono attualmente supportati e verranno convertiti in regole con indirizzi IP/CIDR; tutti i NAT helper vengono caricati automaticamente dopo la migrazione con i parametri standard del kernel

source: MultiWAN configuration: providers will be preserved while divert rules (policy routing) are not migrated
it: Configurazione MultiWAN: i provider verranno preservati mentre le regole di deviazione (policy routing) non verranno migrate

source: QoS: classes with reserved bandwidth and rules are not supported
it: QoS: le classi con larghezza di banda riservata e regole non sono supportate

source: OpenVPN Road Warrior: all settings are migrated; the accounting database of client connections is not migrated; mail notification is still not supported on NethSecurity. If the machine was connected to a remote Active Directory and the OpenVPN server was configured to authenticate against it, please see also :ref:`remote_user_databases-section`.
it: OpenVPN Road Warrior: tutte le impostazioni sono state migrate; il database di accounting delle connessioni client non viene migrato; la notifica via mail non è ancora supportata su NethSecurity. Se la macchina era connessa a un Active Directory remoto e il server OpenVPN era configurato per autenticarsi tramite esso, consultare anche :ref:`remote_user_databases-section`.

source: OpenVPN tunnels
it: Tunnel OpenVPN

source: IPSec tunnels
it: Tunnel IPSec

source: Threat shield IP: only enterprise lists are migrated, community lists must be reconfigured manually
it: Threat shield IP: solo le liste enterprise vengono migrate, le liste community devono essere riconfigurate manualmente

source: Subscription: the subscription is migrated only when using the exported archive method
it: Abbonamento: l'abbonamento viene migrato solo quando si utilizza il metodo dell'archivio esportato

source: Hotspot: if the migration has been executed on a new hardware, the hotspot interface will change MAC address and it must be registered again to the remote hotspot manager
it: Hotspot: se la migrazione è stata eseguita su un nuovo hardware, l'interfaccia hotspot cambierà indirizzo MAC e dovrà essere registrata nuovamente presso il gestore hotspot remoto

source: Let's Encrypt certificate configuration: certificates will be regenerated after the migration
it: Configurazione del certificato Let's Encrypt: i certificati saranno rigenerati dopo la migrazione

source: Reverse proxy configuration: the configuration is migrated, but the certificates will be regenerated after the migration
it: Configurazione reverse proxy: la configurazione viene migrata, ma i certificati saranno rigenerati dopo la migrazione

source: FlashStart Cloud DNS filter
it: Filtro DNS Cloud FlashStart

source: The following features are not migrated to NethSecurity:
it: Le seguenti funzionalità non sono migrate su NethSecurity:

source: Web proxy (Squid) and filter (ufdbGuard)
it: Proxy web (Squid) e filtro (ufdbGuard)

source: IPS (Suricata) and IPS alerts (EveBox)
it: IPS (Suricata) e avvisi IPS (EveBox)

source: UPS monitoring (NUT)
it: Monitoraggio UPS (NUT)

source: System statistics (Collectd)
it: Statistiche di sistema (Collectd)

source: Reports (Dante)
it: Report (Dante)

source: Bandwidth monitor (ntopng)
it: Monitor della larghezza di banda (ntopng)

source: Fail2ban, it is replaced by Threat shield :ref:`brute force attempt block feature <brute_force-section>`
it: Fail2ban, viene sostituito da Threat shield :ref:`funzionalità di blocco dei tentativi di forza bruta <brute_force-section>`

source: Threat shield DNS, currently :ref:`available only from command line <threat_shield_dns-section>`
it: Threat shield DNS, attualmente :ref:`disponibile solo da riga di comando <threat_shield_dns-section>`

source: Custom Zones
it: Zone personalizzate

source: Custom zones are rarely used in NethServer 7 and tipically for very specific tasks. They are required to define a network segment with firewall rules different from those of the primary interface or, more commonly, to correctly manage traffic coming from a network other than the one to which the interface is connected. These zones allow for defining specific behavior for that network segment and ensure correct routing in complex environments (e.g., a port forwarding rule with a remote host destination via MPLS or a VPN tunnel).
it: Le zone personalizzate sono raramente utilizzate in NethServer 7 e tipicamente per compiti molto specifici. Sono necessarie per definire un segmento di rete con regole firewall differenti da quelle dell’interfaccia primaria o, più comunemente, per gestire correttamente il traffico proveniente da una rete diversa da quella a cui l’interfaccia è collegata. Queste zone permettono di definire un comportamento specifico per quel segmento di rete e garantiscono un corretto instradamento in ambienti complessi (ad esempio, una regola di port forwarding con destinazione host remoto tramite MPLS o tunnel VPN).

source: In NethSecurity, zones work differently from NethServer 7, offering for these cases a much simpler management. Typically, in NethSecurity, all previous configurations made with custom zones can be easily managed **without the need to recreate any custom zone**, thanks to the following default behavior.
it: In NethSecurity, le zone funzionano in modo diverso rispetto a NethServer 7, offrendo in questi casi una gestione molto più semplice. Tipicamente, in NethSecurity, tutte le precedenti configurazioni effettuate con zone personalizzate possono essere gestite facilmente **senza la necessità di ricreare alcuna zona personalizzata**, grazie al seguente comportamento predefinito.
