Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/monitoring.po
Languages: it

source: NethSecurity uses `Netdata <https://www.netdata.cloud/>`_ as Real-time monitoring tool. Netdata is an open-source, real-time, performance monitoring and troubleshooting tool for systems and applications. It provides comprehensive insights into the performance and health of systems and applications through visualizations and detailed metrics. Netdata is designed to be lightweight, fast, and easy to use.
it: NethSecurity utilizza `Netdata <https://www.netdata.cloud/>`_ come strumento di monitoraggio in tempo reale. Netdata è uno strumento open-source per il monitoraggio delle prestazioni e la risoluzione dei problemi di sistemi e applicazioni in tempo reale. Fornisce approfondimenti completi sulle prestazioni e sullo stato di salute di sistemi e applicazioni tramite visualizzazioni e metriche dettagliate. Netdata è progettato per essere leggero, veloce e facile da usare.

source: Netdata is enabled by default on NethSecurity and it is accessible from the LAN network. To access it, go to the ``Monitoring`` page and click :guilabel:`Open report` button from the ``Real-time report`` tab.
it: Netdata è abilitato di default su NethSecurity ed è accessibile dalla rete LAN. Per accedervi, andare alla pagina ``Monitoraggio`` e fare clic sul pulsante :guilabel:`Apri report` dalla scheda ``Report in tempo reale``.

source: Netdata metrics are saved in RAM and will be reset at very machine reboot. If the firewall is connected to the :ref:`remote controller <controller-section>`, metrics will be stored to the controller itself and preserved across reboots.
it: Le metriche di Netdata vengono salvate in RAM e saranno azzerate a ogni riavvio della macchina. Se il firewall è connesso al :ref:`controller remoto <controller-section>`, le metriche verranno memorizzate direttamente sul controller e saranno preservate anche dopo i riavvii.

source: Ping latency monitoring
it: Monitoraggio latenza del ping

source: Configure the monitoring tool to evaluate round-trip time and packet loss by transmitting ping messages to network hosts. This tool is employed to monitor the quality of network connectivity. You have the option to include one or more hosts for monitoring, and it's also feasible to add IP addresses within a VPN for assessing tunnel quality.
it: Configurare lo strumento di monitoraggio per valutare il tempo di andata e ritorno (round-trip time) e la perdita di pacchetti trasmettendo messaggi ping agli host di rete. Questo strumento viene utilizzato per monitorare la qualità della connettività di rete. È possibile includere uno o più host da monitorare ed è anche possibile aggiungere indirizzi IP all'interno di una VPN per valutare la qualità del tunnel.

source: To monitor a new host or IP address, click on the :guilabel:`Add host` button and enter the required information, finally click on the :guilabel:`Save` button to confirm the changes.
it: Per monitorare un nuovo host o indirizzo IP, fare clic sul pulsante :guilabel:`Aggiungi host` e inserire le informazioni richieste, quindi fare clic sul pulsante :guilabel:`Salva` per confermare le modifiche.

source: Changes are applied immediately. To remove a host from the list, click on the delete icon.
it: Le modifiche vengono applicate immediatamente. Per rimuovere un host dall'elenco, fare clic sull'icona di eliminazione.

source: You can see a graph of the ping latency by accessing Netdata from the report page.
it: È possibile visualizzare un grafico della latenza del ping accedendo a Netdata dalla pagina del report.

source: Historical monitoring
it: Storico monitoraggio

source: Subscription required
it: Subscription richiesta

source: This feature is available only if the firewall and the controller have a valid subscription.
it: Questa funzionalità è disponibile solo se il firewall e il controller dispongono di una subscription valida.

source: If the unit was connected to the controller before the subscription was activated, historical monitoring will not be enabled automatically. The ``Controller`` page will show a message indicating that historical monitoring is disabled.
it: Se l'unità è stata collegata al controller prima che la subscription fosse attiva, lo storico del monitoraggio non verrà abilitato automaticamente. La pagina ``Controller`` mostrerà un messaggio che indica che il monitoraggio storico è disabilitato.

source: To enable it, follow these steps:
it: Per abilitarlo, seguire questi passaggi:

source: Disconnect the unit from the controller.
it: Disconnettere l'unità dal controller.

source: Ensure that the NethServer 8 where the controller is installed has a valid subscription.
it: Assicurarsi che il NethServer 8 su cui è installato il controller disponga di una subscription valida.

source: Reconnect the unit to the controller.
it: Ricollegare l'unità al controller.

source: See the :ref:`controller metrics <controller_metrics-section>` for more information.
it: Consultare :ref:`controller metrics <controller_metrics-section>` per ulteriori informazioni.

source: Alerts
it: Allarmi

source: The alert system leverages the power of the Netdata engine for efficient monitoring and alerting.
it: Il sistema di allarmi sfrutta la potenza del motore Netdata per un monitoraggio e una segnalazione efficienti.

source: The alert system prioritizes only those alerts that have the potential to disrupt or compromise the firewall's functionality. By focusing on critical indicators, administrators can efficiently address issues that pose a genuine threat to the security and operation of the firewall.
it: Il sistema di allarmi dà priorità solo a quegli allarmi che hanno il potenziale di interrompere o compromettere la funzionalità del firewall. Concentrandosi su indicatori critici, gli amministratori possono affrontare in modo efficiente i problemi che rappresentano una reale minaccia per la sicurezza e il funzionamento del firewall.

source: If the server has a valid :ref:`subscription-section`, alert notifications are seamlessly sent to remote servers for centralized monitoring and management. Both ``my.nethesis.it`` and ``my.nethserver.com`` serve as central hubs for receiving alerts, allowing administrators to stay informed about the firewall's status and promptly respond to any critical situations.
it: Se il server dispone di una :ref:`subscription-section` valida, le notifiche di allerta vengono inviate automaticamente ai server remoti per il monitoraggio e la gestione centralizzata. Sia ``my.nethesis.it`` che ``my.nethserver.com`` fungono da hub centrali per la ricezione degli avvisi, consentendo agli amministratori di rimanere informati sullo stato del firewall e di rispondere tempestivamente a eventuali situazioni critiche.

source: Implemented alerts:
it: Allarmi implementati:

source: Disk Space: the disk space alert triggers when available disk space on the system reaches a critical level. This proactive notification helps prevent potential disruptions by addressing disk space issues before they impact firewall operations.
it: Spazio su disco: l'avviso relativo allo spazio su disco viene attivato quando lo spazio disponibile sul disco del sistema raggiunge un livello critico. Questa notifica proattiva aiuta a prevenire potenziali interruzioni affrontando i problemi di spazio su disco prima che possano influire sul funzionamento del firewall.

source: MultiWAN Status (Up/Down): this alert notifies administrators when there are changes in the MultiWAN status, indicating whether connections are up or down. Timely awareness of MultiWAN status changes is crucial for maintaining continuous and reliable internet connectivity.
it: Stato MultiWAN (Attivo/Non attivo): questo avviso notifica agli amministratori quando ci sono cambiamenti nello stato del MultiWAN, indicando se le connessioni sono attive o non attive. Una consapevolezza tempestiva dei cambiamenti di stato del MultiWAN è fondamentale per mantenere una connettività Internet continua e affidabile.

source: **Real-time monitoring**: it leverages Netdata, Netify agent and logs to provide immediate insights into the firewall's performance. It reads data from logs and local databases, storing metrics in RAM. Note that these metrics are reset upon every reboot, ensuring that only the most current data are displayed.
it: **Monitoraggio in tempo reale**: sfrutta Netdata, Netify agent e i log per fornire informazioni immediate sulle prestazioni del firewall. Legge i dati dai log e dai database locali, memorizzando le metriche nella RAM. Si noti che queste metriche vengono azzerate a ogni riavvio, garantendo che vengano visualizzati solo i dati più recenti.
