Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/monitoring.po
Languages: it

source: Monitoring
it: Monitoraggio

source: NethSecurity provides comprehensive monitoring capabilities to help administrators track the performance and health of the firewall. Monitoring is essential for ensuring the firewall's optimal operation and identifying potential issues that may impact its functionality.
it: NethSecurity offre funzionalità di monitoraggio complete per aiutare gli amministratori a tenere traccia delle prestazioni e dello stato di salute del firewall. Il monitoraggio è essenziale per garantire il funzionamento ottimale del firewall e individuare eventuali problemi che potrebbero comprometterne la funzionalità.

source: NethSecurity offers two types of monitoring:
it: NethSecurity offre due tipi di monitoraggio:

source: **Historical monitoring**: for a more comprehensive view over time, historical monitoring stores data on a remote controller. This allows metrics to be preserved across reboots and enables centralized monitoring. Please note that this feature requires a valid subscription both on the firewall and the controller.
it: **Monitoraggio storico**: per una visione più completa nel tempo, il monitoraggio storico memorizza i dati su un controller remoto. Questo consente di preservare le metriche anche dopo i riavvii e permette un monitoraggio centralizzato. Si noti che questa funzionalità richiede un abbonamento valido sia sul firewall che sul controller.

source: Real-time monitoring
it: Monitoraggio in tempo reale

source: Real-time monitoring is an essential feature in modern firewall systems, allowing administrators to have instant visibility into network traffic, VPN connections, and security threats. In NethSecurity, real-time monitoring provides live data, ensuring that issues such as network congestion, unauthorized access, and security breaches are identified and mitigated promptly. Real-time monitoring stores data in RAM and resets at every machine reboot.
it: Il monitoraggio in tempo reale è una funzionalità essenziale nei moderni sistemi firewall, che consente agli amministratori di avere una visibilità immediata sul traffico di rete, sulle connessioni VPN e sulle minacce alla sicurezza. In NethSecurity, il monitoraggio in tempo reale fornisce dati aggiornati in tempo reale, garantendo che problematiche come congestione della rete, accessi non autorizzati e violazioni della sicurezza vengano individuate e mitigate tempestivamente. Il monitoraggio in tempo reale memorizza i dati in RAM e si azzera a ogni riavvio della macchina.

source: The ``Real-time monitor`` page provides a comprehensive overview of the firewall's performance and status, with detailed insights into network traffic. It's divided into four main sections: ``Traffic``, ``WAN uplinks``, ``VPN``, ``Security`` and ``Real-time Traffic``.
it: La pagina ``Monitor in tempo reale`` offre una panoramica completa delle prestazioni e dello stato del firewall, con approfondimenti dettagliati sul traffico di rete. È suddivisa in quattro sezioni principali: ``Traffico``, ``Connettività WAN``, ``VPN``, ``Sicurezza`` e ``Traffico in tempo realse``.

source: Traffic
it: Traffico

source: The below charts reads data from `dpireport <https://dev.nethsecurity.org/packages/ns-report/>`_ daemon:
it: Il grafico sottostante legge i dati dal demone `dpireport <https://dev.nethsecurity.org/packages/ns-report/>`_:

source: ``Daily total traffic``: this counter shows the total volume of data transferred through the firewall for the current day.
it: ``Traffico totale giornaliero``: questo contatore mostra il volume totale di dati trasferiti attraverso il firewall per la giornata corrente.

source: ``Recent traffic``: the daily traffic histogram visually represents network traffic over time, updated every 60 minutes. It helps identify busy periods and analyze traffic fluctuations throughout the day. Sudden spikes or dips could indicate potential performance issues or security threats.
it: ``Traffico recente``: l'istogramma del traffico giornaliero rappresenta visivamente il traffico di rete nel tempo, aggiornato ogni 60 minuti. Aiuta a identificare i periodi di maggiore attività e ad analizzare le fluttuazioni del traffico durante la giornata. Picchi improvvisi o cali potrebbero indicare potenziali problemi di prestazioni o minacce alla sicurezza.

source: ``Local Hosts``: this chart focuses on internal (local) hosts and their traffic. It helps identify the most active devices on the network, aiding in bandwidth management and detection of potential internal security risks, such as compromised devices generating unexpected traffic.
it: ``Host locali``: questo grafico si concentra sugli host interni (locali) e sul loro traffico. Aiuta a identificare i dispositivi più attivi sulla rete, facilitando la gestione della larghezza di banda e il rilevamento di potenziali rischi di sicurezza interni, come dispositivi compromessi che generano traffico inatteso.

source: ``Applications``: this chart displays traffic by application, allowing you to monitor which software or services are generating the most traffic. It is useful for understanding application behavior, detecting bandwidth hogs, and monitoring compliance with usage policies.
it: ``Applicazioni``: questo grafico mostra il traffico suddiviso per applicazione, consentendo di monitorare quali software o servizi stanno generando la maggior parte del traffico. È utile per comprendere il comportamento delle applicazioni, rilevare i maggiori consumatori di banda e monitorare la conformità alle policy di utilizzo.

source: ``Remote Hosts``: this chart lists the external (remote) hosts that have exchanged the most data with the network. By analyzing this data, administrators can track interactions with specific external entities, helping to detect malicious external sources or unusual outbound traffic patterns.
it: ``Host remoti``: questo grafico elenca gli host esterni (remoti) che hanno scambiato la maggior quantità di dati con la rete. Analizzando questi dati, gli amministratori possono monitorare le interazioni con specifiche entità esterne, aiutando a rilevare fonti esterne malevole o modelli insoliti di traffico in uscita.

source: ``Protocol``: this chart shows the breakdown of daily traffic by protocol (e.g., HTTP, HTTPS, FTP). It is useful for identifying which protocols are consuming the most bandwidth and ensuring that network resources are being used appropriately. High usage of unfamiliar protocols may indicate unauthorized activities.
it: ``Protocollo``: questo grafico mostra la ripartizione del traffico giornaliero per protocollo (ad esempio, HTTP, HTTPS, FTP). È utile per identificare quali protocolli stanno consumando la maggior parte della banda e per assicurarsi che le risorse di rete vengano utilizzate in modo appropriato. Un utilizzo elevato di protocolli non familiari può indicare attività non autorizzate.

source: It's possible to narrow the search for a specific host, application, or protocol by clicking on the respective label in the table below the chart.
it: È possibile restringere la ricerca a un host, un'applicazione o un protocollo specifico facendo clic sull'etichetta corrispondente nella tabella sotto il grafico.

source: Connectivity
it: Connettività

source: The connectivity section provides an overview of WAN connections, including status, bandwidth allocation, and traffic data.
it: La sezione connettività fornisce una panoramica delle connessioni WAN, inclusi stato, allocazione della banda e dati sul traffico.

source: This page shows the following information:
it: Questa pagina mostra le seguenti informazioni:

source: ``WANs``: list of the WAN connections with their current status (UP/DOWN) and public IP address. The status information helps ensure that critical network connections are online, and any downtime are immediately addressed. Data are sourced from the firewall mwan3 status.
it: ``WAN``: elenco delle connessioni WAN con il loro stato attuale (UP/DOWN) e l'indirizzo IP pubblico. Le informazioni sullo stato aiutano a garantire che le connessioni di rete critiche siano online e che eventuali interruzioni vengano affrontate immediatamente. I dati provengono dallo stato mwan3 del firewall.

source: ``WAN events``: this section lists recent WAN connection and disconnection events from the last 24 hours, providing insight into network stability and outages. It helps administrators understand the frequency and duration of network disruptions, aiding in troubleshooting and capacity planning. Data are retrieved from the logs for the past 24 hours. If the logs do not cover the full 24-hour period, the data may be incomplete. The results are cached for 5 minutes.
it: ``Eventi WAN``: questa sezione elenca i recenti eventi di connessione e disconnessione WAN delle ultime 24 ore, fornendo informazioni sulla stabilità della rete e sulle interruzioni. Aiuta gli amministratori a comprendere la frequenza e la durata delle interruzioni di rete, facilitando la risoluzione dei problemi e la pianificazione della capacità. I dati vengono recuperati dai log delle ultime 24 ore. Se i log non coprono l'intero periodo di 24 ore, i dati potrebbero essere incompleti. I risultati vengono memorizzati nella cache per 5 minuti.

source: ``WAN interface traffic``: this histogram shows the traffic data for each WAN connection over the past 60 minutes, sourced from Netdata. It helps track real-time performance and diagnose issues such as uneven load balancing or WAN link saturation.
it: ``Traffico interfaccia WAN``: questo istogramma mostra i dati di traffico per ciascuna connessione WAN negli ultimi 60 minuti, provenienti da Netdata. Aiuta a monitorare le prestazioni in tempo reale e a diagnosticare problemi come il bilanciamento del carico non uniforme o la saturazione del collegamento WAN.

source: ``Latency to <address>``: this section provides real-time latency data for a specific IP address configured inside the :ref:`ping_latency-section` module. The cart helps to monitor network performance and identify potential connectivity issues.
it: ``Latenza verso <indirizzo>``: questa sezione fornisce dati in tempo reale sulla latenza per un indirizzo IP specifico configurato all'interno del modulo :ref:`ping_latency-section`. Il grafico aiuta a monitorare le prestazioni della rete e a identificare potenziali problemi di connettività.

source: ``Packet delivery rate to <address>``: this section provides real-time packet delivery rate data for a specific IP address configured inside the :ref:`ping_latency-section` module. If the rate is below 100% it could indicate network congestion or connectivity issues.
it: ``Tasso di consegna dei pacchetti verso <indirizzo>``: questa sezione fornisce dati in tempo reale sul tasso di consegna dei pacchetti per un indirizzo IP specifico configurato all'interno del modulo :ref:`ping_latency-section`. Se il tasso è inferiore al 100%, ciò potrebbe indicare congestione di rete o problemi di connettività.

source: The VPN section provides detailed insights into OpenVPN Road Warrior servers, OpenVPN tunnels and IPsec tunnels.
it: La sezione VPN fornisce approfondimenti dettagliati sui server OpenVPN Road Warrior, sui tunnel OpenVPN e sui tunnel IPsec.

source: For each OpenVPN Road Warrior server, the following information is displayed:
it: Per ogni server OpenVPN Road Warrior, vengono visualizzate le seguenti informazioni:

source: ``Status``: this section shows the current status of the OpenVPN server. It helps administrators monitor the availability of the VPN service and detect any issues that may impact user connectivity.
it: ``Stato``: questa sezione mostra lo stato attuale del server OpenVPN. Aiuta gli amministratori a monitorare la disponibilità del servizio VPN e a rilevare eventuali problemi che potrebbero influire sulla connettività degli utenti.

source: ``Connected clients``: this displays the total number of users currently registered on the VPN server. Monitoring registered users is crucial for ensuring capacity planning and VPN performance, particularly when the system approaches maximum usage.
it: ``Client connessi``: questo visualizza il numero totale di utenti attualmente registrati sul server VPN. Monitorare gli utenti registrati è fondamentale per garantire una corretta pianificazione della capacità e le prestazioni della VPN, soprattutto quando il sistema si avvicina al limite massimo di utilizzo.

source: ``Total traffic by hour``: this graph shows the total data transferred by all VPN clients during each hour, providing an overview of VPN bandwidth usage. It helps in tracking how much network traffic the VPN generates and identifying hours with heavy usage, which could lead to performance issues.
it: ``Traffico totale per ore``: questo grafico mostra il totale dei dati trasferiti da tutti i client VPN durante ciascuna ora, fornendo una panoramica dell'utilizzo della banda VPN. Aiuta a monitorare la quantità di traffico di rete generato dalla VPN e a identificare le ore di maggiore utilizzo, che potrebbero causare problemi di prestazioni.

source: ``Daily connections``: this section lists all currently connected VPN users and the time they connected. It is useful for tracking session duration and detecting potential misuse of the VPN, such as connections that last unusually long. Data are sourced from local SQLite connection database.
it: ``Connessioni giornaliere``: questa sezione elenca tutti gli utenti VPN attualmente connessi e l'orario in cui si sono collegati. È utile per monitorare la durata delle sessioni e rilevare eventuali usi impropri della VPN, come connessioni che durano insolitamente a lungo. I dati provengono dal database locale delle connessioni SQLite.

source: ``Connected clients by hour``: this chart displays the number of clients connected to the VPN over time. It allows administrators to monitor VPN activity throughout the day, helping to identify peak times and plan for increased capacity when necessary. Data are sourced from local SQLite connection database.
it: ``Clienti collegati per ora``: questo grafico mostra il numero di client connessi alla VPN nel tempo. Consente agli amministratori di monitorare l'attività della VPN durante la giornata, aiutando a identificare i periodi di picco e a pianificare un aumento della capacità quando necessario. I dati provengono dal database locale delle connessioni SQLite.

source: ``Client traffic by hour``: this chart breaks down VPN traffic by individual clients over time. It helps detect users who may be consuming excessive bandwidth or engaging in unauthorized activities, aiding in the identification of potential insider threats. Data are sourced from local SQLite connection database.
it: ``Traffico cliente per ora``: questo grafico suddivide il traffico VPN per singolo client nel tempo. Aiuta a rilevare utenti che potrebbero consumare una quantità eccessiva di banda o svolgere attività non autorizzate, facilitando l'identificazione di potenziali minacce interne. I dati provengono dal database locale delle connessioni SQLite.

source: The Site-to-Site VPN section provides insights into OpenVPN and IPsec tunnels:
it: La sezione Site-to-Site VPN fornisce informazioni su tunnel OpenVPN e IPsec:

source: ``Connected tunnels``: this counter shows the number of active site-to-site VPN tunnels.
it: ``Tunnel connessi``: questo contatore mostra il numero di tunnel VPN site-to-site attivi.

source: ``Configured tunnels``: this counter shows the list of all configured site-to-site VPN tunnels, including their status and type.
it: ``Tunnel configurati``: questo contatore mostra l'elenco di tutti i tunnel VPN site-to-site configurati, inclusi il loro stato e il tipo.

source: ``Tunnel traffic``: this histogram provides real-time traffic data for each site-to-site VPN tunnel over the last 60 minutes. It helps detect issues such as low throughput or connection instability.
it: ``Traffico tunnel``: questo istogramma fornisce dati sul traffico in tempo reale per ciascun tunnel VPN site-to-site negli ultimi 60 minuti. Aiuta a rilevare problemi come bassa velocità di trasferimento o instabilità della connessione.

source: Security
it: Sicurezza

source: The security section provides insights into malware detection and attack monitoring, helping administrators identify and mitigate security threats. To enable this section, the :ref:`threat_shield_ip-section` module must be enabled. Data are sourced from logs covering the past 24 hours. If the logs do not span the entire 24-hour period, the data may be incomplete. Results are cached for 5 minutes to improve performance.
it: La sezione sicurezza fornisce informazioni sulla rilevazione di malware e sul monitoraggio degli attacchi, aiutando gli amministratori a identificare e mitigare le minacce alla sicurezza. Per abilitare questa sezione, è necessario abilitare il modulo :ref:`threat_shield_ip-section`. I dati provengono dai log relativi alle ultime 24 ore. Se i log non coprono l'intero periodo di 24 ore, i dati potrebbero essere incompleti. I risultati vengono memorizzati nella cache per 5 minuti per migliorare le prestazioni.

source: The ``Blocklist`` section provides an overview of blocked packets based on enabled blocklists. Available charts are:
it: La sezione ``Blocklist`` fornisce una panoramica dei pacchetti bloccati in base alle blocklist abilitate. I grafici disponibili sono:

source: ``Blocked threats``: this counter shows the total number of packets blocked by the firewall due to malware detection for the current day. It provides a clear overview of the volume of threats intercepted, giving administrators a measure of the firewall’s effectiveness.
it: ``Minacce bloccate``: questo contatore mostra il numero totale di pacchetti bloccati dal firewall a causa del rilevamento di malware per la giornata corrente. Fornisce una panoramica chiara del volume delle minacce intercettate, offrendo agli amministratori una misura dell’efficacia del firewall.

source: ``Blocked threats by hour``: this chart tracks the number of packets blocked each hour. It helps identify the times of day when the network is most vulnerable to attacks, aiding in preventive measures.
it: ``Minacce bloccate per ora``: questo grafico tiene traccia del numero di pacchetti bloccati ogni ora. Aiuta a identificare i momenti della giornata in cui la rete è più vulnerabile agli attacchi, facilitando l'adozione di misure preventive.

source: ``Threats by direction``: a chart that shows the distribution of blocked malware by firewall chain. Depending on what logging option is enabled, the firewall can log packets from the following chains:
it: ``Minacce per direzione``: un grafico che mostra la distribuzione del malware bloccato per catena del firewall. A seconda dell'opzione di registrazione abilitata, il firewall può registrare i pacchetti provenienti dalle seguenti catene:

source: *inp-wan*: packets coming from the WAN interface and destined to the firewall
it: *inp-wan*: pacchetti provenienti dall'interfaccia WAN e destinati al firewall

source: *fwd-wan*: packets coming from the WAN interface and destined to the LAN network
it: *fwd-wan*: pacchetti provenienti dall'interfaccia WAN e destinati alla rete LAN

source: *fwd-lan*: packets coming from the LAN network and destined to the WAN interface
it: *fwd-lan*: pacchetti provenienti dalla rete LAN e destinati all'interfaccia WAN

source: *pre-ct*: flooding packets that are in invalid state
it: *pre-ct*: invio in flooding dei pacchetti che si trovano in stato non valido

source: *pre-syn*: flooding packets that are part of a TCP connection and are in the SYN state
it: *pre-syn*: invio massiccio di pacchetti che fanno parte di una connessione TCP e si trovano nello stato SYN

source: *pre-udp*: flooding packets that are part of a UDP connection
it: *pre-udp*: invio massiccio di pacchetti che fanno parte di una connessione UDP

source: ``Threats by category``: a chart that breaks down the blocked malware by category, helping administrators to find the most effective blocklists.
it: ``Minacce per categoria``: un grafico che suddivide il malware bloccato per categoria, aiutando gli amministratori a individuare le blocklist più efficaci.

source: The ``Brute force attacks`` section provides insights into the number of blocked IP based on the number of failed login attempts. Data are sourced from logs covering the past 24 hours. If the logs do not span the entire 24-hour period, the data may be incomplete. Results are cached for 5 minutes to improve performance. Available charts are:
it: La sezione ``Attacchi brute force`` fornisce informazioni sul numero di IP bloccati in base al numero di tentativi di accesso non riusciti. I dati provengono dai log relativi alle ultime 24 ore. Se i log non coprono l'intero periodo di 24 ore, i dati potrebbero essere incompleti. I risultati vengono memorizzati nella cache per 5 minuti per migliorare le prestazioni. I grafici disponibili sono:

source: ``Blocked IP addresses``: this counter shows the total number of IP addresses blocked due to malicious activity for the current day. It helps in tracking the volume of attempted intrusions.
it: ``Indirizzi IP Bloccati``: questo contatore mostra il numero totale di indirizzi IP bloccati a causa di attività dannose per la giornata corrente. Aiuta a monitorare il volume dei tentativi di intrusione.

source: ``Blocked IP addresses by hour``: this graph tracks the number of blocked IP addresses over time, helping to identify periods of increased attack activity.
it: ``Indirizzi IP bloccati per ora``: questo grafico tiene traccia del numero di indirizzi IP bloccati nel tempo, aiutando a identificare i periodi di maggiore attività di attacco.

source: ``Most frequently blocked IP address``: this char shows the IP addresses that have been blocked most frequently. It is useful for identifying persistent threats or attack sources that should be investigated or blacklisted.
it: ``Indirizzo IP bloccato più frequentemente``: questo carattere mostra gli indirizzi IP che sono stati bloccati più frequentemente. È utile per identificare minacce persistenti o fonti di attacco che dovrebbero essere investigate o inserite in blacklist.

source: Real-time traffic
it: Traffico in tempo reale

source: The Real-time traffic section shows data updated every 2 minutes. It's divided into three categories:
it: La sezione Traffico in tempo reale mostra dati aggiornati ogni 2 minuti. È suddivisa in tre categorie:

source: ``Local Hosts``: lists all detected local hosts and their current traffic status, ordered by traffic volume.
it: ``Host locali``: elenca tutti gli host locali rilevati e il loro stato attuale del traffico, ordinati per volume di traffico.

source: ``Applications``: lists all detected applications and their current traffic status, ordered by traffic volume.
it: ``Applicazioni``: elenca tutte le applicazioni rilevate e il loro stato attuale del traffico, ordinate per volume di traffico.

source: ``Protocols``: lists all detected protocols and their current traffic status, ordered by traffic volume.
it: ``Protocolli``: elenca tutti i protocolli rilevati e il loro stato attuale del traffico, ordinati per volume di traffico.
