Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/multiwan.po
Languages: it

source: MultiWAN (Wide Area Network) configuration is a setup in which the firewall utilizes multiple internet connections from different internet service providers (ISPs) simultaneously. This configuration aims to enhance network reliability, increase bandwidth, and improve internet speed by distributing network traffic across multiple links. It can provide failover protection, ensuring that if one connection fails, the network traffic is automatically redirected to the functional connection, minimizing downtime and ensuring continuous internet access. MultiWAN configurations are often used in businesses and organizations that require a highly available and stable internet connection for their operations.
it: La configurazione MultiWAN (Wide Area Network) è un'impostazione in cui il firewall utilizza contemporaneamente più connessioni Internet provenienti da diversi provider di servizi Internet (ISP). Questa configurazione ha l'obiettivo di aumentare l'affidabilità della rete, incrementare la larghezza di banda e migliorare la velocità di connessione distribuendo il traffico di rete su più collegamenti. Può offrire protezione da failover, garantendo che, in caso di guasto di una connessione, il traffico di rete venga automaticamente reindirizzato verso la connessione funzionante, riducendo al minimo i tempi di inattività e assicurando un accesso continuo a Internet. Le configurazioni MultiWAN sono spesso utilizzate da aziende e organizzazioni che necessitano di una connessione Internet altamente disponibile e stabile per le proprie operazioni.

source: MultiWAN configuration requires at least two network interfaces in the WAN zone of the system. This is the fundamental requirement for implementing a MultiWAN connection.
it: La configurazione MultiWAN richiede almeno due interfacce di rete nella zona WAN del sistema. Questo è il requisito fondamentale per implementare una connessione MultiWAN.

source: The first time you access the configuration page, it is mandatory to create a default policy. This policy is essential and cannot be deleted. The default policy defines the basic behavior of the MultiWAN system. It's necessary to specify its behavior. There are two available main options:
it: La prima volta che si accede alla pagina di configurazione, è obbligatorio creare una policy predefinita. Questa policy è essenziale e non può essere eliminata. La policy predefinita definisce il comportamento di base del sistema MultiWAN. È necessario specificarne il comportamento. Sono disponibili due opzioni principali:

source: ``Balanced``: In this mode, WAN connections are utilized simultaneously, and traffic is balanced based on the weight assigned to each WAN. The WAN weight can vary from 1 to 1000.
it: ``Bilanciato``: In questa modalità, le connessioni WAN vengono utilizzate simultaneamente e il traffico viene bilanciato in base al peso assegnato a ciascuna WAN. Il peso della WAN può variare da 1 a 1000.

source: ``Backup``: In backup mode, the secondary WAN connection comes into play only if the primary connection fails. This ensures a backup connectivity if the primary WAN fails.
it: ``Backup``: In modalità backup, la connessione WAN secondaria entra in funzione solo se la connessione primaria fallisce. Questo garantisce una connettività di riserva in caso di guasto della WAN primaria.

source: There is also a ``Custom mode`` that allows more detailed configuration, especially useful when dealing with three or more WAN connections. This mode provides greater flexibility in managing traffic between different WAN connections.
it: Esiste anche una modalità ``Personalizzato`` che consente una configurazione più dettagliata, particolarmente utile quando si gestiscono tre o più connessioni WAN. Questa modalità offre una maggiore flessibilità nella gestione del traffico tra le diverse connessioni WAN.

source: In the custom mode of Multi-WAN configuration, the following concepts apply:
it: Nella modalità personalizzata della configurazione Multi-WAN, si applicano i seguenti concetti:

source: Independent priority levels: each priority level operates independently of others. WAN interfaces within a particular priority level do not affect or depend on interfaces in other levels.
it: Livelli di priorità indipendenti: ogni livello di priorità funziona in modo indipendente dagli altri. Le interfacce WAN all'interno di un determinato livello di priorità non influenzano e non dipendono dalle interfacce presenti in altri livelli.

source: Multiple WAN interfaces within a priority level: each priority level can contain two or more WAN interfaces. These interfaces are grouped together for specific configuration settings.
it: Più interfacce WAN all'interno di un livello di priorità: ogni livello di priorità può contenere due o più interfacce WAN. Queste interfacce sono raggruppate insieme per impostazioni di configurazione specifiche.

source: Weights determine traffic distribution: the weights assigned to WAN interfaces within a priority level determine how traffic is distributed among these interfaces. Higher weights indicate a higher proportion of traffic allocation.
it: I pesi determinano la distribuzione del traffico: i pesi assegnati alle interfacce WAN all'interno di un livello di priorità determinano come il traffico viene distribuito tra queste interfacce. Pesi più alti indicano una maggiore proporzione di allocazione del traffico.

source: Priority decreases with new levels: adding a new priority level results in interfaces within this level having lower priority. They are only utilized if all interfaces in the previous level fail.
it: La priorità diminuisce con i nuovi livelli: aggiungere un nuovo livello di priorità comporta che le interfacce all'interno di questo livello abbiano una priorità inferiore. Esse vengono utilizzate solo se tutte le interfacce nel livello precedente falliscono.

source: Consider a scenario where the first two WAN interfaces are configured in balance mode, and the last interface serves as a backup if both the first two interfaces fail:
it: Si consideri uno scenario in cui le prime due interfacce WAN sono configurate in modalità bilanciamento, e l'ultima interfaccia funge da backup nel caso in cui entrambe le prime due interfacce risultino non disponibili.

source: select the first two WAN interfaces and set them to balance mode by assigning weights to both depending on internet connection performances
it: Selezionare le prime due interfacce WAN e impostarle in modalità bilanciamento assegnando dei pesi a entrambe in base alle prestazioni della connessione Internet.

source: add a new priority level by clicking on :guilabel:`Add priority level` button
it: aggiungere un nuovo livello di priorità facendo clic sul pulsante :guilabel:`Aggiungi livello di priorità`

source: select the third WAN interface and assign a weight. However, in this scenario, the weight does not influence the traffic distribution as it is the only interface at this level. It acts as a backup, coming into play only if both interfaces in the previous level fail.
it: selezionare la terza interfaccia WAN e assegnare un peso. Tuttavia, in questo scenario, il peso non influenza la distribuzione del traffico poiché è l'unica interfaccia a questo livello. Funziona come backup, entrando in gioco solo se entrambe le interfacce del livello precedente falliscono.

source: Routing rules
it: Regole di instradamento

source: Users can create outbound traffic rules based on specific criteria such as source IP, destination IP, source port(s), destination port(s), and IP protocol types. This policy-based routing feature enables users to customize which outbound connections use specific WAN interfaces, allowing for a fine-tuned network setup.
it: Gli utenti possono creare regole di traffico in uscita basate su criteri specifici come IP sorgente, IP di destinazione, porta(e) sorgente, porta(e) di destinazione e tipi di protocollo IP. Questa funzionalità di routing basato su policy consente di personalizzare quali connessioni in uscita utilizzano specifiche interfacce WAN, permettendo una configurazione di rete altamente personalizzata.

source: Here's how you can create a custom rule:
it: Ecco come è possibile creare una regola personalizzata:

source: Create a new policy: to begin customizing traffic routing, start by creating a new policy. Click on the :guilabel:`Create policy` button to initiate the process.
it: Creare una nuova policy: per iniziare a personalizzare l'instradamento del traffico, iniziare creando una nuova policy. Fare clic sul pulsante :guilabel:`Crea policy` per avviare il processo.

source: Create a new rule: then click on the :guilabel:`Create rule` button. This step allows you to define specific conditions under which the traffic will be routed differently from the default policy.
it: Crea una nuova regola: quindi fare clic sul pulsante :guilabel:`Crea regola`. Questo passaggio consente di definire condizioni specifiche in base alle quali il traffico verrà instradato in modo diverso rispetto alla policy predefinita.

source: Give the rule a meaningful name: assign a descriptive and meaningful name to the rule. This name should reflect the purpose or conditions of the traffic routing rule for easy identification.
it: Assegnare un nome significativo alla regola: assegnare un nome descrittivo e significativo alla regola. Questo nome dovrebbe riflettere lo scopo o le condizioni della regola di instradamento del traffico per facilitarne l'identificazione.

source: Enter an address or range: specify a single IP address or a CIDR. Only IPv4 is supported.
it: Immettere un indirizzo o un intervallo: specificare un singolo indirizzo IP o un CIDR. È supportato solo IPv4.

source: Any address: select this option to match any address.
it: Qualsiasi indirizzo: selezionare questa opzione per corrispondere a qualsiasi indirizzo.

source: Select a firewall object: choose from the list of predefined firewall objects.
it: Selezionare un oggetto firewall: scegliere dall'elenco degli oggetti firewall predefiniti.

source: Select the created policy for this traffic type: choose the custom policy you created in the first step as the routing preference for this specific type of traffic. By associating the rule with a particular policy, you are instructing the system to route the defined traffic according to the settings specified within that policy.
it: Selezionare la policy creata per questo tipo di traffico: scegliere la policy personalizzata creata nel primo passaggio come preferenza di instradamento per questo specifico tipo di traffico. Associando la regola a una determinata policy, si indica al sistema di instradare il traffico definito secondo le impostazioni specificate all'interno di quella policy.

source: ``Sticky`` option: The sticky option of a rule ensures that traffic originating from the same source IP always exits through the same WAN for a duration of 10 minutes. This can prevent issues when connecting to websites of banks, insurance companies, etc. This option is typically used for HTTPS traffic (443/TCP).
it: Opzione ``Sticky``: L'opzione sticky di una regola garantisce che il traffico proveniente dallo stesso IP di origine esca sempre attraverso la stessa WAN per una durata di 10 minuti. Questo può prevenire problemi durante la connessione a siti web di banche, compagnie assicurative, ecc. Questa opzione viene tipicamente utilizzata per il traffico HTTPS (443/TCP).

source: The following are the available options for defining traffic ports:
it: Le seguenti sono le opzioni disponibili per definire le porte di traffico:

source: ``<port>``: Single port
it: ``<port>``: Porta singola

source: ``<port>,<port>``: List of ports
it: ``<porta>,<porta>``: Elenco di porte

source: ``<port>-<endport>``: Range from <port> to <endport>
it: ``<port>-<endport>``: Intervallo da <port> a <endport>

source: General settings
it: Impostazioni generali

source: NethSecurity monitors each WAN connection using repeated ICMP tests.
it: NethSecurity monitora ciascuna connessione WAN utilizzando test ICMP ripetuti.

source: The ``General settings`` page allow users to specify the following parameters:
it: La pagina ``Impostazioni generali`` consente di specificare i seguenti parametri:

source: List of hosts to monitor: users can define a list of hosts (computers, servers, or devices) that the system will monitor for connectivity status. These hosts are checked to ensure they are reachable via the network.
it: Elenco degli host da monitorare: è possibile definire un elenco di host (computer, server o dispositivi) che il sistema monitorerà per lo stato di connettività. Questi host vengono controllati per garantire che siano raggiungibili tramite la rete.

source: Number of ICMP packets (pings) to send: users can set the number of ICMP (Internet Control Message Protocol) packets to be sent during each monitoring test. By setting the number of packets, users can control the intensity of the monitoring.
it: Numero di pacchetti ICMP (ping) da inviare: è possibile impostare il numero di pacchetti ICMP (Internet Control Message Protocol) da inviare durante ciascun test di monitoraggio. Impostando il numero di pacchetti, si può controllare l'intensità del monitoraggio.

source: Determining unreachability after how many failed tests: users can configure the system to determine when a WAN connection should be considered unreachable. This is done by specifying a threshold - after how many consecutive failed tests the WAN connection is deemed unreachable.
it: Determinazione dell'irraggiungibilità dopo quanti test falliti: è possibile configurare il sistema per stabilire quando una connessione WAN deve essere considerata irraggiungibile. Questo viene fatto specificando una soglia, ovvero dopo quanti test consecutivi falliti la connessione WAN viene considerata irraggiungibile.

source: Reset configuration
it: Reset configurazione

source: This will effectively reset the MultiWAN configuration, with a loss of Internet connection if no WAN is configured.
it: Questo reimposterà effettivamente la configurazione MultiWAN, con una perdita della connessione Internet se nessuna WAN è configurata.

source: If your firewall was previously configured with two or more WAN interfaces and after reconfiguration there is only one WAN interface, it is recommended to reset the MultiWAN configuration. This will ensure that your firewall is properly configured and functioning as intended.
it: Se il firewall era stato precedentemente configurato con due o più interfacce WAN e, dopo la riconfigurazione, è presente solo una interfaccia WAN, si consiglia di reimpostare la configurazione MultiWAN. In questo modo si garantirà che il firewall sia configurato correttamente e funzioni come previsto.

source: Specify traffic type: define the criteria for the traffic you want to customize. This can include the source IP address, destination IP address, specific protocols, ports, or any combination of these factors. By specifying these parameters, you narrow down the scope of the rule to a specific type of traffic. With the ``Source address`` and ``Destination address`` fields, you can pick from the following options:
it: Specificare il tipo di traffico: definire i criteri per il traffico che si desidera personalizzare. Questo può includere l'indirizzo IP sorgente, l'indirizzo IP di destinazione, protocolli specifici, porte o qualsiasi combinazione di questi fattori. Specificando questi parametri, si restringe l'ambito della regola a uno specifico tipo di traffico. Con i campi ``Indirizzo sorgente`` e ``Indirizzo di destinazione``, è possibile scegliere tra le seguenti opzioni:
