Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/nat.po
Languages: it

source: Network Address Translation (NAT) is used to modify network address information in packet headers while in transit. NAT primarily enables the translation of private IP addresses used within a local network to a public IP address, allowing multiple devices within the local network to share a single public IP when accessing the internet. As default, all hosts within the local network access the WAN using the firewall are using masquerade. Masquerade is a form of NAT that automatically assigns the source IP address of outgoing packets to the WAN IP address of the firewall. This ensures that internal hosts accessing the internet appear to external servers as if they are originating from the firewall's public IP address.
it: Il Network Address Translation (NAT) viene utilizzata per modificare le informazioni sugli indirizzi di rete negli header dei pacchetti durante il transito. Il NAT consente principalmente la traduzione degli indirizzi IP privati utilizzati all'interno di una rete locale in un indirizzo IP pubblico, permettendo a più dispositivi all'interno della rete locale di condividere un unico IP pubblico quando accedono a Internet. Per impostazione predefinita, tutti gli host all'interno della rete locale che accedono alla WAN tramite il firewall utilizzano il masquerade. Il masquerade è una forma di NAT che assegna automaticamente l'indirizzo IP di origine dei pacchetti in uscita all'indirizzo IP WAN del firewall. Questo garantisce che gli host interni che accedono a Internet appaiano ai server esterni come se provenissero dall'indirizzo IP pubblico del firewall.

source: Access the ``NAT`` page under the ``Firewall`` section, this page is organized in two tabs: ``Rules and NETMAP`` and ``NAT helpers``.
it: Accedere alla pagina ``NAT`` nella sezione ``Firewall``; questa pagina è organizzata in due schede: ``Regole e NETMAP`` e ``NAT helper``.

source: ``Rules and NETMAP`` tab allows to configure the following types of NAT rules:
it: La scheda ``Regole e NETMAP`` consente di configurare i seguenti tipi di regole NAT:

source: :ref:`Accept (disable NAT) <disable_nat-section>`
it: :ref:`Accetta (disabilita NAT) <disable_nat-section>`

source: Please note that these NAT rules are applied to all network protocols.
it: Si noti che queste regole NAT vengono applicate a tutti i protocolli di rete.

source: You can configure also destination NAT rules (DNAT), usually namedport forward or port redirects, from the :ref:`port forward <port_forward-section>` page.
it: È possibile configurare anche le regole di NAT di destinazione (DNAT), solitamente chiamate port forward o port redirects, dalla pagina :ref:`port forward <port_forward-section>`.

source: ``NAT helpers`` tab allows to enable or disable NAT helpers:
it: La scheda ``NAT helper`` consente di abilitare o disabilitare i NAT helper:

source: :ref:`NAT helpers <helpers-section>`
it: :ref:`NAT helper <helpers-section>`

source: Source NAT, often referred to as SNAT, modifies the source IP address of outgoing packets. It is commonly used in networks where private IP addresses are translated into a single public IP address when communicating with external networks. SNAT ensures that responses from external servers are routed back to the correct internal device by modifying the source IP address of outgoing packets to the public IP address. This allows multiple internal devices to access the internet using a shared public IP address, enhancing security and scalability.
it: Il Source NAT, spesso indicato come SNAT, modifica l'indirizzo IP di origine dei pacchetti in uscita. Viene comunemente utilizzato nelle reti in cui gli indirizzi IP privati vengono tradotti in un singolo indirizzo IP pubblico durante la comunicazione con reti esterne. SNAT garantisce che le risposte dai server esterni vengano instradate correttamente al dispositivo interno appropriato modificando l'indirizzo IP di origine dei pacchetti in uscita con l'indirizzo IP pubblico. Questo consente a più dispositivi interni di accedere a Internet utilizzando un indirizzo IP pubblico condiviso, migliorando la sicurezza e la scalabilità.

source: **Example** You have a small business with two public IP addresses provided by your internet service provider (ISP). You want to use one of these IPs (1.2.3.4) specifically for your internal mail server (192.168.1.33) to improve its reputation and sender authentication. The other IP address will be used for general internet access.
it: **Esempio** Si dispone di una piccola azienda con due indirizzi IP pubblici forniti dal proprio provider di servizi Internet (ISP). Si desidera utilizzare uno di questi IP (1.2.3.4) specificamente per il server di posta interno (192.168.1.33) al fine di migliorarne la reputazione e l'autenticazione del mittente. L'altro indirizzo IP verrà utilizzato per l'accesso generale a Internet.

source: **Problem** By default, all outgoing traffic from your network uses the same WAN IP, including your mail server This can negatively impact the reputation of your mail server, as spammers often use shared IPs. Additionally, you might require specific configurations for the mail server that differ from other internet traffic.
it: **Problema** Per impostazione predefinita, tutto il traffico in uscita dalla rete utilizza lo stesso IP WAN, incluso il mail server. Questo può influire negativamente sulla reputazione del mail server, poiché gli spammer spesso utilizzano IP condivisi. Inoltre, potrebbero essere necessarie configurazioni specifiche per il mail server diverse da quelle per il resto del traffico internet.

source: **Solution** Configure the alias IP (1.2.3.4) on your WAN interface, then create a SNAT (Static Network Address Translation) rule in your firewall to direct all outgoing traffic from your mail server to the dedicated public IP address. The rule should contain the internal IP address of your mail server (192.168.1.33) as the source and the dedicated public IP (1.2.3.4) address as the translation address, outbound zone must be set to WAN; select SNAT as action.
it: **Soluzione** Configurare l'IP alias (1.2.3.4) sull'interfaccia WAN, quindi creare una regola SNAT (Static Network Address Translation) nel firewall per indirizzare tutto il traffico in uscita dal mail server verso l'indirizzo IP pubblico dedicato. La regola deve contenere l'indirizzo IP interno del mail server (192.168.1.33) come sorgente e l'indirizzo IP pubblico dedicato (1.2.3.4) come indirizzo di traduzione; la zona di uscita deve essere impostata su WAN; selezionare SNAT come azione.

source: **Result** All outbound traffic originating from your mail server will now be translated to the dedicated public IP address. This improves the reputation of your mail server and allows for specific configurations tailored to its needs. General internet traffic will continue to use the other public IP address.
it: **Risultato** Tutto il traffico in uscita proveniente dal server di posta verrà ora tradotto sull'indirizzo IP pubblico dedicato. Questo migliora la reputazione del server di posta e consente configurazioni specifiche adattate alle sue esigenze. Il traffico internet generale continuerà a utilizzare l'altro indirizzo IP pubblico.

source: Source NAT in a MultiWAN scenario
it: Source NAT in uno scenario MultiWAN

source: If you have multiple WANs and your SNAT rule rewrites to one of the public WAN IPs, you need to create a MultiWAN rule in addition to the SNAT rule. This rule will route traffic from the source IP address through the right WAN with the public IP address.
it: Se sono presenti più WAN e la regola SNAT riscrive su uno degli IP pubblici WAN, è necessario creare una regola MultiWAN oltre alla regola SNAT. Questa regola instraderà il traffico dall'indirizzo IP sorgente attraverso la WAN corretta con l'indirizzo IP pubblico.

source: If you haven't set this up yet, add a custom policy that includes only the relevant WAN. Then, create a rule to apply this custom policy for traffic originating from the internal IP address (source address) to any destination and protocol.
it: Se non è stato ancora configurato, aggiungere una policy personalizzata che includa solo la WAN pertinente. Successivamente, creare una regola per applicare questa policy personalizzata al traffico proveniente dall'indirizzo IP interno (indirizzo sorgente) verso qualsiasi destinazione e protocollo.

source: The masquerade rule masks all outgoing traffic with the IP address of the firewall's outbound interface. Traffic from internal hosts to the Internet are automatically masqueraded by the firewall. Masquerade can also be used to mask traffic originating from a remote network (e.g., VPN) with the firewall's IP to avoid any routing issues.
it: La regola di masquerade maschera tutto il traffico in uscita con l'indirizzo IP dell'interfaccia di uscita del firewall. Il traffico proveniente dagli host interni verso Internet viene automaticamente mascherato dal firewall. Masquerade può anche essere utilizzato per mascherare il traffico proveniente da una rete remota (ad esempio, VPN) con l'IP del firewall per evitare eventuali problemi di routing.

source: **Example** You need to reach a host on the local network (routed) from the VPN network (e.g. 192.168.7.0/24), but the host doesn't have a configured gateway or has a different gateway than the firewall.
it: **Esempio** È necessario raggiungere un host sulla rete locale (instradata) dalla rete VPN (ad es. 192.168.7.0/24), ma l'host non ha un gateway configurato oppure ha un gateway diverso dal firewall.

source: **Problem** The host cannot reach the local device due to the lack of a gateway.
it: **Problema** L'host non può raggiungere il dispositivo locale a causa dell'assenza di un gateway.

source: **Solution** Create a NAT rule with masquerade action for the traffic coming from the VPN Network. This masks the traffic from the VPN network (192.168.7.0/24) to the local network with the firewall's IP of the destination interface. The rule should contain the VPN network (192.168.7.0/24) as the source and the internal host network (192.168.1.0/24) as the destination address, outbound zone can be left empty; select MASQUERADE as action.
it: **Soluzione** Creare una regola NAT con azione di mascheramento per il traffico proveniente dalla VPN Network. Questo maschera il traffico dalla VPN network (192.168.7.0/24) verso la rete locale utilizzando l'indirizzo IP del firewall dell'interfaccia di destinazione. La regola deve contenere la VPN network (192.168.7.0/24) come sorgente e la rete interna degli host (192.168.1.0/24) come indirizzo di destinazione; la zona di uscita può essere lasciata vuota; selezionare MASQUERADE come azione.

source: **Result** The host can reach the local device (e.g. 192.168.1.78) as if it originated from the firewall.
it: **Risultato** L'host può raggiungere il dispositivo locale (ad esempio 192.168.1.78) come se la connessione provenisse dal firewall.

source: ACCEPT (disable NAT)
it: ACCEPT (disabilita NAT)

source: An ACCEPT rule disables the NAT (no-NAT) and allows you to bypass the NAT process for specific traffic. This is particularly useful when it comes to avoiding WAN masquerading for specific destinations.
it: Una regola ACCEPT disabilita il NAT (no-NAT) e consente di bypassare il processo NAT per traffico specifico. Questo è particolarmente utile quando si desidera evitare il masquerading WAN per destinazioni specifiche.

source: **Example** Your firewall is connected to a router that, in addition to allowing internet access, also enables reaching private networks through CDN connections or IPsec tunnels. In order to reach private remote networks, traffic from local network must come out with its original IP address (no masquerade rewriting).
it: **Esempio** Il firewall è collegato a un router che, oltre a consentire l'accesso a Internet, permette anche di raggiungere reti private tramite connessioni CDN o tunnel IPsec. Per poter raggiungere le reti private remote, il traffico proveniente dalla rete locale deve uscire con il proprio indirizzo IP originale (senza riscrittura tramite masquerade).

source: **Problem** The router tunnel policies only allow traffic between the NethSecurity local network and the destination networks, but all traffic comes out of the firewall with the masked IP (NethSecurity WAN IP). Due to masquerading, direct communication between the NethSecurity LAN and the remote network is not possible.
it: **Problema** Le policy dei tunnel del router consentono il traffico solo tra la rete locale di NethSecurity e le reti di destinazione, ma tutto il traffico esce dal firewall con l’IP mascherato (IP WAN di NethSecurity). A causa del masquerading, la comunicazione diretta tra la LAN di NethSecurity e la rete remota non è possibile.

source: **Solution**: Create a NAT (Network Address Translation) rule with ACCEPT in your firewall. This rule avoid masquerading for all the traffic towards the CDN network, keeping the local source IP address unchanged. The rule should contain the internal network (192.168.1.0./24) as the source and the CDN network (192.168.50.0/24) as the destination address.
it: **Soluzione**: Creare una regola NAT (Network Address Translation) con ACCEPT nel firewall. Questa regola evita il masquerading per tutto il traffico verso la rete CDN, mantenendo invariato l'indirizzo IP sorgente locale. La regola dovrebbe includere la rete interna (192.168.1.0/24) come sorgente e la rete CDN (192.168.50.0/24) come indirizzo di destinazione.

source: Netmap is a NAT technique that offers 1:1 network-wide translation without changing the individual host addresses. This means it could map an entire private network (e.g., 192.168.1.0/24) to a another network (e.g., 10.5.6.0/24) at once, eliminating the need to manually configure individual NAT rules for each device.
it: Netmap è una tecnica NAT che offre una traduzione 1:1 a livello di rete senza modificare gli indirizzi dei singoli host. Questo significa che può mappare un'intera rete privata (ad esempio, 192.168.1.0/24) su un'altra rete (ad esempio, 10.5.6.0/24) in un'unica operazione, eliminando la necessità di configurare manualmente regole NAT individuali per ogni dispositivo.

source: **Example** 2 firewalls, FW-A and FW-B holding a VPN tunnel between networks A and B, local and remote networks are overlapping (192.168.1.0/24), so this makes it impossible to route traffic between them. Translate A and B networks onto two alternative networks can solve the problem so that there are no overlapping networks.
it: **Esempio** 2 firewall, FW-A e FW-B, mantengono un tunnel VPN tra le reti A e B; le reti locali e remote si sovrappongono (192.168.1.0/24), il che rende impossibile instradare il traffico tra di esse. Tradurre le reti A e B su due reti alternative può risolvere il problema, evitando così la sovrapposizione delle reti.

source: Let's use this translation scheme.
it: Utilizziamo questo schema di traduzione.

source: Network A: 192.168.1.0/24 -> is translated to -> Network ALT_A: 10.1.1.0/24
it: Rete A: 192.168.1.0/24 -> viene tradotta in -> Rete ALT_A: 10.1.1.0/24

source: Network B: 192.168.1.0/24 -> is translated to -> Network ALT_B: 10.2.2.0/24
it: Rete B: 192.168.1.0/24 -> viene tradotta in -> Rete ALT_B: 10.2.2.0/24

source: A host in network A trying to reach a host in network B must not contact the real IP but its translated network (only the last octet remains the same). For example, the host 192.168.1.10 from the network A wanting to reach 192.168.0.20 in network B must contact the IP 10.2.2.20 instead. Before the request exits firewall FW-A, the source of the packet will be rewritten by FW-A to the ALT_IP 10.1.1.10 to eliminate every routing issue on network B. The inverse process will occur for the returning packets.
it: Un host nella rete A che tenta di raggiungere un host nella rete B non deve contattare il vero IP, ma il suo indirizzo di rete tradotto (solo l’ultimo ottetto rimane invariato). Ad esempio, l’host 192.168.1.10 della rete A che vuole raggiungere 192.168.0.20 nella rete B deve invece contattare l’IP 10.2.2.20. Prima che la richiesta esca dal firewall FW-A, la sorgente del pacchetto verrà riscritta da FW-A come ALT_IP 10.1.1.10 per eliminare qualsiasi problema di routing nella rete B. Il processo inverso avverrà per i pacchetti di ritorno.

source: **Solution** The problem can be solved by using netmap to translate the traffic to a different private network. This allows the traffic to be routed correctly.
it: **Soluzione** Il problema può essere risolto utilizzando netmap per tradurre il traffico verso una rete privata diversa. Questo consente al traffico di essere instradato correttamente.

source: **How to do it**
it: **Come fare**

source: To allow network A to access a resource in network B, two rules are necessary: one for source netmap and one for destination netmap.
it: Per consentire alla rete A di accedere a una risorsa nella rete B, sono necessarie due regole: una per il netmap di origine e una per il netmap di destinazione.

source: The first rule, acting as a source netmap, specifies that all traffic directed towards the network 10.2.2.0/24 (destination network) and originating from the network 192.168.1.0/24 (source network) will be mapped onto the network 10.1.1.0/24 (mapped source network).
it: La prima regola, che agisce come una source netmap, specifica che tutto il traffico diretto verso la rete 10.2.2.0/24 (rete di destinazione) e proveniente dalla rete 192.168.1.0/24 (rete sorgente) verrà mappato sulla rete 10.1.1.0/24 (rete sorgente mappata).

source: The second rule functions as a destination netmap, playing a crucial role in correctly receiving responses. It necessitates that traffic originating from the network 10.2.2.0/24 (source network) and destined for the network 10.1.1.0/24 (destination network) will be mapped onto the network 192.168.1.0/24 (mapped destination network).
it: La seconda regola funziona come una destination netmap, svolgendo un ruolo cruciale nel ricevere correttamente le risposte. È necessario che il traffico proveniente dalla rete 10.2.2.0/24 (rete sorgente) e destinato alla rete 10.1.1.0/24 (rete di destinazione) venga mappato sulla rete 192.168.1.0/24 (rete di destinazione mappata).

source: **Result** All traffic requests (and their responses) from network A to network B will be routed correctly.
it: **Risultato** Tutte le richieste di traffico (e le relative risposte) dalla rete A alla rete B verranno instradate correttamente.

source: If you need to allow requests starting from network B toward network A you must do the same in the firewall B.
it: Se è necessario consentire le richieste dalla rete B verso la rete A, è necessario fare lo stesso nel firewall B.

source: Source netmap
it: Netmap sorgente

source: The "source netmap" allows us to determine how the source should change when traffic is directed towards a specific destination. E.g., destination network 10.2.2.0/24, source network: 192.168.0.0/24, natted source network: 10.1.1.0/24.
it: La "source netmap" consente di determinare come deve cambiare la sorgente quando il traffico è diretto verso una destinazione specifica. Ad esempio, rete di destinazione 10.2.2.0/24, rete sorgente: 192.168.0.0/24, rete sorgente nattata: 10.1.1.0/24.

source: You can create a source netmap rule from the web interface inside the ``NAT`` page. On the lower part of the page, click on the :guilabel:`Add source NETMAP` button to create a new rule. Inside the drawer, fill the fields as follows:
it: È possibile creare una regola di source netmap dall'interfaccia web all'interno della pagina ``NAT``. Nella parte inferiore della pagina, fare clic sul pulsante :guilabel:`Aggiungi NETMAP sorgente` per creare una nuova regola. All'interno del drawer, compilare i campi come segue:

source: **Name**: a name for the rule
it: **Nome**: un nome per la regola

source: **Destination network**: the destination network in CIDR notation, e.g., 10.2.2.0/24 for the example above
it: **Rete di destinazione**: la rete di destinazione in notazione CIDR, ad esempio 10.2.2.0/24 per l'esempio sopra

source: **Source network**: the source network, e.g., 192.168.1.0/24
it: **Rete di origine**: la rete di origine, ad esempio 192.168.1.0/24

source: **Mapped network**: the translated source network, e.g., 10.1.1.0/24
it: **Rete mappata**: la rete di origine tradotta, ad esempio 10.1.1.0/24

source: Under the ``Advanced settings`` section, you can specify the input and output devices for the rule. If the device is not specified, the rule will be applied to all devices.
it: Nella sezione ``Impostazioni avanzate``, è possibile specificare i dispositivi di input e output per la regola. Se il dispositivo non viene specificato, la regola verrà applicata a tutti i dispositivi.

source: Destination Netmap
it: Netmap destinazione

source: The "destination netmap" allows us to determine how the destination IP should change when traffic comes from a specific network. E.g., source network 10.2.2.0/24, destination network: 10.1.1.0/24, natted destination network: 192.168.0.0/24.
it: La "destination netmap" consente di determinare come deve cambiare l'IP di destinazione quando il traffico proviene da una rete specifica. Ad esempio, rete sorgente 10.2.2.0/24, rete di destinazione: 10.1.1.0/24, rete di destinazione natted: 192.168.0.0/24.

source: You can create a destination netmap rule from the web interface inside the ``NAT`` page. On the lower part of the page, click on the :guilabel:`Add destination NETMAP` button to create a new rule. Inside the drawer, fill the fields as follows:
it: È possibile creare una regola di destination netmap dall'interfaccia web all'interno della pagina ``NAT``. Nella parte inferiore della pagina, fare clic sul pulsante :guilabel:`Aggiungi NETMAP destinazione` per creare una nuova regola. All'interno del drawer, compilare i campi come segue:

source: **Source network**: the source network in CIDR notation, e.g., 10.2.2.0/24
it: **Rete di origine**: la rete di origine in notazione CIDR, ad esempio 10.2.2.0/24

source: **Destination network**: the destination network, e.g., 10.1.1.0/24
it: **Rete di destinazione**: la rete di destinazione, ad esempio 10.1.1.0/24

source: **Mapped network**: the translated destination network, e.g., 192.168.1.0/24
it: **Rete mappata**: la rete di destinazione tradotta, ad esempio 192.168.1.0/24

source: CLI commands
it: Comandi CLI

source: To create a SOURCE netmap rule from CLI ::
it: Per creare una regola netmap SOURCE dalla CLI ::

source: you can also specify optional in/out devices this way::
it: è anche possibile specificare dispositivi di input/output opzionali in questo modo::

source: Then commit and apply::
it: Quindi eseguire il commit e applicare::

source: To create a DESTINATION netmap rule from CLI ::
it: Per creare una regola netmap DESTINATION dalla CLI ::

source: NAT helpers
it: Helper NAT

source: NAT helpers are mechanisms designed to facilitate communication for certain protocols that may encounter issues when used with basic NAT. Some common protocols, such as FTP, SIP, or H.323, embed IP addresses or port numbers within the data payload, which can create problems with standard NAT.
it: I NAT helper sono meccanismi progettati per facilitare la comunicazione di alcuni protocolli che possono incontrare problemi quando utilizzati con il NAT di base. Alcuni protocolli comuni, come FTP, SIP o H.323, inseriscono indirizzi IP o numeri di porta all'interno del payload dei dati, il che può creare problemi con il NAT standard.
