Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/nat.po
Languages: it

source: NAT helpers, also known as Application Layer Gateways (ALGs), operate at the application layer. Their main role is to modify protocol-specific data, such as embedded IP addresses or ports within packets, ensuring that these protocols function properly when passing through NAT.
it: I NAT helper, noti anche come Application Layer Gateway (ALG), operano a livello applicativo. Il loro ruolo principale è modificare i dati specifici del protocollo, come indirizzi IP o porte incorporati nei pacchetti, garantendo che questi protocolli funzionino correttamente durante il transito attraverso il NAT.

source: For example, in FTP, NAT helpers modify the IP addresses and ports inside the FTP control and data packets, enabling proper NAT traversal for FTP connections. Similarly, NAT helpers for SIP and other protocols ensure that devices using these protocols can establish connections across NAT boundaries without issues.
it: Ad esempio, in FTP, i NAT helper modificano gli indirizzi IP e le porte all'interno dei pacchetti di controllo e dati FTP, consentendo una corretta attraversamento NAT per le connessioni FTP. Allo stesso modo, i NAT helper per SIP e altri protocolli garantiscono che i dispositivi che utilizzano questi protocolli possano stabilire connessioni attraverso i confini NAT senza problemi.

source: NethSecurity provides various types of NAT helpers, all of which are disabled by default. If needed, specific helpers can be enabled via the web UI.
it: NethSecurity fornisce diversi tipi di NAT helper, tutti disabilitati per impostazione predefinita. Se necessario, è possibile abilitare specifici helper tramite l'interfaccia web.

source: During helper configuration, the interface may display certain parameters typical of the involved protocol. These parameters are pre-filled with the most commonly used default values. Since the parameters depend on the protocol type, they vary in both number and type depending on the helper (some helpers do not display any parameters).
it: Durante la configurazione dell'helper, l'interfaccia può mostrare alcuni parametri tipici del protocollo coinvolto. Questi parametri sono precompilati con i valori predefiniti più comunemente utilizzati. Poiché i parametri dipendono dal tipo di protocollo, variano sia per numero che per tipologia a seconda dell'helper (alcuni helper non mostrano alcun parametro).

source: After any changes, the firewall will notify you if a reboot is necessary. This typically happens when a helper is disabled or modified (if it is already active).
it: Dopo qualsiasi modifica, il firewall notificherà se è necessario un riavvio. Questo avviene tipicamente quando un helper viene disabilitato o modificato (se è già attivo).

source: When certain helpers are enabled, related helpers are automatically loaded in the kernel as dependencies. For example if ``nf_nat_ftp`` is enabled, the related helper ``nf_conntrack_ftp`` will be automatically loaded in the kernel. For that helper the web UI will display ``Loaded`` with an informational icon to notify the user.
it: Quando alcuni helper sono abilitati, gli helper correlati vengono caricati automaticamente nel kernel come dipendenze. Ad esempio, se ``nf_nat_ftp`` è abilitato, l'helper correlato ``nf_conntrack_ftp`` verrà caricato automaticamente nel kernel. Per quell'helper, l'interfaccia web mostrerà ``Caricato`` con un'icona informativa per notificare l'utente.
