Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/netify_informatics.po
Languages: it

source: `Netify Informatics <https://www.netify.ai/products/netify-informatics>`_ is a third-party cloud service that utilizes analytics and AI to convert local DPI metadata obtained from NethSecurity into high-level network intelligence. The solution provides insights into various aspects of network activity, including:
it: `Netify Informatics <https://www.netify.ai/products/netify-informatics>`_ è un servizio cloud di terze parti che utilizza l'analisi e l'intelligenza artificiale per convertire i metadati DPI locali ottenuti da NethSecurity in informazioni di rete di alto livello. La soluzione fornisce approfondimenti su vari aspetti dell'attività di rete, tra cui:

source: `Bandwidth Monitoring <https://www.netify.ai/products/netify-informatics/bandwidth-monitoring>`_
it: `Monitoraggio della larghezza di banda <https://www.netify.ai/products/netify-informatics/bandwidth-monitoring>`_

source: `Risk and Reputation Analysis <https://www.netify.ai/products/netify-informatics/risk-and-reputation>`_
it: `Analisi del Rischio e della Reputazione <https://www.netify.ai/products/netify-informatics/risk-and-reputation>`_

source: Geolocation
it: Geolocalizzazione

source: Audit and Forensics
it: Audit e Forensics

source: The service receives data from netifyd, the NethSecurity DPI engine which is enabled by default on the firewall.
it: Il servizio riceve dati da netifyd, il motore DPI di NethSecurity che è abilitato per impostazione predefinita sul firewall.

source: You can try the service for free for 7 days. After this period, you can choose the plan that best fits your needs.
it: È possibile provare il servizio gratuitamente per 7 giorni. Al termine di questo periodo, si può scegliere il piano che meglio si adatta alle proprie esigenze.

source: See `Netify Informatics Pricing <https://www.netify.ai/products/netify-informatics/pricing>`_ and `Netify Informatics FAQ <https://www.netify.ai/resources/faq>`_ for more information.
it: Consultare `Netify Informatics Pricing <https://www.netify.ai/products/netify-informatics/pricing>`_ e `Netify Informatics FAQ <https://www.netify.ai/resources/faq>`_ per ulteriori informazioni.

source: Before getting started
it: Prima di iniziare

source: Make sure to create an account on the Netify Informatics website, you can try the service for free for 7 days. Register here: `Netify Registration <https://portal.netify.ai/register>`_
it: Assicurarsi di creare un account sul sito web di Netify Informatics; è possibile provare il servizio gratuitamente per 7 giorni. Registrarsi qui: `Netify Registration <https://portal.netify.ai/register>`_

source: You can granularly manage different customers, different locations of the same customer, and even different firewalls within the same location. The platform is organized with these elements.
it: È possibile gestire in modo granulare clienti diversi, sedi diverse dello stesso cliente e persino firewall diversi all'interno della stessa sede. La piattaforma è organizzata con questi elementi.

source: **Organization** : an organization is essentially a customer where we have at least one NethSecurity firewall, multiple organizations are supported.
it: **Organizzazione** : un'organizzazione è essenzialmente un cliente presso cui è presente almeno un firewall NethSecurity; sono supportate più organizzazioni.

source: **Site**: the same organization (customer) might have an office in Rome, Florence, and Paris. A site is defined for each physical location to isolate the data, multiple sites are supported.
it: **Sito**: la stessa organizzazione (cliente) potrebbe avere un ufficio a Roma, Firenze e Parigi. Un sito è definito per ciascuna sede fisica per isolare i dati; sono supportati più siti.

source: **Agent**: the agent represents your customer's NethSecurity unit. Netify supports multiple agents per site. If you have a simple network, one agent will likely see all traffic flows on a site's network.
it: **Agente**: l'agente rappresenta l'unità NethSecurity del cliente. Netify supporta più agenti per sito. In una rete semplice, è probabile che un solo agente rilevi tutti i flussi di traffico sulla rete di un sito.

source: Connect NethSecurity to Netify Informatics
it: Collegare NethSecurity a Netify Informatics

source: Two steps are required to use the service:
it: Sono necessari due passaggi per utilizzare il servizio:

source: Enable metadata sending from NethSecurity
it: Abilitare l'invio dei metadati da NethSecurity

source: Provision an agent on Netify Informatics.
it: Effettuare il provisioning di un agente su Netify Informatics.

source: It's mandatory to configure data sending on NethSecurity **first** and then provision the agent on the platform.
it: È obbligatorio configurare prima l'invio dei dati su NethSecurity **e solo successivamente** effettuare il provisioning dell'agente sulla piattaforma.

source: 1. Enable metadata sending
it: 1. Abilitare l'invio dei metadati

source: Access the ``Netify Informatics`` page under the ``Monitoring`` section in the NethSecurity web interface.
it: Accedere alla pagina ``Netify Informatics`` nella sezione ``Monitoraggio`` dell'interfaccia web di NethSecurity.

source: Enable the ``Send metadata to Netify Informatics`` option and click on ``Save``.
it: Abilitare l'opzione ``Invia i metadati dei flussi di rete a Netify Informatics`` e fare clic su ``Salva``.

source: Each NethSecurity is associated with a unique Agent UUID, something like this `B3-GV-WQ-SD`. The code will be visible on the same page after enabling the send metadata option.
it: Ogni NethSecurity è associato a un UUID univoco dell'Agent, simile a questo `B3-GV-WQ-SD`. Il codice sarà visibile nella stessa pagina dopo aver abilitato l'opzione :guilabel:`Invia metadati`.

source: 2. Provision the agent
it: 2. Effettuare il provisioning dell'agente

source: Once you have a registered account and enabled the metadata sending on NethSecurity, you can provision the agent on the Netify Informatics platform:
it: Una volta che si dispone di un account registrato e si è abilitato l'invio dei metadati su NethSecurity, è possibile effettuare il provisioning dell'agente sulla piattaforma Netify Informatics:

source: Copy the code obtained in the previous step and login to the Netify Informatics website.
it: Copia il codice ottenuto nel passaggio precedente ed effettua l'accesso al sito web di Netify Informatics.

source: Access the ``Provision Agent Wizard`` inside ``Deployment`` section.
it: Accedere alla ``Provision Agent Wizard`` all'interno della sezione ``Deployment``.

source: Follow the instructions to create the organization (the customer) and paste the Agent UUID in the appropriate field to enable the agent using the code obtained on NethSecurity.
it: Seguire le istruzioni per creare l'organizzazione (il cliente) e incollare l'UUID dell'Agent nel campo appropriato per abilitare l'agent utilizzando il codice ottenuto su NethSecurity.

source: From this moment, Netify Informatics will start showing the data. You can then connect other firewalls of the same customer (same organization, same site or a different one) or create a new organization for a different customer.
it: Da questo momento, Netify Informatics inizierà a mostrare i dati. È possibile quindi collegare altri firewall dello stesso cliente (stessa organizzazione, stesso sito o uno diverso) oppure creare una nuova organizzazione per un cliente differente.

source: The ``Deployment`` section inside Netify Informatics allows you to manage Agents, Sites, and Organizations. While the management of Agents and Sites is relatively straightforward, the ``Organization Access`` section enables you to add additional members to your organization. This feature allows others to access the Netify panel and view all relevant data.
it: La sezione ``Deployment`` all'interno di Netify Informatics consente di gestire Agent, Site e Organization. Mentre la gestione di Agent e Site è relativamente semplice, la sezione ``Organization Access`` permette di aggiungere ulteriori membri all'organizzazione. Questa funzionalità consente ad altri utenti di accedere al pannello Netify e visualizzare tutti i dati pertinenti.

source: There are three available profiles:
it: Sono disponibili tre profili:

source: Administrator
it: Amministratore

source: Viewer
it: Visualizzatore

source: The ``Administrator`` profile, typically reserved for colleagues within your company, grants the highest level of permissions, allowing them to view, create, and modify configurations within Netify Informatics.
it: Il profilo ``Administrator``, tipicamente riservato ai colleghi all'interno della propria azienda, concede il livello più alto di permessi, consentendo di visualizzare, creare e modificare le configurazioni all'interno di Netify Informatics.

source: The ``Manager`` profile is dedicated to individuals who belong to the same organization (the customer company). It grants them permission to view all sections inside Netify Informatics, see the deployment dashboard and edit the Identity manager section, but not to add other organizations or provision new agents.
it: Il profilo ``Manager`` è dedicato agli individui che appartengono alla stessa organizzazione (l'azienda cliente). Consente di visualizzare tutte le sezioni all'interno di Netify Informatics, vedere la dashboard di distribuzione e modificare la sezione :guilabel:`Identity manager`, ma non permette di aggiungere altre organizzazioni o effettuare il provisioning di nuovi agent.

source: The ``Viewer`` profile, likely the most commonly used, is for someone (e.g., an IT technician from your customer’s organization) who can view all data within their organization but does not have the ability to modify any Netify configurations.
it: Il profilo ``Viewer``, probabilmente il più comunemente utilizzato, è destinato a chi (ad esempio, un tecnico IT dell'organizzazione del cliente) può visualizzare tutti i dati all'interno della propria organizzazione ma non ha la possibilità di modificare alcuna configurazione di Netify.

source: To invite someone, simply click on ``Manage Organization``, enter their email address, and choose the desired profile. The person will receive an invite from Netify by email and will be able to create their own account.
it: Per invitare qualcuno, è sufficiente fare clic su ``Manage Organization``, inserire il loro indirizzo email e scegliere il profilo desiderato. La persona riceverà un invito da Netify tramite email e potrà creare il proprio account.

source: The profile type can be changed at any time by an administrator, allowing you to switch a person from Manager to Viewer, for example.
it: Il tipo di profilo può essere modificato in qualsiasi momento da un amministratore, consentendo ad esempio di passare una persona da ``Manager`` a ``Viewer``.
