Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/network.po
Languages: it

source: Network interfaces
it: Interfacce di rete

source: The ``Interfaces and devices`` page configures how the server is connected to the local network (LAN) and/or other networks (i.e. Internet).
it: La pagina ``Interfacce e dispositivi`` configura come il server è collegato alla rete locale (LAN) e/o ad altre reti (ad esempio Internet).

source: NethSecurity supports an unlimited number of network interfaces. Any network managed by the system must follow these rules:
it: NethSecurity supporta un numero illimitato di interfacce di rete. Qualsiasi rete gestita dal sistema deve seguire queste regole:

source: networks must be logically separated: each network must have different addresses
it: le reti devono essere separate logicamente: ogni rete deve avere indirizzi diversi

source: private networks, like LANs, must follow address's convention from :ref:`RFC1918 <RFC1918-section>` document
it: le reti private, come le LAN, devono seguire la convenzione degli indirizzi dal documento :ref:`RFC1918 <RFC1918-section>`

source: networks should be physically separated using different switches or logically separated using VLAN (Virtual Local Area Network)
it: le reti devono essere separate fisicamente utilizzando switch diversi oppure separate logicamente utilizzando VLAN (Virtual Local Area Network)

source: Every network interface has a specific zone which determines its behavior. A basic network setup for a router typically includes a minimum of two interfaces, namely LAN (Local Area Network) and WAN (Wide Area Network):
it: Ogni interfaccia di rete ha una zona specifica che ne determina il comportamento. Una configurazione di rete di base per un router include tipicamente almeno due interfacce, ovvero LAN (Local Area Network) e WAN (Wide Area Network):

source: *lan*: local network, hosts on this network can access any other configured network
it: *lan*: rete locale, gli host su questa rete possono accedere a qualsiasi altra rete configurata

source: *wan*: public network, hosts on this network can access only the server itself
it: *wan*: rete pubblica, gli host su questa rete possono accedere solo al server stesso

source: All configured network interfaces are listed at the top of the page. Each interface is displayed with its name and the assigned firewall zone. This section offers an immediate overview of the current configurations, allowing users to quickly see which networks are already set up and associated with specific security zones.
it: Tutte le interfacce di rete configurate sono elencate nella parte superiore della pagina. Ogni interfaccia viene visualizzata con il proprio nome e la zona firewall assegnata. Questa sezione offre una panoramica immediata delle configurazioni attuali, permettendo di vedere rapidamente quali reti sono già configurate e associate a specifiche zone di sicurezza.

source: In the bottom section of the page, available but unconfigured network devices are listed. To configure a device, the user clicks on the :guilabel:`Configure` button corresponding to the desired device. The newly created :ref:`VLAN devices <vlan-section>` are visible in this section.
it: Nella sezione inferiore della pagina sono elencati i dispositivi di rete disponibili ma non configurati. Per configurare un dispositivo, si fa clic sul pulsante :guilabel:`Configura` corrispondente al dispositivo desiderato. I nuovi :ref:`dispositivi VLAN <vlan-section>` creati sono visibili in questa sezione.

source: IPv4 addresses for private networks (RFC1918)
it: Indirizzi IPv4 per reti private (RFC1918)

source: TCP/IP private networks not directly connected to Internet should use special addresses selected by Internet Assigned Numbers Authority (IANA).
it: Le reti private TCP/IP non direttamente connesse a Internet dovrebbero utilizzare indirizzi speciali selezionati dall'Internet Assigned Numbers Authority (IANA).

source: Private network
it: Rete privata

source: Subnet mask
it: Maschera di sottorete

source: IP addresses interval
it: Intervallo di indirizzi IP

source: Logical interfaces
it: Interfacce logiche

source: Logical network interfaces are virtual network interfaces that allow for additional flexibility and functionality in networking setups. Unlike physical network interfaces, which correspond to actual hardware ports, logical network interfaces are software-based and can be configured and managed to suit specific networking requirements.
it: Le interfacce di rete logiche sono interfacce di rete virtuali che consentono una maggiore flessibilità e funzionalità nelle configurazioni di rete. A differenza delle interfacce di rete fisiche, che corrispondono a porte hardware reali, le interfacce di rete logiche sono basate su software e possono essere configurate e gestite per soddisfare requisiti di rete specifici.

source: Click on the :guilabel:`Add logical interface` button to create a new virtual network device. The device can be a
it: Fare clic sul pulsante :guilabel:`Aggiungi interfaccia logica` per creare un nuovo dispositivo di rete virtuale. Il dispositivo può essere un

source: *bridge*: it is a logical network interface that connects two or more different network segments, allowing communication between devices in these segments. A bridge effectively extends the local network, enabling devices to communicate as if they were on the same physical network.
it: *bridge*: è un'interfaccia di rete logica che collega due o più segmenti di rete differenti, consentendo la comunicazione tra dispositivi presenti in questi segmenti. Un bridge estende di fatto la rete locale, permettendo ai dispositivi di comunicare come se fossero sulla stessa rete fisica.

source: *bond*: also known as network bonding or NIC bonding, is a method of combining two or more physical network interfaces into a single logical interface. It provides two primary benefits: increased bandwidth and fault tolerance.
it: *bond*: noto anche come network bonding o NIC bonding, è un metodo che consente di combinare due o più interfacce di rete fisiche in un'unica interfaccia logica. Offre due vantaggi principali: aumento della larghezza di banda e tolleranza ai guasti.

source: Balance Round Robin (recommended)
it: Round Robin bilanciato (consigliato)

source: Balance XOR
it: Bilanciamento XOR

source: 802.3ad (LACP): it requires support at driver level and a switch with IEEE 802.3ad Dynamic link aggregation mode enabled
it: 802.3ad (LACP): richiede il supporto a livello di driver e uno switch con la modalità di aggregazione dinamica dei collegamenti IEEE 802.3ad abilitata

source: Balance TLB: it requires support at driver level
it: Bilancia TLB: richiede il supporto a livello di driver

source: Balance ALB
it: Bilanciare ALB

source: Modes providing fault tolerance only:
it: Modalità che forniscono solo tolleranza ai guasti:

source: Active backup (recommended)
it: Backup attivo (consigliato)

source: Broadcast policy
it: Politica di trasmissione

source: When creating a bond, the UI will display a management IP address in the private network 127.x.x.1/32. This IP address is used solely for managing the bond and is not involved in traffic forwarding. Once the bond device is created, you can assign an IP address and a firewall zone to it. Please note that bond configuration is not editable after creation. If you need to modify the bond's IP address or zone, you'll have to remove its configuration and reconfigure it again. If you need to change bond devices, bond mode or management IP you'll have to remove bond configuration and bond device and recreate it from scratch
it: Durante la creazione di un bond, l'interfaccia utente mostrerà un indirizzo IP di gestione nella rete privata 127.x.x.1/32. Questo indirizzo IP viene utilizzato esclusivamente per la gestione del bond e non è coinvolto nell'inoltro del traffico. Una volta creato il dispositivo bond, è possibile assegnargli un indirizzo IP e una zona firewall. Si noti che la configurazione del bond non è modificabile dopo la creazione. Se è necessario modificare l'indirizzo IP o la zona del bond, sarà necessario rimuovere la sua configurazione e riconfigurarla nuovamente. Se è necessario modificare i dispositivi del bond, la modalità del bond o l'IP di gestione, sarà necessario rimuovere la configurazione del bond e il dispositivo bond e ricrearlo da zero.

source: A VLAN, or Virtual Local Area Network, is a network technology that allows network administrators to create logically segmented networks within a physical network infrastructure. VLANs enable the creation of multiple broadcast domains in a network, even though they are physically connected to the same network switch.
it: Una VLAN, o Virtual Local Area Network, è una tecnologia di rete che consente agli amministratori di rete di creare reti logicamente segmentate all'interno di un'infrastruttura di rete fisica. Le VLAN permettono la creazione di più domini di broadcast in una rete, anche se sono fisicamente collegati allo stesso switch di rete.

source: You can create a new VLAN device by clicking the :guilabel:`Create VLAN device` button. Select the VLAN device type:
it: È possibile creare un nuovo dispositivo VLAN facendo clic sul pulsante :guilabel:`Crea dispositivo VLAN`. Selezionare il tipo di dispositivo VLAN:

source: VLAN 802.1q is primarily used for standard VLAN implementations within organizations
it: VLAN 802.1q è utilizzato principalmente per implementazioni VLAN standard all'interno delle organizzazioni

source: 802.1ad (QinQ) is used in service provider networks where multiple customers require VLAN segmentation, and these segmented VLANs need to be transported across the provider's network
it: 802.1ad (QinQ) viene utilizzato nelle reti dei provider di servizi dove più clienti richiedono la segmentazione VLAN, e queste VLAN segmentate devono essere supportate anche nella rete del provider

source: Make sure also to chose correct VLAN ID. Please bear in mind that you must setup the same VLAN ID inside the network switch.
it: Assicurarsi inoltre di scegliere l'ID VLAN corretto. Si ricorda che è necessario configurare lo stesso ID VLAN anche all'interno dello switch di rete.

source: IP aliasing
it: Alias IP

source: Use IP aliasing to assign more IP addresses to the same network interface.
it: Utilizzare l'IP aliasing per assegnare più indirizzi IP alla stessa interfaccia di rete.

source: The most common use is with a wan interface: when the ISP provides a pool of public IP addresses (within the same subnet) you can add some (or all) of them to the same wan interface and manage them individually (e.g. in the port forward configuration).
it: L'uso più comune è con un'interfaccia wan: quando l'ISP fornisce un pool di indirizzi IP pubblici (all'interno della stessa subnet), è possibile aggiungerne alcuni (o tutti) alla stessa interfaccia wan e gestirli individualmente (ad esempio nella configurazione dell'inoltro porte).

source: To add an alias, click the tree-dots menu :guilabel:`⋮` on right corner of the existing network interface, then select :guilabel:`Create alias interface` item.
it: Per aggiungere un alias, fare clic sul menu con i tre puntini :guilabel:`⋮` nell'angolo destro dell'interfaccia di rete esistente, quindi selezionare la voce :guilabel:`Crea interfaccia alias`.

source: PPPoE (Point-to-Point Protocol over Ethernet) connects the server to Internet through a DSL modem. Users can setup a new PPPoE connection using an unassigned Ethernet network interface or creating a new logical interface.
it: PPPoE (Point-to-Point Protocol over Ethernet) collega il server a Internet tramite un modem DSL. È possibile configurare una nuova connessione PPPoE utilizzando un'interfaccia di rete Ethernet non assegnata oppure creando una nuova interfaccia logica.

source: Inside the network interface window, choose the wan zone then, select the ``PPPoE`` protocol. Then fill all required fields like ``Username`` and ``Password``.
it: All'interno della finestra dell'interfaccia di rete, scegliere la zona wan, quindi selezionare il protocollo ``PPPoE``. Successivamente, compilare tutti i campi richiesti come ``Nome utente`` e ``Password``.

source: PPPoE with DHCPv6-PD
it: PPPoE con DHCPv6-PD

source: DHCPv6 Prefix Delegation (DHCPv6-DP) automates the assignment of IPv6 prefixes from your internet service provider (ISP). It eliminates the need for manual configuration or Network Address Translation (NAT), simplifying IPv6 deployment.
it: La DHCPv6 Prefix Delegation (DHCPv6-PD) automatizza l'assegnazione dei prefissi IPv6 da parte del proprio provider di servizi Internet (ISP). Elimina la necessità di configurazione manuale o di Network Address Translation (NAT), semplificando la distribuzione di IPv6.

source: First, make sure your ISP supports DHCPv6-PD, than follow these steps:
it: Per prima cosa, assicurarsi che il proprio ISP supporti DHCPv6-PD, quindi seguire questi passaggi:

source: Configure WAN Interface: set the WAN interface mode to PPPoE and enable the ``Enable IPv6`` option
it: Configurare l'interfaccia WAN: impostare la modalità dell'interfaccia WAN su PPPoE e abilitare l'opzione ``Abilita IPv6``

source: Configure LAN interface: enable the "Enable IPv6" option and leave the IPv6 address field blank
it: Configurare l'interfaccia LAN: abilitare l'opzione :guilabel:`Enable IPv6` e lasciare vuoto il campo dell'indirizzo IPv6

source: By enabling IPv6 for both WAN and LAN interfaces without specifying an address for the LAN, your router will automatically request and receive an IPv6 prefix (usually a /64) from your ISP through DHCPv6-PD. This prefix will then be used to assign individual IPv6 addresses to devices on your network.
it: Abilitando IPv6 sia per le interfacce WAN che LAN senza specificare un indirizzo per la LAN, il router richiederà e riceverà automaticamente un prefisso IPv6 (di solito un /64) dal proprio ISP tramite DHCPv6-PD. Questo prefisso verrà poi utilizzato per assegnare indirizzi IPv6 individuali ai dispositivi sulla rete.

source: USB-to-Ethernet Adapters
it: Adattatori USB-Ethernet

source: USB-to-Ethernet adapters are not considered suitable for use in a firewall device that is critical to network communication, for this reason the drivers are not included in the NethSecurity image. Only for experimental purposes, specific drivers can be installed via the package manager for use in a test environment.
it: Gli adattatori USB-Ethernet non sono considerati adatti all'uso in un dispositivo firewall critico per la comunicazione di rete; per questo motivo i driver non sono inclusi nell'immagine di NethSecurity. Solo a scopo sperimentale, è possibile installare driver specifici tramite il gestore dei pacchetti per l'utilizzo in un ambiente di test.

source: Extra packages, including kernel modules, are not preserved across image upgrades, so in the event of an upgrade, you will need to download and install them again if needed.
it: I pacchetti aggiuntivi, inclusi i moduli del kernel, non vengono mantenuti durante gli aggiornamenti dell'immagine; pertanto, in caso di aggiornamento, sarà necessario scaricarli e installarli nuovamente se necessario.

source: How to install USB-to-Ethernet modules
it: Come installare moduli USB-to-Ethernet

source: These packages can be installed from the command line console, just find the correct module and install it.
it: Questi pacchetti possono essere installati dalla console della riga di comando, è sufficiente individuare il modulo corretto e installarlo.

source: Verify the ethernet adapter is connected to USB using ``lsusb``.Output example:
it: Verificare che l'adattatore ethernet sia collegato alla porta USB utilizzando ``lsusb``. Esempio di output:

source: Search for the the kernel module:
it: Cercare il modulo kernel:

source: Output example:
it: Esempio di output:

source: Install the right driver:
it: Installare il driver corretto:

source: Verify a new ethX interface appears using ``ifconfig -a``
it: Verificare che venga visualizzata una nuova interfaccia ethX utilizzando ``ifconfig -a``

source: Configure the ethernet from the UI
it: Configurare l'ethernet dall'interfaccia utente

source: Bonds can be configured in multiple modes.
it: I bond possono essere configurati in modalità multiple.

source: Modes providing load balancing and fault tolerance:
it: Modalità che forniscono bilanciamento del carico e tolleranza ai guasti:

source: It is strongly recommended **not to use these adapters in production environments**. If the unit has an Enterprise or Community subscription, bear in mind that USB-to-Ethernet adapters **are not covered by Nethesis support**.
it: Si raccomanda vivamente **di non utilizzare questi adattatori in ambienti di produzione**. Se l'unità dispone di un abbonamento Enterprise o Community, si tenga presente che gli adattatori USB-to-Ethernet **non sono coperti dal supporto Nethesis**.
