Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/objects.po
Languages: it

source: Entered domains will be resolved to IPv4 or IPv6 accordingly to the selected IP version
it: I domini inseriti verranno risolti in IPv4 o IPv6 in base alla versione IP selezionata.

source: If you need to create a domain set for both IP versions, you will need to create separate sets for each
it: Se è necessario creare un domain set per entrambe le versioni IP, sarà necessario creare set separati per ciascuna.

source: Add domains:
it: Aggiungere domini:

source: In the ``Domains`` field, you can add the domains for this set
it: Nel campo ``Domini``, è possibile aggiungere i domini per questo set

source: Enter domain names in the provided field
it: Inserire i nomi di dominio nel campo fornito

source: After entering each domain, click :guilabel:`Add domain` to include it in the set
it: Dopo aver inserito ciascun dominio, fare clic su :guilabel:`Aggiungi dominio` per includerlo nell'insieme.

source: Repeat this process to add multiple domains as needed
it: Ripetere questo processo per aggiungere più domini secondo necessità

source: Finalize the Domain Set:
it: Finalizzare il Domain Set:

source: If you need to remove a domain, use the delete (trash can) icon next to it
it: Se è necessario rimuovere un dominio, utilizzare l'icona di eliminazione (cestino) accanto ad esso

source: Once you're satisfied with your domain set configuration, click :guilabel:`Add domain set` to create it
it: Una volta soddisfatti della configurazione del domain set, fare clic su :guilabel:`Aggiungi domain set` per crearlo

source: improved organization and readability of your firewall configuration
it: organizzazione e leggibilità migliorate della configurazione del firewall
