Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/objects.po
Languages: it

source: Firewall objects
it: Oggetti firewall

source: Firewall objects are predefined sets of network addresses that can be used to streamline and simplify your firewall configuration. These objects allow you to group related IP addresses, networks, or domain names into reusable units, making it easier to create and maintain firewall rules, port forwards, and other network policies.
it: Gli oggetti firewall sono insiemi predefiniti di indirizzi di rete che possono essere utilizzati per semplificare e ottimizzare la configurazione del firewall. Questi oggetti consentono di raggruppare indirizzi IP, reti o nomi di dominio correlati in unità riutilizzabili, facilitando la creazione e la gestione di regole firewall, port forwarding e altre policy di rete.

source: Advantages of using firewall objects include:
it: I vantaggi dell'utilizzo degli oggetti firewall includono:

source: reduced chance of errors when entering IP addresses or networks manually
it: probabilità ridotta di errori durante l'inserimento manuale di indirizzi IP o reti

source: easier maintenance - updating an object automatically updates all associated rules
it: manutenzione più semplice - l'aggiornamento di un oggetto aggiorna automaticamente tutte le regole associate

source: more efficient rule management, especially for complex networks
it: gestione delle regole più efficiente, soprattutto per reti complesse

source: Firewall objects are particularly useful when you have multiple rules that reference the same set of addresses or when you frequently need to modify groups of addresses. However, for simple configurations with only a few static rules, using objects may not be necessary and could add unnecessary complexity.
it: Gli oggetti firewall sono particolarmente utili quando sono presenti più regole che fanno riferimento allo stesso insieme di indirizzi o quando è necessario modificare frequentemente gruppi di indirizzi. Tuttavia, per configurazioni semplici con solo alcune regole statiche, l'utilizzo degli oggetti potrebbe non essere necessario e potrebbe aggiungere complessità non necessaria.

source: The system provides several types of firewall objects:
it: Il sistema fornisce diversi tipi di oggetti firewall:

source: static Leases (DHCP Reservations): static IP assignments for specific devices
it: Lease statici (DHCP Reservation): assegnazioni IP statiche per dispositivi specifici

source: DNS Records: domain names associated with specific IP addresses
it: Record DNS: nomi di dominio associati a indirizzi IP specifici

source: VPN Users: users with reserved IP addresses from OpenVPN Road Warrior
it: Utenti VPN: utenti con indirizzi IP riservati da OpenVPN Road Warrior

source: Host Sets: groups of IP addresses, networks, or ranges
it: Sost set: gruppi di indirizzi IP, reti o intervalli

source: Domain Sets: collections of domain names that resolve to IP addresses
it: Domain set: raccolte di nomi di dominio che si risolvono in indirizzi IP

source: Static Leases
it: Lease statici

source: :ref:`Static leases <static_leases-section>`, also known as DHCP reservations, allow you to assign fixed IP addresses to specific devices on your network. This feature combines the convenience of DHCP with the stability of static IP addressing.
it: :ref:`Lease statici <static_leases-section>`, note anche come DHCP reservations, permettono di assegnare indirizzi IP fissi a dispositivi specifici sulla rete. Questa funzionalità unisce la comodità del DHCP con la stabilità dell’assegnazione statica degli indirizzi IP.

source: Key benefits:
it: Vantaggi principali:

source: ensures devices always receive the same IP address
it: garantisce che i dispositivi ricevano sempre lo stesso indirizzo IP

source: allows you to associate easy-to-remember hostnames with devices
it: consente di associare nomi host facili da ricordare ai dispositivi

source: simplifies network management and troubleshooting
it: semplifica la gestione e la risoluzione dei problemi della rete

source: A static lease consists of:
it: Un lease statico consiste in:

source: hostname: A recognizable name for the device
it: hostname: Un nome riconoscibile per il dispositivo

source: IP address: The fixed IP you want to assign (must be within the DHCP range)
it: Indirizzo IP: L'IP fisso che si desidera assegnare (deve essere all'interno dell'intervallo DHCP)

source: MAC address: The unique hardware identifier of the device
it: Indirizzo MAC: L'identificatore hardware univoco del dispositivo

source: DNS Records
it: Record DNS

source: :ref:`DNS records <dns_records-section>` allow you to create local hostname-to-IP address mappings. These local records take precedence over external DNS queries, giving you more control over name resolution on your network.
it: :ref:`Record DNS <dns_records-section>` consentono di creare associazioni locali tra nomi host e indirizzi IP. Questi record locali hanno la precedenza sulle query DNS esterne, offrendo un maggiore controllo sulla risoluzione dei nomi nella rete.

source: A DNS record includes:
it: Un record DNS include:

source: hostname: The domain name you want to resolve locally
it: hostname: Il nome di dominio che si desidera risolvere localmente

source: IP address: The corresponding IP address for the hostname
it: Indirizzo IP: L'indirizzo IP corrispondente per il nome host

source: Use cases for local DNS records:
it: Casi d'uso per i record DNS locali:

source: create shortcuts to internal resources (e.g., "intranet.mycompany.local")
it: creare collegamenti rapidi a risorse interne (ad esempio, ``intranet.mycompany.local``)

source: override external DNS for testing or security purposes
it: ignorare il DNS esterno per scopi di test o di sicurezza

source: set up custom domain names for local services
it: impostare nomi di dominio personalizzati per i servizi locali

source: By utilizing static leases and local DNS records, you can create a more organized and easily manageable network environment. These features work seamlessly with other firewall objects like host sets, providing you with powerful tools for network administration.
it: Utilizzando lease statici e record DNS locali, è possibile creare un ambiente di rete più organizzato e facilmente gestibile. Queste funzionalità funzionano perfettamente con altri oggetti del firewall come gli host set, offrendo strumenti potenti per l'amministrazione della rete.

source: For detailed instructions on how to create and manage static leases and DNS records, please refer to the :ref:`DHCP and DNS configuration chapters <dns_dhcp-section>`.
it: Per istruzioni dettagliate su come creare e gestire lease statici e record DNS, fare riferimento ai :ref:`capitoli di configurazione DHCP e DNS <dns_dhcp-section>`.

source: VPN Users
it: Utenti VPN

source: :ref:`OpenVPN users <openvpn_roadwarrior-section>` with IP reservations can be used as firewall objects, enabling user-specific network access control. This feature applies to both local and remote (LDAP) users configured for OpenVPN access.
it: Gli utenti :ref:`OpenVPN <openvpn_roadwarrior-section>` con riserva di IP possono essere utilizzati come oggetti firewall, consentendo il controllo dell’accesso alla rete specifico per utente. Questa funzionalità si applica sia agli utenti locali che remoti (LDAP) configurati per l’accesso OpenVPN.

source: Key points:
it: Punti chiave:

source: each user can be assigned a specific OpenVPN IP address
it: a ciascun utente può essere assegnato un indirizzo IP OpenVPN specifico

source: these users can be referenced in firewall rules as source or destination
it: questi utenti possono essere referenziati nelle regole del firewall come origine o destinazione

source: applies to both local and remote (LDAP) users
it: si applica sia agli utenti locali che a quelli remoti (LDAP)

source: allows for creation of user-specific access policies
it: consente la creazione di politiche di accesso specifiche per l'utente

source: Use cases:
it: Casi d'uso:

source: restrict OpenVPN users to specific network resources
it: limitare gli utenti OpenVPN a specifiche risorse di rete

source: create user-based allow/deny lists
it: creare elenchi di autorizzazione/negazione basati sull'utente

source: implement time-based access policies for remote users
it: implementare politiche di accesso basate sul tempo per utenti remoti

source: monitor and control per-user bandwidth usage
it: monitorare e controllare l'utilizzo della banda per utente

source: Requirements:
it: Requisiti:

source: user has OpenVPN access enabled
it: l'utente ha l'accesso OpenVPN abilitato

source: a specific IP address is reserved for the user
it: un indirizzo IP specifico è riservato per l'utente

source: By using OpenVPN users as firewall objects, you can create a more secure network environment with access policies tied directly to user identities.
it: Utilizzando gli utenti OpenVPN come oggetti firewall, è possibile creare un ambiente di rete più sicuro con politiche di accesso direttamente collegate alle identità degli utenti.

source: Host Sets
it: Host set

source: Host sets are versatile firewall objects that allow you to group multiple IP addresses, networks, or ranges into a single, easily manageable unit. These sets can be used in various firewall rules, simplifying the process of controlling traffic for multiple destinations or sources.
it: I set host sono oggetti firewall versatili che consentono di raggruppare più indirizzi IP, reti o intervalli in un'unica unità facilmente gestibile. Questi set possono essere utilizzati in diverse regole firewall, semplificando il processo di controllo del traffico per più destinazioni o sorgenti.

source: Key features of host sets:
it: Caratteristiche principali dei host set:

source: IP version support:
it: Supporto versione IP:

source: available for both IPv4 and IPv6 addresses
it: disponibile sia per indirizzi IPv4 che IPv6

source: each host set is specific to one IP version
it: ogni host set è specifico per una versione IP

source: Flexible content, Host sets can include:
it: Contenuto flessibile, i host set possono includere:

source: individual IP addresses
it: indirizzi IP individuali

source: network ranges in CIDR notation
it: intervalli di rete in notazione CIDR

source: IP ranges
it: Intervalli IP

source: DHCP reservations
it: Prenotazioni DHCP

source: DNS record names
it: Nomi dei record DNS

source: VPN users (for IPv4 only)
it: Utenti VPN (solo per IPv4)

source: Easy management:
it: Gestione semplice:

source: create, modify, or delete host sets without directly editing firewall rules
it: creare, modificare o eliminare host set senza modificare direttamente le regole del firewall

source: changes to a host set automatically apply to all rules using that set
it: le modifiche a un host set si applicano automaticamente a tutte le regole che utilizzano quel set

source: group company servers for access control
it: raggruppare i server aziendali per il controllo degli accessi

source: create allow or deny lists for specific network segments
it: creare elenchi di autorizzazione o negazione per segmenti di rete specifici

source: manage remote access for multiple VPN users
it: gestire l'accesso remoto per più utenti VPN

source: Host sets are fully supported in their expressive completeness (IP, CIDR, range, groupings) within firewall rules. Other pages might only support a reduced subset, for example, MultiWAN only supports single IP addresses and CIDR. In such cases, only compatible host sets will be displayed in the dropdowns when using the object inside the rule.
it: Gli host set sono pienamente supportati nella loro completezza espressiva (IP, CIDR, intervallo, raggruppamenti) all'interno delle regole del firewall. Altre pagine potrebbero supportare solo un sottoinsieme ridotto; ad esempio, MultiWAN supporta solo indirizzi IP singoli e CIDR. In questi casi, nei menu a discesa verranno visualizzati solo gli host set compatibili quando si utilizza l'oggetto all'interno della regola.

source: Manage Host Sets
it: Gestione degli host set

source: Access the ``Objects`` page under the ``User and objects`` section from the left sidebar menu, then navigate to the ``Host sets`` tab.
it: Accedere alla pagina ``Oggetti`` nella sezione ``Utenti e oggetti`` dal menu laterale sinistro, quindi navigare nella scheda ``Host set``.

source: The page will display a list of existing host sets, including their names, IP versions, and the number of records in each set.
it: La pagina visualizzerà un elenco degli host set esistenti, inclusi i loro nomi, le versioni IP e il numero di record in ciascun set.

source: Inside the list, you can also find hosts objects coming from other sections like:
it: All'interno dell'elenco, è possibile trovare anche oggetti host provenienti da altre sezioni come:

source: Static leases
it: Lease statici

source: DNS records
it: Record DNS

source: VPN users
it: Utenti VPN

source: These objects can be used in host sets to create more complex rules, but they cannot be edited directly from the host sets page.
it: Questi oggetti possono essere utilizzati negli host set per creare regole più complesse, ma non possono essere modificati direttamente dalla pagina degli host set.

source: When an object is not used in any host set nor in any firewall rule, it will be marked as ``unused`` in the list.
it: Quando un oggetto non viene utilizzato in alcun set host né in alcuna regola del firewall, verrà contrassegnato come ``non utilizzato`` nell'elenco.

source: To see where an object is used, click on the ``Show usages`` link next to the object.
it: Per vedere dove viene utilizzato un oggetto, fare clic sul collegamento ``Mostra utilizzi`` accanto all'oggetto.

source: Please note that used objects cannot be deleted until they are removed from all host sets and firewall rules.
it: Si noti che gli oggetti utilizzati non possono essere eliminati finché non vengono rimossi da tutti gli host set e dalle regole del firewall.

source: Add an Host Set
it: Aggiungere un Host Set

source: Access the ``Objects`` page under the ``User and objects`` section from the left sidebar menu.
it: Accedere alla pagina ``Oggetti`` nella sezione ``Uteenti ed oggetti`` dal menu laterale sinistro.

source: Navigate to the ``Host sets`` tab
it: Passare alla scheda ``Host set``

source: Click on :guilabel:`Add host set` button
it: Fare clic sul pulsante :guilabel:`Aggiungi host set`

source: Enter the Host Set name
it: Immettere il nome dell'Host Set

source: In the ``Name`` field, enter a descriptive name for your host set
it: Nel campo ``Nome``, inserire un nome descrittivo per il host set

source: Use only letters and numbers; spaces and special characters are not allowed
it: Utilizzare solo lettere e numeri; spazi e caratteri speciali non sono consentiti

source: Choose a name that clearly identifies the purpose of the group of hosts
it: Scegliere un nome che identifichi chiaramente lo scopo del gruppo di host

source: Select IP version
it: Selezionare la versione IP

source: Under ``IP version``, choose between IPv4 and IPv6
it: In ``Versione IP``, scegliere tra IPv4 e IPv6

source: Select IPv4 for standard internet protocol addresses
it: Selezionare IPv4 per gli indirizzi standard del protocollo Internet

source: Choose IPv6 if you're using the newer, expanded address format
it: Scegliere IPv6 se si utilizza il formato di indirizzo più recente ed esteso

source: Add Records
it: Aggiungere record

source: In the ``Records`` field, you can add the hosts for this set
it: Nel campo ``Record``, è possibile aggiungere gli host per questo set

source: Click the dropdown menu to choose from predefined options, or enter a custom value
it: Fare clic sul menu a discesa per scegliere tra le opzioni predefinite oppure inserire un valore personalizzato.

source: You can add the following types of records:
it: È possibile aggiungere i seguenti tipi di record:

source: Individual IP addresses (e.g., ``192.168.1.10``)
it: Indirizzi IP individuali (ad es., ``192.168.1.10``)

source: CIDR notation for networks (e.g., ``10.10.0.0/24``)
it: Notazione CIDR per le reti (ad es., ``10.10.0.0/24``)

source: IP ranges (e.g., ``10.10.1.1-10.10.1.5``)
it: Intervalli IP (ad es., ``10.10.1.1-10.10.1.5``)

source: Previously created objects
it: Oggetti creati in precedenza

source: After entering each record, click :guilabel:`Add record` to include it in the set
it: Dopo aver inserito ciascun record, fare clic su :guilabel:`Aggiungi record` per includerlo nell'insieme

source: Repeat this process to add multiple records as needed
it: Ripetere questo processo per aggiungere più record secondo necessità

source: Finalize the Host Set
it: Finalizzare gli Host set

source: Review all entered information for accuracy
it: Verificare che tutte le informazioni inserite siano corrette

source: If you need to remove a record, use the delete (trash can) icon next to it
it: Se è necessario rimuovere un record, utilizzare l'icona di eliminazione (cestino) accanto ad esso

source: Once you're satisfied with your host set configuration, click :guilabel:`Add host set` to create it
it: Una volta soddisfatti della configurazione dell'host set, fare clic su :guilabel:`Aggiungi host set` per crearlo.

source: If you need to start over or cancel the process, click :guilabel:`Cancel`
it: Se è necessario ricominciare da capo o annullare il processo, fare clic su :guilabel:`Annulla`

source: Domain Sets
it: Domain set

source: Domain sets are firewall objects that allow you to group multiple domain names into a single, manageable unit. These sets are particularly useful for creating rules based on web addresses rather than IP addresses, which can change frequently for many websites.
it: I domain set sono oggetti del firewall che consentono di raggruppare più nomi di dominio in un'unica unità gestibile. Questi set sono particolarmente utili per creare regole basate sugli indirizzi web anziché sugli indirizzi IP, che possono cambiare frequentemente per molti siti web.

source: Key features of domain sets:
it: Caratteristiche principali dei domain set:

source: DNS resolution:
it: Risoluzione DNS:

source: domain names in the set are automatically resolved to IP addresses
it: i nomi di dominio presenti nell'insieme vengono automaticamente risolti in indirizzi IP

source: resolution is periodically updated to ensure accuracy
it: la risoluzione viene aggiornata periodicamente per garantire l'accuratezza

source: can be configured for either IPv4 or IPv6
it: può essere configurato sia per IPv4 che per IPv6

source: each domain set is specific to one IP version
it: ogni domain set è specifico per una versione IP

source: Flexible content, domain sets can include:
it: Contenuto flessibile, i domain set possono includere:

source: fully qualified domain names (e.g., ``www.example.com``)
it: nomi di dominio completamente qualificati (ad es., ``www.example.com``)

source: wildcard domains (e.g., ``example.com``, will match all subdomains)
it: domini wildcard (ad esempio, ``example.com``, corrisponderà a tutti i sottodomini)

source: Automatic timeout:
it: Timeout automatico:

source: DNS records in the set are cached for a specified duration
it: I record DNS nel set vengono memorizzati nella cache per una durata specificata

source: an automatic refresh process updates the resolution periodically
it: un processo di aggiornamento automatico aggiorna periodicamente la risoluzione

source: create, modify, or delete domain sets without directly editing firewall rules
it: creare, modificare o eliminare insiemi di domini senza modificare direttamente le regole del firewall

source: changes to a domain set automatically apply to all rules using that set
it: le modifiche apportate a un domain set vengono applicate automaticamente a tutte le regole che utilizzano quel set

source: Use cases for domain sets:
it: Casi d'uso per i domain set:

source: application control: manage access to cloud services or social media platforms
it: controllo delle applicazioni: gestire l'accesso ai servizi cloud o alle piattaforme di social media

source: security: create allow rules for trusted domains
it: sicurezza: creare regole di autorizzazione per domini attendibili

source: malware prevention: create deny rules for known malicious domains
it: prevenzione malware: creare regole di negazione per domini noti come dannosi

source: Benefits of using domain sets:
it: Vantaggi dell'utilizzo dei domain set:

source: simplify management of rules based on web addresses
it: semplificare la gestione delle regole basate sugli indirizzi web

source: automatically handle IP address changes of websites
it: gestire automaticamente le modifiche degli indirizzi IP dei siti web

source: reduce the need for manual updates to firewall rules
it: ridurre la necessità di aggiornamenti manuali alle regole del firewall

source: provide a more intuitive way to control access to web-based services
it: fornire un modo più intuitivo per controllare l'accesso ai servizi basati sul web

source: When to use domain sets:
it: Quando utilizzare i domain set:

source: when you need to control access to websites that may change IP addresses
it: quando è necessario controllare l'accesso a siti web che potrebbero cambiare indirizzo IP

source: for implementing content filtering policies
it: per l'implementazione di politiche di filtraggio dei contenuti

source: when managing access to cloud services or web applications
it: quando si gestisce l'accesso ai servizi cloud o alle applicazioni web

source: for creating security policies based on domain reputation
it: per la creazione di criteri di sicurezza basati sulla reputazione del dominio

source: Manage Domain Sets
it: Gestire i domain set

source: Access the ``Objects`` page under the ``User and objects`` section from the left sidebar menu, then navigate to the ``Domain sets`` tab.
it: Accedere alla pagina ``Oggetti`` nella sezione ``Utenti e oggetti`` dal menu laterale sinistro, quindi navigare nella scheda ``Domain set``.

source: The page will display a list of existing domain sets, including their names, IP versions, and the number of domains in each set.
it: La pagina visualizzerà un elenco dei domain set esistenti, inclusi i loro nomi, le versioni IP e il numero di domini in ciascun set.

source: If a domain set is not used in any firewall rule, it will be marked as ``unused`` in the list. To see where a domain set is used, click on the ``Show usages`` link next to the set.
it: Se un insieme di domini non viene utilizzato in nessuna regola del firewall, verrà contrassegnato come ``non utilizzato`` nell'elenco. Per vedere dove viene utilizzato un insieme di domini, fare clic sul link ``Mostra utilizzi`` accanto all'insieme.

source: Add a Domain Set
it: Aggiungere un Domain Set

source: Access the Add Domain Set Interface
it: Accedere all'interfaccia Aggiungi insieme di domini

source: Access the ``Objects`` page under the ``User and objects`` section from the left sidebar menu
it: Accedere alla pagina ``Oggetti`` nella sezione ``Utenti e oggetti`` dal menu laterale sinistro

source: Navigate to the ``Domain sets`` tab
it: Passare alla scheda ``Domain set``

source: Click on :guilabel:`Add somain set` button
it: Fare clic sul pulsante :guilabel:`Aggiungi domain set`

source: Enter the Domain Set name:
it: Inserire il nome del Domain Set:

source: In the ``Name`` field, enter a descriptive name for your domain set
it: Nel campo ``Nome``, inserire un nome descrittivo per il domain set

source: Choose a name that clearly identifies the purpose of the group of domains
it: Scegliere un nome che identifichi chiaramente lo scopo del gruppo di domini

source: Select IP version:
it: Selezionare la versione IP:
