Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/openvpn_tunnels.po
Languages: it

source: OpenVPN tunnels
it: Tunnel OpenVPN

source: OpenVPN net-to-net tunnels establish secure connections between two separate networks, such as branch offices of a company, over the internet. These connections use SSL/TLS protocols for encryption and authentication, ensuring data confidentiality and integrity.
it: I tunnel net-to-net di OpenVPN stabiliscono connessioni sicure tra due reti separate, come ad esempio le filiali di un'azienda, tramite internet. Queste connessioni utilizzano i protocolli SSL/TLS per la cifratura e l'autenticazione, garantendo la riservatezza e l'integrità dei dati.

source: The connection is handled by 2 NethSecurity firewalls, each one has a specific role. When creating an OpenVPN net2net connection a firewall will have the server role whereas the other NethSecurity will connect to it as a client. One NethSecurity can be the same time server and client for different tunnels, all tunnels use OpenVPN routed mode.
it: La connessione è gestita da 2 firewall NethSecurity, ciascuno con un ruolo specifico. Quando si crea una connessione OpenVPN net2net, un firewall avrà il ruolo di server mentre l'altro NethSecurity si collegherà come client. Un NethSecurity può essere contemporaneamente server e client per tunnel differenti; tutti i tunnel utilizzano la modalità routed di OpenVPN.

source: The OpenVPN tunnels interface has been crafted for straightforward connection between two NethSecuirty devices. For this reason, it is deliberately limited and does not expose all the parameters that can be configured with OpenVPN to connect to any third-party device. To connect to a third-party device, it's recommended to use the IPsec protocol.
it: L'interfaccia dei tunnel OpenVPN è stata progettata per una connessione semplice tra due dispositivi NethSecurity. Per questo motivo, è volutamente limitata e non espone tutti i parametri che possono essere configurati con OpenVPN per collegarsi a un dispositivo di terze parti. Per connettersi a un dispositivo di terze parti, si consiglia di utilizzare il protocollo IPsec.

source: Configuration
it: Configurazione

source: To connect two firewalls via an OpenVPN tunnel, first configure the server firewall, then configure the client one. The server needs at least one public IP address to be reachable by the client, while the client may not even have public IPs. The configuration of the firewall server requires only a very few parameters, where possible all the parameters are already filled in automatically to avoid errors and speed up the process. Once the server firewall has been configured, it will be possible to download the client configuration to import onto the other firewall.
it: Per collegare due firewall tramite un tunnel OpenVPN, è necessario prima configurare il firewall server e successivamente quello client. Il server deve disporre di almeno un indirizzo IP pubblico per essere raggiungibile dal client, mentre il client può anche non avere indirizzi IP pubblici. La configurazione del firewall server richiede solo pochissimi parametri; ove possibile, tutti i parametri sono già compilati automaticamente per evitare errori e velocizzare il processo. Una volta configurato il firewall server, sarà possibile scaricare la configurazione client da importare sull’altro firewall.

source: Proceed as follows:
it: Procedere come segue:

source: Access the OpenVPN tunnels page, move to ``Server tunnel`` tab and click on :guilabel:`Add server tunnel`.
it: Accedere alla pagina dei tunnel OpenVPN, spostarsi sulla scheda ``Tunnel server`` e fare clic su :guilabel:`Aggiungi tunnel server`.

source: Insert all required fields, but please note:
it: Inserire tutti i campi obbligatori, ma si noti:

source: ``Public endpoints`` it's a list of IP addresses or hostnames that clients can use to reach the OpenVPN tunnel server
it: ``Endpoint pubblici`` è un elenco di indirizzi IP o nomi host che i client possono utilizzare per raggiungere il server tunnel OpenVPN

source: ``Local networks`` it's a list of local networks that will be accessible from the remote server. If topology is set to p2p, the same list will be reported inside the client ``Remote networks`` field
it: ``Reti locali`` è un elenco di reti locali che saranno accessibili dal server remoto. Se la topologia è impostata su p2p, lo stesso elenco verrà riportato nel campo ``Reti remote`` del client.

source: ``Remote networks``, it’s a list of networks behind the remote server which will be accessible from hosts in the local network
it: ``Reti remote``, è un elenco di reti dietro il server remoto che saranno accessibili dagli host nella rete locale

source: After the configuration is saved, click on the :guilabel:`Download` action and select ``Client configuration``
it: Dopo che la configurazione è stata salvata, fare clic sull'azione :guilabel:`Scarica` e selezionare ``Client configuration``

source: Access the client firewall, OpenVPN tunnel, move to ``Client tunnel`` tab, click on :guilabel:`Import configuration`
it: Accedere al firewall client, al tunnel OpenVPN, spostarsi nella scheda ``Tunnel client``, fare clic su :guilabel:`Importa configurazione`

source: Topology
it: Topologia

source: Tunnels can have two kinds of topologies: ``subnet`` and ``p2p`` (Point to Point).
it: I tunnel possono avere due tipi di topologie: ``subnet`` e ``p2p`` (Point to Point).

source: ``Subnet`` is the default topology and the recommended one: in ``subnet`` topology, the server will accept connections and will act as a DHCP server for every connected client.
it: ``Subnet`` è la topologia predefinita e quella consigliata: nella topologia ``subnet``, il server accetterà le connessioni e agirà come server DHCP per ogni client connesso.

source: In this scenario the server will authenticate clients using TLS certificates and will push local routes to remote client.
it: In questo scenario il server autenticherà i client utilizzando certificati TLS e invierà le route locali al client remoto.

source: In a ``p2p`` topology, the administrator must configure one server for each client, in this scenario the only supported authentication method is the PSK (Pre-Shared Key).
it: In una topologia ``p2p``, l'amministratore deve configurare un server per ciascun client; in questo scenario, l'unico metodo di autenticazione supportato è il PSK (Pre-Shared Key).

source: make sure to exchange the PSK using a secure channel (like SSH or HTTPS)
it: assicurarsi di scambiare il PSK utilizzando un canale sicuro (come SSH o HTTPS)

source: the administrator must select an IP for both endpoints
it: l'amministratore deve selezionare un IP per entrambi gli endpoint

source: routes to remote networks must be configured on each endpoint
it: le route verso le reti remote devono essere configurate su ciascun endpoint

source: Advanced features
it: Funzionalità avanzate

source: The web interface allows the configuration of advanced features like:
it: L'interfaccia web consente la configurazione di funzionalità avanzate come:

source: ``Multiple remote host``: multiple remote server addresses can be specified for redundancy; the OpenVPN client will try to connect to each host in the given order
it: ``Host remoto multipli``: è possibile specificare più indirizzi di server remoti per la ridondanza; il client OpenVPN tenterà di connettersi a ciascun host nell'ordine indicato

source: ``Protocol``: OpenVPN is designed to operate optimally over UDP, but TCP capability is provided for situations where UDP cannot be used
it: ``Protocollo``: OpenVPN è progettato per funzionare in modo ottimale su UDP, ma la compatibilità con TCP è prevista per situazioni in cui UDP non può essere utilizzato.

source: ``Compression``: if enabled, data to be sent through the VPN tunnel will be compressed. This option is disabled by default both for security reasons. Compression is rarely essential nowadays, as internet traffic is typically already highly compressed and optimized
it: ``Compressione``: se abilitata, i dati inviati attraverso il tunnel VPN verranno compressi. Questa opzione è disabilitata per impostazione predefinita anche per motivi di sicurezza. La compressione è raramente essenziale al giorno d'oggi, poiché il traffico internet è generalmente già altamente compresso e ottimizzato.

source: ``Digest``: the digest algorithm used to transform an arbitrarily large block of data into a fixed-size output. If not explicitly selected, the server and client will try to negotiate the best digest available on both sides
it: ``Digest``: l'algoritmo di digest utilizzato per trasformare un blocco di dati di dimensione arbitraria in un output di dimensione fissa. Se non viene selezionato esplicitamente, il server e il client tenteranno di negoziare il miglior digest disponibile su entrambi i lati.

source: ``Cipher``: the cryptographic algorithm used to encrypt all the traffic. If not explicitly selected, the server and client will try to negotiate the best cipher available on both sides
it: ``Cipher``: l'algoritmo crittografico utilizzato per cifrare tutto il traffico. Se non viene selezionato esplicitamente, il server e il client tenteranno di negoziare il miglior cipher disponibile su entrambi i lati.

source: ``Enforce a minimum TLS version``: Allows you to choose a minimum version of TLS, in which case connections will only be allowed from devices that use a version greater than or equal to the one selected
it: ``Imporre una versione minima di TLS``: Consente di scegliere una versione minima di TLS; in tal caso, saranno consentite solo le connessioni provenienti da dispositivi che utilizzano una versione uguale o superiore a quella selezionata.

source: MTU Issue and Packet Fragmentation
it: Problema MTU e Frammentazione dei Pacchetti

source: VPN users may experience connectivity issues due to packet fragmentation. The LAN interface has an MTU of 1500, but when packets are encrypted for VPN transmission, the size increases, leading to packet drops. To resolve this, the MTU on the OpenVPN tunnel must be lowered. No changes are required on the client side.
it: Gli utenti VPN possono riscontrare problemi di connettività a causa della frammentazione dei pacchetti. L'interfaccia LAN ha un MTU di 1500, ma quando i pacchetti vengono criptati per la trasmissione tramite VPN, la dimensione aumenta, causando la perdita di pacchetti. Per risolvere questo problema, è necessario abbassare l'MTU sul tunnel OpenVPN. Non sono richieste modifiche lato client.

source: Add the following option to the Roadwarrior server configuration::
it: Aggiungere la seguente opzione alla configurazione del server Roadwarrior::

source: The `tun_mtu` value may need to be adjusted based on your specific network environment. A lower MTU ensures that packets fit within the limits of the OpenVPN tunnel without fragmentation. Depending on factors like network latency or overhead, you might find that slightly different values work better for your setup.
it: Il valore di `tun_mtu` potrebbe dover essere regolato in base al proprio ambiente di rete specifico. Un MTU più basso garantisce che i pacchetti rientrino nei limiti del tunnel OpenVPN senza frammentazione. A seconda di fattori come la latenza di rete o l'overhead, potrebbe risultare che valori leggermente diversi funzionino meglio per la propria configurazione.
