Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/openvpn_roadwarrior.po
Languages: it

source: To download all history in CSV format, click on the button :guilabel:`Download server history`. The header of the CSV file explains the meaning of each column, including the units of measure.
it: Per scaricare tutta la cronologia in formato CSV, fare clic sul pulsante :guilabel:`Scarica la cronologia del server`. L'intestazione del file CSV spiega il significato di ciascuna colonna, incluse le unità di misura.

source: Once the server is rebooted, the local history is lost. If the server is connected to a :ref:`controller-section`, the history is sent to the controller and can be viewed inside the :ref:`historical_monitoring-section`.
it: Una volta che il server viene riavviato, la cronologia locale viene persa. Se il server è collegato a un :ref:`controller-section`, la cronologia viene inviata al controller e può essere visualizzata all'interno della sezione :ref:`historical_monitoring-section`.

source: An OpenVPN server is running on NethSecurity waiting for remote clients to contact it and establish a connection. It must be reachable from the internet on its specific port (default: ``1194/UDP``). Multiple clients can connect to the server, authenticate themselves and gain access to the private network; however, the clients do not need to be reachable on the internet. Each connecting client, after authentication, receives an IP address with which it will present itself to the remote network.
it: Un server OpenVPN è in esecuzione su NethSecurity in attesa che i client remoti lo contattino e stabiliscano una connessione. Deve essere raggiungibile da internet sulla sua porta specifica (predefinita: ``1194/UDP``). Più client possono connettersi al server, autenticarsi e ottenere l’accesso alla rete privata; non è necessario che i client siano raggiungibili da internet. Ogni client che si connette, dopo l’autenticazione, riceve un indirizzo IP con cui si presenterà alla rete remota.

source: ``Username, certificate and OTP``: the connecting client must provide a valid username, certificate and also an OTP code used as a password. This mode requires additional configuration in the client to receive to OTP code
it: ``Nome utente, certificato e OTP``: il client che si connette deve fornire un nome utente valido, un certificato e anche un codice OTP utilizzato come password. Questa modalità richiede una configurazione aggiuntiva nel client per ricevere il codice OTP.

source: ``NBDD [addr]``: set primary and secondary NetBIOS Datagram Distribution Server (NetBIOS over TCP/IP Datagram Distribution Server) addresses. Repeat the option to set multiple addresses.
it: ``NBDD [addr]``: imposta gli indirizzi del server di distribuzione datagrammi NetBIOS primario e secondario (NetBIOS over TCP/IP Datagram Distribution Server). Ripetere l'opzione per impostare più indirizzi.
