Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/openvpn_roadwarrior.po
Languages: it

source: Road Warrior refers to a specific configuration of the OpenVPN VPN tailored for remote users, allowing them secure access to a private network from anywhere on the internet. This setup is particularly useful for businesses and organizations with employees or collaborators spread across different locations, ensuring encrypted communication and data privacy.
it: Road Warrior si riferisce a una configurazione specifica di OpenVPN VPN pensata per utenti remoti, che consente loro di accedere in modo sicuro a una rete privata da qualsiasi luogo su Internet. Questa configurazione è particolarmente utile per aziende e organizzazioni con dipendenti o collaboratori distribuiti in diverse sedi, garantendo comunicazioni cifrate e la privacy dei dati.

source: OpenVPN is a protocol supported by the most widely used platforms, with :ref:`free clients <client_software-section>` available for Windows, MacOS, Linux, Android, and iOS systems.
it: OpenVPN è un protocollo supportato dalle piattaforme più diffuse, con :ref:`client gratuiti <client_software-section>` disponibili per sistemi Windows, MacOS, Linux, Android e iOS.

source: Before configuring the OpenVPN Road Warrior, make sure you have read the chapter related to the :ref:`user database <users_database-section>`.
it: Prima di configurare OpenVPN Road Warrior, assicurarsi di aver letto il capitolo relativo al :ref:`database utenti <users_database-section>`.

source: Server configuration
it: Configurazione del server

source: An OpenVPN server on NethSecurity is closely tied to a user database, which can be local or remote. The association with the database is defined during server creation and cannot be modified later.
it: Un server OpenVPN su NethSecurity è strettamente collegato a un database utenti, che può essere locale o remoto. L'associazione con il database viene definita durante la creazione del server e non può essere modificata successivamente.

source: The server configuration is straightforward because NethSecurity automatically sets most fields to sane defaults, which usually only need verification.
it: La configurazione del server è semplificata perché NethSecurity imposta automaticamente la maggior parte dei campi su valori predefiniti adeguati, che di solito richiedono solo una verifica.

source: To configure a new OpenVPN server, click :guilabel:`Create Server` button and configure the proposed fields:
it: Per configurare un nuovo server OpenVPN, fare clic sul pulsante :guilabel:`Crea server` e configurare i campi proposti:

source: ``Server name``: give a name to this OpenVPN server
it: ``Nome del server``: assegnare un nome a questo server OpenVPN

source: ``User database``: choose the user database to use for authentication, it can be a local database or a remote one (e.g. LDAP or Active Directory)
it: ``Database utenti``: scegliere il database utenti da utilizzare per l'autenticazione; può essere un database locale oppure uno remoto (ad esempio LDAP o Active Directory)

source: ``Create an account for each user``: this is a special field and won't be shown again in the future, it allows you to automatically create a VPN account for each user present in the database. All accounts created will have a certificate valid for 3650 days.
it: ``Crea un account per ogni utente``: questo è un campo speciale e non verrà mostrato nuovamente in futuro; consente di creare automaticamente un account VPN per ogni utente presente nel database. Tutti gli account creati avranno un certificato valido per 3650 giorni.

source: ``Mode``: bridged or routed; routed mode is the default one and the most common, it allows to create a virtual network where clients are connected to the server and can communicate with each other. Bridged mode is less common and allows to connect the clients to the server as if they were connected to the same LAN this mode is useful when the clients need to access resources that are not directly accessible from the server. If unsure, select routed mode.
it: ``Modalità``: bridged o routed; la modalità routed è quella predefinita e la più comune, consente di creare una rete virtuale in cui i client sono connessi al server e possono comunicare tra loro. La modalità bridged è meno comune e permette di collegare i client al server come se fossero connessi alla stessa LAN; questa modalità è utile quando i client devono accedere a risorse che non sono direttamente accessibili dal server. In caso di dubbio, selezionare la modalità routed.

source: ``Authentication mode``: several authentication modes are supported:
it: ``Modalità di autenticazione``: sono supportate diverse modalità di autenticazione:

source: ``Username and password``: the connecting client must provide a valid username and password; only users with a password set can use this mode
it: ``Utente e password``: il client che si connette deve fornire un nome utente e una password validi; solo gli utenti con una password impostata possono utilizzare questa modalità

source: ``Certificate``: the connecting client must have its own certificate to authenticate; this is the recommended mode for most cases
it: ``Certificato``: il client che si connette deve disporre di un proprio certificato per autenticarsi; questa è la modalità consigliata nella maggior parte dei casi

source: ``Username password and certificate``: the connecting client must provide a valid username, password and certificate
it: ``Utente, password e certificato``: il client che si connette deve fornire un nome utente, una password e un certificato validi

source: ``VPN Network``: the virtual network used by clients; every client will receive an IP address taken from this network. NethSecurity already suggests an uncommon network to avoid overlaps with other networks used by the firewall
it: ``Rete VPN``: la rete virtuale utilizzata dai client; a ogni client verrà assegnato un indirizzo IP prelevato da questa rete. NethSecurity suggerisce già una rete poco comune per evitare sovrapposizioni con altre reti utilizzate dal firewall.

source: ``Dynamic range IP start``: the first IP address that will be assigned to clients connecting to the server; the address must be part of the VPN network. When adding an IP reservation to client, make sure that the IP address is outside the dynamic range.
it: ``Inizio intervallo IP dinamico``: il primo indirizzo IP che verrà assegnato ai client che si connettono al server; l'indirizzo deve far parte della rete VPN. Quando si aggiunge una prenotazione IP a un client, assicurarsi che l'indirizzo IP sia al di fuori dell'intervallo dinamico.

source: ``Dynamic range IP end``: the last IP address that will be assigned to clients connecting to the server
it: ``Fine intervallo IP dinamico``: l'ultimo indirizzo IP che verrà assegnato ai client che si connettono al server

source: ``Public IP/hostname of this unit``: NethSecurity automatically fills out this field with the public IP address of each configured WAN interface. These IPs/hostnames will go into the client configuration. The order of the elements is crucial because the connecting client will start contacting the IPs/hostnames beginning with the first in the list and then progressing down the list in case of unavailability.
it: ``Indirizzo IP/hostname pubblico di questa unità``: NethSecurity compila automaticamente questo campo con l'indirizzo IP pubblico di ciascuna interfaccia WAN configurata. Questi IP/hostname verranno inseriti nella configurazione del client. L'ordine degli elementi è fondamentale perché il client che si connette inizierà a contattare gli IP/hostname partendo dal primo nella lista e proseguendo con i successivi in caso di indisponibilità.

source: Click on the :guilabel:`Create` button to create the server. After that, main server details will be shown in the Web UI.
it: Fare clic sul pulsante :guilabel:`Crea` per creare il server. Successivamente, i dettagli principali del server verranno mostrati nell'interfaccia Web.

source: Advanced settings
it: Impostazioni avanzate

source: If needed, you can also customize some advanced options:
it: Se necessario, è anche possibile personalizzare alcune opzioni avanzate:

source: ``Protocol``: UDP (default), TCP
it: ``Protocollo``: UDP (predefinito), TCP

source: ``Port``: 1194 (default)
it: ``Porta``: 1194 (predefinita)

source: ``Route all client traffic through VPN``: if enabled, all traffic from the client will be routed into the VPN tunnel, even standard internet traffic. It can be used for monitoring and control purposes, but is typically disabled because it introduces increased latency and consumes bandwidth.
it: ``Instrada tutto il traffico attraverso la VPN``: se abilitata, tutto il traffico proveniente dal client verrà instradato all'interno del tunnel VPN, incluso il traffico internet standard. Può essere utilizzata per scopi di monitoraggio e controllo, ma solitamente è disabilitata perché introduce una maggiore latenza e consuma larghezza di banda.

source: ``Push network routes``: a list of networks that the client should route in the VPN tunnel; the LAN networks are automatically added, but they can also be removed and other networks can be added in the same way
it: ``Instrada queste reti sulla VPN``: un elenco di reti che il client deve instradare nel tunnel VPN; le reti LAN vengono aggiunte automaticamente, ma possono anche essere rimosse e altre reti possono essere aggiunte allo stesso modo

source: ``Allow client-to-client network traffic``: allows all connected clients to exchange traffic between them; it is recommended to leave it disabled.
it: ``Consenti il traffico tra i client``: consente a tutti i client connessi di scambiarsi traffico tra loro; si consiglia di lasciarlo disabilitato.

source: ``Compression``: compress the OpenVPN tunnel traffic to save bandwidth. However, it is now a less useful option and, in some cases, can be detrimental. It is highly recommended to leave it disabled. When this option is modified, it is necessary to download the client configuration again.
it: ``Compressione``: comprime il traffico del tunnel OpenVPN per risparmiare larghezza di banda. Tuttavia, attualmente questa opzione è meno utile e, in alcuni casi, può essere dannosa. Si raccomanda vivamente di lasciarla disabilitata. Quando questa opzione viene modificata, è necessario scaricare nuovamente la configurazione del client.

source: ``Digest``: the digest authenticates data channel packets (default SHA 256)
it: ``Digest``: il digest autentica i pacchetti del canale dati (SHA 256 predefinito)

source: ``Cipher``: encryption cipher used (default AES-256-GCM)
it: ``Cipher``: cifrario di crittografia utilizzato (predefinito AES-256-GCM)

source: ``Enforce a minimum TLS version``: allows connection only for clients using a TLS version equal to or greater than the one specified.
it: ``Imporre una versione minima di TLS``: consente la connessione solo ai client che utilizzano una versione di TLS uguale o superiore a quella specificata.

source: ``Custom DHCP options``: pass specific DHCP options to the client (e.g. DOMAIN, DNS, WINS and so on)
it: ``Opzioni DHCP personalizzate``: consente di passare opzioni DHCP specifiche al client (ad esempio DOMAIN, DNS, WINS e così via)

source: DHCP options
it: Opzioni DHCP

source: The DHCP options are used to pass specific configuration parameters to the client. Available DHCP options are:
it: Le opzioni DHCP vengono utilizzate per trasmettere parametri di configurazione specifici al client. Le opzioni DHCP disponibili sono:

source: ``DNS [addr]``: set primary and secondary DNS server addresses (IPv4 or IPv6). Repeat the option to set multiple addresses.
it: ``DNS [addr]``: imposta gli indirizzi del server DNS primario e secondario (IPv4 o IPv6). Ripetere l'opzione per impostare più indirizzi.

source: ``WINS [addr]``: set primary and secondary Windows Internet Name Service Server (NetBIOS over TCP/IP Name Server) addresses. Repeat the option to set multiple addresses.
it: ``WINS [addr]``: imposta gli indirizzi del server Windows Internet Name Service primario e secondario (server dei nomi NetBIOS su TCP/IP). Ripetere l'opzione per impostare più indirizzi.

source: ``NTP [addr]``: set primary and secondary Network Time Protocol server addresses. Repeat the option to set multiple addresses.
it: ``NTP [addr]``: imposta gli indirizzi dei server Network Time Protocol primario e secondario. Ripetere l'opzione per impostare più indirizzi.

source: ``NBT [type]``: set NetBIOS over TCP/IP ode type:
it: ``NBT [type]``: imposta il tipo di modalità NetBIOS over TCP/IP

source: ``1``: Broadcast
it: ``1``: Trasmissione

source: ``2``: Point-to-point (uses WINS)
it: ``2``: Punto-a-punto (usa WINS)

source: ``4``: Mixed (broadcast, then query name server)
it: ``4``: Misto (broadcast, poi query al name server)

source: ``8``: Hybrid (query name server, then broadcast)
it: ``8``: Ibrido (interroga il name server, poi trasmette in broadcast)

source: ``NBS [scope-id]``: set NetBIOS Scope ID to isolate NetBIOS traffic and allow unique computer names across different scopes.
it: ``NBS [scope-id]``: imposta l'ID di ambito NetBIOS per isolare il traffico NetBIOS e consentire nomi di computer univoci tra ambiti diversi.

source: ``DISABLE-NBT [1]``: Turn off NetBIOS over TCP/IP. The parameter is simply ``1`` to enable the option.
it: ``DISABLE-NBT [1]``: Disattiva NetBIOS su TCP/IP. Il parametro è semplicemente ``1`` per abilitare l'opzione.

source: VPN accounts
it: Account VPN

source: Now that the server has been configured, it is necessary to create the accounts for the connecting clients. To do this, click on :guilabel:`Add VPN Account` and fill out the form:
it: Ora che il server è stato configurato, è necessario creare gli account per i client che si connetteranno. Per fare ciò, fare clic su :guilabel:`Aggiungi account VPN` e compilare il modulo:

source: ``User``: each account is associated with only one user from the chosen database, select the user for this account
it: ``Utente``: ogni account è associato a un solo utente dal database selezionato; selezionare l'utente per questo account

source: ``Reserved IP``: specify an IP address that is part of the defined VPN network but outside the dynamic range. The entered IP address will always be assigned to this specific account, this can be very useful for creating firewall rules. Leave it blank to assign a random IP address on every connection.
it: ``IP riservato``: specificare un indirizzo IP che faccia parte della rete VPN definita ma che sia al di fuori dell'intervallo dinamico. L'indirizzo IP inserito verrà sempre assegnato a questo specifico account; ciò può essere molto utile per creare regole firewall. Lasciare vuoto per assegnare un indirizzo IP casuale a ogni connessione.

source: ``Certificate expiration (days)``: specify a certificate duration (default 3650 days)
it: ``Scadenza certificato (giorni)``: specificare una durata del certificato (predefinito 3650 giorni)

source: Once the account is created, it is necessary to export the configuration and load it into the client that needs to connect. To do this, simply click on the menu of the specific account and choose ``Download configuration``. This action downloads the ready-to-use file, simply to be loaded into the client. This file is dynamically generated based on the current configuration of the OpenVPN server and already contains all the necessary information, including configuration details (server addresses, port, etc.) and required certificates. In case the server's operating mode is changed (e.g., if the authentication mode is altered), it is necessary to download the file again.
it: Una volta creato l'account, è necessario esportare la configurazione e caricarla nel client che deve connettersi. Per fare ciò, è sufficiente cliccare sul menu dell'account specifico e scegliere ``Scarica configurazione``. Questa azione scarica il file pronto all'uso, semplicemente da caricare nel client. Questo file viene generato dinamicamente in base alla configurazione attuale del server OpenVPN e contiene già tutte le informazioni necessarie, inclusi i dettagli di configurazione (indirizzi del server, porta, ecc.) e i certificati richiesti. Nel caso in cui venga modificata la modalità operativa del server (ad esempio, se viene cambiata la modalità di autenticazione), è necessario scaricare nuovamente il file.

source: Other available actions are:
it: Altre azioni disponibili sono:

source: ``Disable``: disable the account; the account can be re-enabled at any time.
it: ``Disabilita``: disabilita l'account; l'account può essere riabilitato in qualsiasi momento.

source: If a client is already connected to the roadwarrior server, the ``Disable`` action on the respective account causes an immediate disconnection from the server, interrupting the communication.
it: Se un client è già connesso al server roadwarrior, l'azione ``Disabilita`` sull'account corrispondente provoca una disconnessione immediata dal server, interrompendo la comunicazione.

source: ``Regenerate certificate``: recreate the personal certificate for the account; if the current certificate has not expired, it will be revoked, and it will be necessary to use the new one. After recreating the certificate, it is necessary to update it on the client by either re-downloading the entire configuration or just the certificate.
it: ``Rigenera certificato``: ricrea il certificato personale per l'account; se il certificato attuale non è scaduto, verrà revocato e sarà necessario utilizzare quello nuovo. Dopo aver ricreato il certificato, è necessario aggiornarlo sul client scaricando nuovamente l'intera configurazione oppure solo il certificato.

source: ``Delete``: delete the account and its certificate, this operation is irreversible and the certificate is not recoverable.
it: ``Elimina``: elimina l'account e il relativo certificato; questa operazione è irreversibile e il certificato non è recuperabile.

source: Client behavior
it: Comportamento del client

source: Some information about the behavior of the clients:
it: Alcune informazioni sul comportamento dei client:

source: Clients connected to the Road Warrior VPN are assigned to the ``rwopenvpn`` zone, which is inherently trusted. By default, this zone has privileged access to both LAN and WAN zones within the network infrastructure.
it: I client connessi alla VPN Road Warrior vengono assegnati alla zona ``rwopenvpn``, che è considerata intrinsecamente attendibile. Per impostazione predefinita, questa zona dispone di accesso privilegiato sia alle zone LAN che WAN all'interno dell'infrastruttura di rete.

source: Connection backup: in case of multiple WANs, clients will connect using the first IP/hostname of the server configuration, if it's unavailable they will use the second IP/hostname and so on.
it: Backup della connessione: in caso di più WAN, i client si connetteranno utilizzando il primo IP/nome host della configurazione del server; se questo non è disponibile, verrà utilizzato il secondo IP/nome host e così via.

source: For security reasons, it is not possible to connect multiple clients with the same account. Each account can be used by only one client at a time. If a new client attempts to connect with an account that is already connected to the system, the first account will be disconnected.
it: Per motivi di sicurezza, non è possibile connettere più client con lo stesso account. Ogni account può essere utilizzato da un solo client alla volta. Se un nuovo client tenta di connettersi con un account già connesso al sistema, il primo account verrà disconnesso.

source: All major platforms are supported. Here are some references to download the necessary software:
it: Tutte le principali piattaforme sono supportate. Ecco alcuni riferimenti per scaricare il software necessario:

source: Windows Systems: `OpenVPN WebSite <https://openvpn.net/community-downloads/>`_
it: Sistemi Windows: `OpenVPN WebSite <https://openvpn.net/community-downloads/>`_

source: MacOS Systems: `TunnelBlick <https://tunnelblick.net/>`_ or the `Official Client <https://openvpn.net/client-connect-vpn-for-mac-os/>`_
it: Sistemi MacOS: `TunnelBlick <https://tunnelblick.net/>`_ oppure il `Client Ufficiale <https://openvpn.net/client-connect-vpn-for-mac-os/>`_

source: Linux Systems: usually already available in most distribution software section, sources are available at `OpenVPN WebSite <https://openvpn.net/community-downloads/>`_
it: Sistemi Linux: di solito già disponibile nella maggior parte delle sezioni software delle distribuzioni, i sorgenti sono disponibili su `OpenVPN WebSite <https://openvpn.net/community-downloads/>`_

source: Android Systems: `OpenVPN Connect on Play Store <https://play.google.com/store/apps/details?id=net.openvpn.openvpn>`_
it: Sistemi Android: `OpenVPN Connect su Play Store <https://play.google.com/store/apps/details?id=net.openvpn.openvpn>`_

source: iOS Systems: `OpenVPN Connect on App Store <https://apps.apple.com/it/app/openvpn-connect-openvpn-app/id590379981>`_
it: Sistemi iOS: `OpenVPN Connect su App Store <https://apps.apple.com/it/app/openvpn-connect-openvpn-app/id590379981>`_

source: MTU Issue and Packet Fragmentation
it: Problema MTU e Frammentazione dei Pacchetti

source: VPN users may experience connectivity issues due to packet fragmentation. The LAN interface has an MTU of 1500, but when packets are encrypted for VPN transmission, the size increases, leading to packet drops. To resolve this, lower the MTU on the VPN server's TUN interface. No changes are required on the client side.
it: Gli utenti VPN possono riscontrare problemi di connettività a causa della frammentazione dei pacchetti. L'interfaccia LAN ha un MTU di 1500, ma quando i pacchetti vengono cifrati per la trasmissione tramite VPN, la dimensione aumenta, causando la perdita di pacchetti. Per risolvere questo problema, è necessario abbassare l'MTU sull'interfaccia TUN del server VPN. Non sono richieste modifiche lato client.

source: Add these options to the Roadwarrior server configuration ::
it: Aggiungere queste opzioni alla configurazione del server Roadwarrior ::

source: The MTU values may need to be adjusted to fit your specific network environment. A lower MTU ensures packets fit within the limits of the VPN tunnel without fragmentation, but depending on network latency or overhead, slightly different values might be necessary.
it: I valori MTU potrebbero dover essere regolati per adattarsi al proprio ambiente di rete specifico. Un MTU più basso garantisce che i pacchetti rientrino nei limiti del tunnel VPN senza frammentazione, ma a seconda della latenza di rete o dell'overhead, potrebbero essere necessari valori leggermente diversi.

source: Connection history
it: Cronologia delle connessioni

source: Every time a client connects or disconnects from the server, the event is saved inside a SQLite database stored in RAM. Such event history can be viewed by clicking on tab ``Connection History`` available on the top of the page.
it: Ogni volta che un client si connette o si disconnette dal server, l'evento viene salvato all'interno di un database SQLite memorizzato in RAM. La cronologia di tali eventi può essere visualizzata facendo clic sulla scheda ``Cronologia delle connessioni`` disponibile nella parte superiore della pagina.

source: By default the page will display all connections from current day, but it is possible to filter the results by date and time and account name.
it: Per impostazione predefinita, la pagina visualizzerà tutte le connessioni del giorno corrente, ma è possibile filtrare i risultati per data e ora e per nome account.
