Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/port_forward.po
Languages: it

source: The firewall prevents requests from public networks to access private ones. For instance, if there's a web server operating within the LAN, only computers within the local network can access this service. Any attempts made by external users from outside the local network are denied.
it: Il firewall impedisce che le richieste provenienti da reti pubbliche accedano a quelle private. Ad esempio, se è presente un server web che opera all'interno della LAN, solo i computer della rete locale possono accedere a questo servizio. Qualsiasi tentativo effettuato da utenti esterni, al di fuori della rete locale, viene negato.

source: For web servers, common listening ports include port 80 (HTTP) and port 443 (HTTPS). When creating a port forward, certain parameters must be specified:
it: Per i server web, le porte di ascolto comuni includono la porta 80 (HTTP) e la porta 443 (HTTPS). Quando si crea un port forwarding, è necessario specificare determinati parametri:

source: ``Name``: assigning a name to a port forward rule is beneficial for future reference and management. By providing a descriptive and meaningful name, network administrators can easily identify the purpose and context of each port forward.
it: ``Nome``: assegnare un nome a una regola di port forwarding è utile per riferimenti e gestione futuri. Fornendo un nome descrittivo e significativo, gli amministratori di rete possono identificare facilmente lo scopo e il contesto di ogni port forwarding.

source: ``Source port``: the port from which the request originates. Note that not all protocols require a port. For example, protocols like ``GRE`` do not use ports.
it: ``Porta sorgente``: la porta da cui ha origine la richiesta. Si noti che non tutti i protocolli richiedono una porta. Ad esempio, protocolli come ``GRE`` non utilizzano porte.

source: ``Destination port``: the port to which the traffic is directed; this can differ from the source port.
it: ``Porta di destinazione``: la porta a cui è diretto il traffico; questa può differire dalla porta di origine.

source: ``Protocol``: specifies the protocol such as ``TCP``, ``UDP``, ``UDPLITE``, ``ICMP``, ``ESP``, ``AH``, ``SCTP``, ``GRE``. Leave empty for any source protocol If left empty, all traffic, regardless of the protocol, will be forwarded. Use this setting with caution, as it may expose the system to unintended or potentially harmful traffic.
it: ``Protocollo``: specifica il protocollo come ``TCP``, ``UDP``, ``UDPLITE``, ``ICMP``, ``ESP``, ``AH``, ``SCTP``, ``GRE``. Lasciare vuoto per qualsiasi protocollo sorgente. Se lasciato vuoto, tutto il traffico, indipendentemente dal protocollo, verrà inoltrato. Utilizzare questa impostazione con cautela, poiché potrebbe esporre il sistema a traffico indesiderato o potenzialmente dannoso.

source: ``Destination address``: specifies the internal host to which the traffic should be redirected. This can be:
it: ``Indirizzo di destinazione``: specifica l'host interno verso cui il traffico deve essere reindirizzato. Questo può essere:

source: a specific IP address
it: un indirizzo IP specifico

source: a firewall object: a host defined by a host set, a DHCP reservation, a DNS record or an OpenVPN account with IP reservation
it: un oggetto firewall: un host definito da un insieme di host, una prenotazione DHCP, un record DNS o un account OpenVPN con prenotazione IP

source: By default, all port forwards are accessible only for hosts inside the WAN. Refer to the :ref:`hairpin-section` for instructions on changing this default behavior.
it: Per impostazione predefinita, tutti i port forwarding sono accessibili solo dagli host all'interno della WAN. Fare riferimento alla :ref:`hairpin-section` per le istruzioni su come modificare questo comportamento predefinito.

source: For each port forward the user can also configure the following aspects:
it: Per ogni inoltro di porta è inoltre possibile configurare i seguenti aspetti:

source: **Binding to a specific public IP**: port forwards can be bound to a specific public IP address using the ``WAN IP`` field. This means that if your router/firewall has multiple public IP addresses, you can assign a port forward to a particular IP. This feature is valuable when dealing with complex network setups, ensuring that traffic directed to a specific public IP is forwarded correctly to the internal server.
it: **Associazione a un IP pubblico specifico**: gli inoltri di porta possono essere associati a un indirizzo IP pubblico specifico utilizzando il campo ``IP WAN``. Questo significa che, se il router/firewall dispone di più indirizzi IP pubblici, è possibile assegnare un inoltro di porta a un determinato IP. Questa funzionalità è utile in presenza di configurazioni di rete complesse, garantendo che il traffico indirizzato a uno specifico IP pubblico venga inoltrato correttamente al server interno.

source: **Enabling logging**: port forwards can be configured to log incoming traffic for each rule. By enabling the ``Log`` option, the network administrator can keep track of the traffic passing through the port forward, allowing for monitoring and analysis. By default, logging is limited to 1 entry per second. To change this limit, refer to the :ref:`logging-limits` section.
it: **Abilitazione del logging**: i port forward possono essere configurati per registrare il traffico in ingresso per ogni regola. Abilitando l'opzione ``Log``, l'amministratore di rete può tenere traccia del traffico che passa attraverso il port forward, consentendo il monitoraggio e l'analisi. Per impostazione predefinita, la registrazione è limitata a 1 voce al secondo. Per modificare questo limite, consultare la sezione :ref:`logging-limits`.

source: Hairpin NAT, also known as NAT loopback or NAT reflection, is a technique used in networking where internal hosts access a server located within the same local network using the external IP address of the router or firewall. In other words, when internal devices attempt to connect to a server using the public IP address, hairpin NAT ensures that the traffic is routed internally without going out to the internet and then back into the local network.
it: Hairpin NAT, noto anche come NAT loopback o NAT reflection, è una tecnica utilizzata nel networking in cui host interni accedono a un server situato all'interno della stessa rete locale utilizzando l'indirizzo IP esterno del router o del firewall. In altre parole, quando dispositivi interni tentano di connettersi a un server utilizzando l'indirizzo IP pubblico, hairpin NAT garantisce che il traffico venga instradato internamente senza uscire su internet e poi rientrare nella rete locale.

source: To enable the hairpin, enable the ``Hairpin NAT`` option and select one or more zones where the NAT loopback should be enabled.
it: Per abilitare l'hairpin, attivare l'opzione ``Hairpin NAT`` e selezionare una o più zone in cui il NAT loopback deve essere abilitato.

source: Hairpin NAT for VPN zones
it: Hairpin NAT per le zone VPN

source: To use Hairpin NAT with VPN zones such as ``ipsec``, ``openvpn``, and ``rwopenvpn``, additional configuration is necessary. You must explicitly declare the subnet used by the VPN; otherwise, Hairpin NAT will not function for VPN-connected clients.
it: Per utilizzare Hairpin NAT con zone VPN come ``ipsec``, ``openvpn`` e ``rwopenvpn``, è necessaria una configurazione aggiuntiva. È necessario dichiarare esplicitamente la subnet utilizzata dalla VPN; in caso contrario, Hairpin NAT non funzionerà per i client connessi tramite VPN.

source: This configuration can be performed via the command line. First, identify the internal reference for the zone, then add the desired network, commit the changes, and restart the service.
it: Questa configurazione può essere eseguita tramite la riga di comando. Per prima cosa, identificare il riferimento interno per la zona, quindi aggiungere la rete desiderata, confermare le modifiche e riavviare il servizio.

source: Make sure that subnets are assigned to the correct zones:
it: Assicurarsi che le subnet siano assegnate alle zone corrette:

source: ``ipsec``: IPsec tunnels
it: ``ipsec``: tunnel IPsec

source: ``openvpn``: OpenVPN tunnels
it: ``openvpn``: tunnel OpenVPN

source: If multiple tunnels or networks are present, all must be included in their respective zones.
it: Se sono presenti più tunnel o reti, tutti devono essere inclusi nelle rispettive zone.

source: How to declare a subnet for a VPN zone
it: Come dichiarare una subnet per una zona VPN

source: To declare the OpenVPN Road Warrior network, you can use the following example command sequence:
it: Per dichiarare la rete OpenVPN Road Warrior, è possibile utilizzare la seguente sequenza di comandi di esempio:

source: Identify the internal reference for the **rwopenvpn** zone: ::
it: Identificare il riferimento interno per la zona **rwopenvpn**: ::

source: Example output: ::
it: Esempio di output: ::

source: Set the desired network (in this case, **10.88.88.0/24**) for the **rwopenvpn** zone: ::
it: Impostare la rete desiderata (in questo caso, **10.88.88.0/24**) per la zona **rwopenvpn**: ::

source: Commit the changes and restart the firewall service: ::
it: Eseguire il commit delle modifiche e riavviare il servizio firewall: ::

source: Ensure that you replace the network **subnet** with the correct one for your specific VPN setup.
it: Assicurarsi di sostituire la **subnet** di rete con quella corretta per la propria configurazione VPN specifica.

source: Verify the added network: ::
it: Verificare la rete aggiunta: ::

source: Add or remove multiple subnets to the VPN zone
it: Aggiungere o rimuovere più subnet alla zona VPN

source: If you already set a subnet for a VPN zone and want to **add** another subnet (e.g. 10.33.33.0/24) use the following command (same internal reference of previous example): ::
it: Se è già stata impostata una subnet per una zona VPN e si desidera **aggiungere** un'altra subnet (ad esempio 10.33.33.0/24), utilizzare il seguente comando (stesso riferimento interno dell'esempio precedente): ::

source: If you already set multiple subnets for a VPN zone and want to **remove** a subnet (e.g. 10.33.33/24) use the following command (same internal reference of previous example): ::
it: Se sono già state impostate più subnet per una zona VPN e si desidera **rimuovere** una subnet (ad esempio 10.33.33/24), utilizzare il seguente comando (stesso riferimento interno dell'esempio precedente): ::

source: Ensure to commit and restart firewall service after modifications.
it: Assicurarsi di eseguire il commit e riavviare il servizio firewall dopo le modifiche.

source: A port forward, also known as port redirect or port forwarding, is a networking technique used in firewalls to redirect specific network traffic from one IP address and port number combination to another. It is typically employed to enable external users to access services or applications hosted on devices within a private local network.
it: Un port forward, noto anche come port redirect o port forwarding, è una tecnica di rete utilizzata nei firewall per reindirizzare traffico di rete specifico da una combinazione di indirizzo IP e numero di porta a un'altra. Viene tipicamente impiegata per consentire agli utenti esterni di accedere a servizi o applicazioni ospitati su dispositivi all'interno di una rete locale privata.

source: empty: in this case the port will be redirected to the router/firewall itself
it: vuoto: in questo caso la porta verrà reindirizzata al router/firewall stesso

source: **Access restriction**: Port forwards can be restricted to specific sources to enhance security. This can be done using the ``Restrict access to`` field. The field accepts IP addresses, CIDR blocks or an object. Any type of object is supported except for host sets containing an IP range.
it: **Restrizione dell'accesso**: Gli inoltri di porta possono essere limitati a fonti specifiche per aumentare la sicurezza. Questo può essere fatto utilizzando il campo ``Limita accesso a``. Il campo accetta indirizzi IP, blocchi CIDR o un oggetto. Sono supportati tutti i tipi di oggetti tranne i set di host che contengono un intervallo IP.
