Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/qos.po
Languages: it

source: NethSecurity QoS provides Active Queue Management (AQM) and Flow Queuing (FQ) capabilities to help ensure that your network resources are used efficiently and fairly.
it: NethSecurity QoS fornisce funzionalità di Active Queue Management (AQM) e Flow Queuing (FQ) per garantire che le risorse di rete vengano utilizzate in modo efficiente ed equo.

source: Operating principles
it: Principi di funzionamento

source: NethSecurity QoS is designed to make the best use of available bandwidth, without imposing strict limits or shaping traffic by default. It operates on the following principles:
it: NethSecurity QoS è progettato per sfruttare al meglio la banda disponibile, senza imporre limiti rigidi o shaping del traffico come impostazione predefinita. Funziona secondo i seguenti principi:

source: *Bandwidth usage*: QoS strives to utilize the available bandwidth to its fullest potential. By default, it does not impose strict bandwidth limitations on your network. Instead, it dynamically adjusts to network conditions, ensuring that unused bandwidth is efficiently utilized.
it: *Utilizzo della larghezza di banda*: QoS si impegna a sfruttare al massimo la banda disponibile. Per impostazione predefinita, non impone limiti rigorosi alla larghezza di banda della rete. Invece, si adatta dinamicamente alle condizioni della rete, garantendo che la banda non utilizzata venga sfruttata in modo efficiente.

source: *Flow management*: QoS actively manages network flows to prevent any single client or application from monopolizing the available bandwidth. This ensures fair and equitable access to network resources for all users.
it: *Gestione dei flussi*: QoS gestisce attivamente i flussi di rete per evitare che un singolo client o applicazione monopolizzi la banda disponibile. Questo garantisce un accesso equo e imparziale alle risorse di rete per tutti gli utenti.

source: Configuration
it: Configurazione

source: Bandwidth management is handled dynamically and automatically by the system. Configuration is straightforward, involving specifying upload and download bandwidth values for each interface under QoS.
it: La gestione della banda viene gestita in modo dinamico e automatico dal sistema. La configurazione è semplice e consiste nell'impostare i valori di larghezza di banda in upload e download per ciascuna interfaccia sotto QoS.

source: While QoS can be set up on any interface, it typically functions optimally on WAN-type interfaces, setting upload and download speeds to the internet connection data rates.
it: Sebbene il QoS possa essere configurato su qualsiasi interfaccia, generalmente funziona in modo ottimale sulle interfacce di tipo WAN, impostando le velocità di upload e download ai valori della connessione dati a Internet.

source: To ensure resilience against service fluctuations, it is advisable to maintain a safety margin by configuring these parameters 10% lower than the measured values
it: Per garantire la resilienza contro le fluttuazioni del servizio, è consigliabile mantenere un margine di sicurezza configurando questi parametri al 10% in meno rispetto ai valori misurati.

source: Advanced configuration
it: Configurazione avanzata

source: QoS relies on an eBPF (Extended Berkeley Packet Filter) based classifier to set Differentiated Services Code Point (DSCP) fields in packets. This classification helps prioritize and manage network traffic efficiently. To maximize efficiency, QoS operates in the kernel space using eBPF technology. This ensures minimal overhead and minimal impact on system performance. In addition to IP and port-based rules, QoS allows you to define traffic rules based on DNS names, providing granular control over how traffic is classified and treated.
it: QoS si basa su un classificatore eBPF (Extended Berkeley Packet Filter) per impostare i campi Differentiated Services Code Point (DSCP) nei pacchetti. Questa classificazione aiuta a dare priorità e a gestire il traffico di rete in modo efficiente. Per massimizzare l'efficienza, QoS opera nello spazio kernel utilizzando la tecnologia eBPF. Questo garantisce un overhead minimo e un impatto minimo sulle prestazioni del sistema. Oltre alle regole basate su IP e porta, QoS consente di definire regole di traffico basate su nomi DNS, offrendo un controllo granulare su come il traffico viene classificato e gestito.

source: While Qosify works effectively without extensive configuration, it can be further optimized by setting bandwidth limits and rules. Fine-tuning QoS parameters can result in even better network performance.
it: Sebbene Qosify funzioni efficacemente senza una configurazione approfondita, può essere ulteriormente ottimizzato impostando limiti di banda e regole. Una regolazione fine dei parametri QoS può portare a prestazioni di rete ancora migliori.

source: The modifications to the standard behavior however can be useful in very limited scenarios, for which, currently, it is only possible to act directly through the command line.
it: Le modifiche al comportamento standard, tuttavia, possono essere utili solo in scenari molto limitati, per i quali, attualmente, è possibile intervenire esclusivamente tramite la riga di comando.

source: Priority classes
it: Classi di priorità

source: QoS uses four classes of priority, each class can use a maximum percentage of bandwidth defined by its threshold.
it: QoS utilizza quattro classi di priorità, ciascuna delle quali può utilizzare una percentuale massima di banda definita dalla propria soglia.

source: **Bulk (CS1, LE in kernel v5.9+):** This class is designed for low-priority traffic, with a 6.25% threshold.
it: **Bulk (CS1, LE nel kernel v5.9+):** Questa classe è progettata per il traffico a bassa priorità, con una soglia del 6,25%.

source: **Best Effort (General):** This class has a 100% threshold and is used for typical, non-prioritized traffic.
it: **Best Effort (Generale):** Questa classe ha una soglia del 100% ed è utilizzata per il traffico tipico, non prioritario.

source: **Video (AF4x, AF3x, CS3, AF2x, CS2, TOS4, TOS1):** Video traffic falls under this class, with a 50% threshold.
it: **Video (AF4x, AF3x, CS3, AF2x, CS2, TOS4, TOS1):** Il traffico video rientra in questa classe, con una soglia del 50%.

source: **Voice (CS7, CS6, EF, VA, CS5, CS4):** Voice traffic is given the highest priority, with a 25% threshold.
it: **Voce (CS7, CS6, EF, VA, CS5, CS4):** Il traffico voce riceve la massima priorità, con una soglia del 25%.

source: QoS can temporarily reduce the priority of a flow if it generates a significant amount of traffic, which is configurable. For example, a flow might be temporarily shifted to the "Bulk" priority if it sends a high number of packets within a short time. QoS can also prioritize small packets to ensure low-latency transmission of time-sensitive data.
it: QoS può temporaneamente ridurre la priorità di un flusso se questo genera una quantità significativa di traffico, parametro che è configurabile. Ad esempio, un flusso potrebbe essere temporaneamente spostato alla priorità ``Bulk`` se invia un numero elevato di pacchetti in un breve periodo di tempo. QoS può anche dare priorità ai pacchetti di piccole dimensioni per garantire una trasmissione a bassa latenza dei dati sensibili al tempo.

source: In addition to IP and port-based rules, QoS allows you to define traffic rules based on DNS names, providing granular control over how traffic is classified and treated.
it: Oltre alle regole basate su IP e porta, QoS consente di definire regole di traffico basate su nomi DNS, offrendo un controllo granulare su come il traffico viene classificato e gestito.

source: To override DSCP classification, create a file ``/etc/qosify/10-custom.conf`` with mappings: Each line has two whitespace separated fields, match and dscp.
it: Per eseguire l'override della classificazione DSCP, creare un file ``/etc/qosify/10-custom.conf`` con le mappature: ogni riga contiene due campi separati da uno spazio, match e dscp.

source: Match is one of:
it: La corrispondenza è una delle seguenti:

source: ``tcp:<port>[-<endport>]``
it: ``tcp:<porta>[-<porta-finale>]``

source: TCP single port, or range from <port> to <endport>
it: Porta TCP singola, o intervallo da <port> a <endport>

source: ``udp:<port>[-<endport>]``
it: ``udp:<porta>[-<portafine>]``

source: UDP single port, or range from <port> to <endport>
it: Porta UDP singola, o intervallo da <port> a <endport>

source: IPv4 address, e.g. 1.1.1.1
it: Indirizzo IPv4, ad esempio 1.1.1.1

source: IPv6 address, e.g. ff01::1
it: Indirizzo IPv6, ad es. ff01::1

source: fnmatch() pattern supporting * and ? as wildcard characters
it: Modello fnmatch() che supporta * e ? come caratteri jolly

source: POSIX.2 extended regular expression for matching hostnames Only works, if dns lookups are passed to qosify via the add_dns_host ubus call.
it: Espressione regolare estesa POSIX.2 per la corrispondenza dei nomi host. Funziona solo se le ricerche DNS vengono passate a qosify tramite la chiamata ubus add_dns_host.

source: Like dns, but only matches cname entries
it: Come dns, ma corrisponde solo alle voci cname

source: The dscp can be a raw value, or a codepoint like CS0. Adding a ``+`` in front of the value tells qosify to only override the DSCP value if it is zero.
it: Il dscp può essere un valore grezzo oppure un codepoint come CS0. Aggiungendo un ``+`` davanti al valore si indica a qosify di sovrascrivere il valore DSCP solo se è zero.

source: Example: ::
it: Esempio: ::

source: Troubleshooting
it: Risoluzione dei problemi

source: Inspect qosify status with ``qosify-status``, look for pkts in the 4 classes.
it: Ispezionare lo stato di qosify con ``qosify-status``, verificare i pacchetti nelle 4 classi.
