Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/release_notes.po
Languages: it

source: Dashboard: enhanced card organization and added links.
it: Dashboard: organizzazione migliorata delle schede e aggiunta di collegamenti.

source: Routes: enabled creation of routes without gateway.
it: Route: abilitata la creazione di route senza gateway.

source: Autoreload VPN pages: implemented automatic data reload every 10 seconds.
it: Ricaricamento automatico delle pagine VPN: implementato il ricaricamento automatico dei dati ogni 10 secondi.

source: Migration to vue-components lib: migrated components and utils to vue-components.
it: Migrazione alla libreria vue-components: componenti e utilità migrati a vue-components.

source: UI: set rpcd timeout to 300 seconds to support long running tasks.
it: UI: impostare il timeout di rpcd a 300 secondi per supportare attività di lunga durata.

source: DHCP: introduced network scanning feature.
it: DHCP: introdotta la funzionalità di scansione della rete.

source: User database: sorted users by username and ensured consistent execution of LDAP queries.
it: Database utenti: ordinati gli utenti per nome utente e garantita l'esecuzione coerente delle query LDAP.

source: DHCP: enabled force option by default for DHCP servers, exposed the option in the UI.
it: DHCP: abilitata per impostazione predefinita l'opzione "force" per i server DHCP, opzione resa disponibile nell'interfaccia utente.

source: OpenVPN road warrior: implemented sorting of OpenVPN road warrior users by username.
it: OpenVPN road warrior: implementata l'ordinamento degli utenti OpenVPN road warrior per nome utente.

source: Firewall rules: resolved glitch displaying incorrect content.
it: Regole del firewall: risolto un problema che mostrava contenuti errati.

source: FlashStart: fixed DNS resolution failure post service disabling.
it: FlashStart: risolto il problema di risoluzione DNS dopo la disattivazione del servizio.

source: Routes: prevented editing of IPsec rules.
it: Route: impedita la modifica delle regole IPsec.

source: IPsec: validated remote/local networks to avoid duplicates.
it: IPsec: convalida delle reti remote/locali per evitare duplicati.

source: Port forward: corrected reflection option label.
it: Port forwarding: etichetta dell'opzione di riflessione corretta.

source: Migration: ensured proper import of host groups into firewall rules.
it: Migrazione: garantita la corretta importazione dei gruppi host nelle regole del firewall.

source: Firewall rules: allowed insertion of custom IP addresses.
it: Regole del firewall: consentita l'inserimento di indirizzi IP personalizzati.

source: Threat shield: apply changes to allowlist immediately.
it: Threat shield: applicare immediatamente le modifiche alla allowlist.

source: Migration: improve IPSec option migration and allow editing of imported IPsec tunnel.
it: Migrazione: migliorare la migrazione delle opzioni IPSec e consentire la modifica del tunnel IPsec importato.

source: OpenVPN road warrior: resolved issue with user recreation from LDAP.
it: OpenVPN road warrior: risolto il problema con la ricreazione dell'utente da LDAP.

source: Fixed axios error when committing changes.
it: Corretto l'errore di axios durante il salvataggio delle modifiche.

source: OpenVPN road warrior: fixed issue with bridged configuration.
it: OpenVPN road warrior: risolto un problema con la configurazione bridge.

source: IPsec: improved handling of multiple networks with a single tunnel.
it: IPsec: gestione migliorata di più reti con un singolo tunnel.

source: Zones: fixed radio buttons IDs in Zones page.
it: Zone: corretti gli ID dei pulsanti radio fissi nella pagina Zone.

source: FlashStart: fixed ineffective redirect rule.
it: FlashStart: corretta una regola di reindirizzamento inefficace.

source: Controller: refined behavior based on subscription presence.
it: Controller: comportamento perfezionato in base alla presenza dell'abbonamento.

source: Firewall: updated ipset after IP address removal.
it: Firewall: ipset aggiornato dopo la rimozione dell'indirizzo IP.

source: Major changes on 2024-04-10
it: Modifiche principali del 10-04-2024

source: Image version: `8-23.05.3-ns.0.0.3-rc1`
it: Versione dell'immagine: ``8-23.05.3-ns.0.0.3-rc1``

source: The Release Candidate 1 release focuses on fixing bugs, adding the centralized controller, and improving the migration process from NethServer 7.
it: La versione Release Candidate 1 si concentra sulla correzione di bug, sull'aggiunta del controller centralizzato e sul miglioramento del processo di migrazione da NethServer 7.

source: The issue tracker has been moved to GitHub. The new URL is: `https://github.com/NethServer/nethsecurity/issues <https://github.com/NethServer/nethsecurity/issues>`_.
it: Il sistema di tracciamento dei problemi è stato spostato su GitHub. Il nuovo URL è: `https://github.com/NethServer/nethsecurity/issues <https://github.com/NethServer/nethsecurity/issues>`_.

source: NethSecurity has been rebased on `OpenWrt 23.05.3 <https://forum.openwrt.org/t/openwrt-23-05-3-service-release/192587>`_.
it: NethSecurity è stato basato nuovamente su `OpenWrt 23.05.3 <https://forum.openwrt.org/t/openwrt-23-05-3-service-release/192587>`_.

source: Added the :ref:`centralized controller <controller-section>` to manage multiple NethSecurity instances from a single interface.
it: Aggiunto il :ref:`controller centralizzato <controller-section>` per gestire più istanze di NethSecurity da un'unica interfaccia.

source: Port forwards: support port ranges in the source port field.
it: Reindirizzamenti di porta: supporto per intervalli di porte nel campo della porta di origine.

source: Firewall rules: support IP ranges as destination rules.
it: Regole firewall: supporto per intervalli IP come regole di destinazione.

source: Backup: allow download of the backup file from the UI even if the machine has an enterprise subscription and remote backup server is not available.
it: Backup: consentire il download del file di backup dall'interfaccia utente anche se la macchina dispone di un abbonamento enterprise e il server di backup remoto non è disponibile.

source: Threat shield: improve visualization of the threat shield page if the firewall does not have Internet access.
it: Threat shield: migliorare la visualizzazione della pagina Threat shield se il firewall non ha accesso a Internet.

source: Subscription: show subscription even if the machine has no Internet access.
it: Abbonamento: mostrare l'abbonamento anche se la macchina non ha accesso a Internet.

source: MultiWAN: improved management of the balance policy configuration.
it: MultiWAN: gestione migliorata della configurazione della policy di bilanciamento.

source: Network page: the up/down status of network interfaces now accurately reflects the cable status instead of the kernel status.
it: Pagina Rete: lo stato attivo/disattivo delle interfacce di rete ora riflette accuratamente lo stato del cavo invece dello stato del kernel.

source: Firewall rules: improve the visualization of the disabled firewall rules.
it: Regole firewall: migliorare la visualizzazione delle regole firewall disabilitate.

source: Added an option to enable the privacy policy link during login.
it: Aggiunta un'opzione per abilitare il link alla privacy policy durante l'accesso.

source: Remote support (don): allow access to UI and preserve the session after a firewall restart.
it: Supporto remoto (don): consentire l'accesso all'interfaccia utente e preservare la sessione dopo un riavvio del firewall.

source: Users: support bind on remote LDAP user datbases.
it: Utenti: supporto per il bind su database utente LDAP remoti.

source: 2FA: enable 2FA for user only after OTP verification.
it: 2FA: abilitare l'autenticazione a due fattori per l'utente solo dopo la verifica dell'OTP.

source: IPsec tunnels: correctly associate the ipsecX interface to the selected WAN.
it: Tunnel IPsec: associare correttamente l'interfaccia ipsecX alla WAN selezionata.

source: IPsec: make sure to start after a migration even if the associated WAN is not available.
it: IPsec: assicurarsi di avviare dopo una migrazione anche se la WAN associata non è disponibile.

source: Migration: rework the network migration process to avoid issues with bonds, bridges, and aliases configuration.
it: Migrazione: rielaborare il processo di migrazione della rete per evitare problemi con la configurazione di bond, bridge e alias.

source: Migration: display bonds and bridges in the remapping page during the migration.
it: Migrazione: visualizzare bond e bridge nella pagina di rimappatura durante la migrazione.

source: Migration, update and backup: implement new upload and download methods to avoid issues with large files.
it: Migrazione, aggiornamento e backup: implementare nuovi metodi di caricamento e download per evitare problemi con file di grandi dimensioni.

source: Migration: fixed an issue that prevented the DHCP server from starting when DHCP options were present in the configuration.
it: Migrazione: risolto un problema che impediva l'avvio del server DHCP quando erano presenti opzioni DHCP nella configurazione.

source: DPI: prevent loss of Enterprise signatures after an upgrade.
it: DPI: prevenire la perdita delle firme Enterprise dopo un aggiornamento.

source: Storage: added the ability to recreate a deleted storage partition.
it: Storage: aggiunta la possibilità di ricreare una partizione di storage eliminata.

source: Network: fix creation of VLANs over bridges.
it: Rete: correggere la creazione di VLAN su bridge.

source: Port forward and IPsec tunnels: fixed the visualization of WAN IPs, the page now displays all aliases and avoids duplicates even if the WAN is not available.
it: Port forward e tunnel IPsec: corretta la visualizzazione degli IP WAN, la pagina ora mostra tutti gli alias ed evita i duplicati anche se la WAN non è disponibile.

source: Port forward: list LAN zone inside hairpin NAT destinations.
it: Port forwarding: elencare la zona LAN all'interno delle destinazioni hairpin NAT.

source: OpenVPN tunnel: fixed an issue that prevented the modification of a P2P tunnel.
it: Tunnel OpenVPN: risolto un problema che impediva la modifica di un tunnel P2P.

source: MultiWAN page: correctly sort WAN interfaces by priority.
it: Pagina MultiWAN: ordina correttamente le interfacce WAN per priorità.

source: MultiWAN page: do not show WAN aliases inside the policy page.
it: Pagina MultiWAN: non mostrare gli alias WAN all'interno della pagina delle policy.

source: DHCP: hide static leases inside the dynamic leases tab.
it: DHCP: nascondere i lease statici all'interno della scheda dei lease dinamici.

source: Proxy pass: fix an issue that was preventing the modification of a proxy pass rule.
it: Proxy pass: risolto un problema che impediva la modifica di una regola di proxy pass.

source: OpenVPN tunnel: fix default cipher selection for P2P tunnels.
it: Tunnel OpenVPN: corretta la selezione predefinita del cifrario per i tunnel P2P.

source: DPI: restart netifyd after a network configuration change.
it: DPI: riavviare netifyd dopo una modifica alla configurazione di rete.

source: FlashStart: fix firewall registration to the FlashStart service.
it: FlashStart: corregge la registrazione del firewall al servizio FlashStart.

source: FlashStart: fix secondary DNS address.
it: FlashStart: correggere l'indirizzo DNS secondario.

source: Firewall rules: fix duplicated host in source and destination address.
it: Regole del firewall: correggere la presenza di host duplicati negli indirizzi di origine e destinazione.

source: OpenVPN Road Warrior: fix bulk user creation for large user lists.
it: OpenVPN Road Warrior: correggere la creazione in massa degli utenti per elenchi di utenti di grandi dimensioni.

source: Known bugs
it: Bug noti

source: Network bonds still suffer from some issues. If you're migrating from NethServer 7, please be aware of the following:
it: I bond di rete presentano ancora alcune problematiche. Se si sta effettuando una migrazione da NethServer 7, si prega di tenere presente quanto segue:

source: VLAN over a bond interface is not created if bond hasn't a role
it: La VLAN su un'interfaccia bond non viene creata se il bond non ha un ruolo

source: During bond creation, sometimes, the web UI doesn't show the devices to add to the bond
it: Durante la creazione di un bond, a volte l'interfaccia web non mostra i dispositivi da aggiungere al bond

source: The newly created bond shows a button saying "Configure bond", but then it does not configure the bond itself but the interface member of the bond
it: Il bond appena creato mostra un pulsante con l'etichetta ``Configura bond``, ma in realtà non configura il bond stesso, bensì l'interfaccia membro del bond.

source: Upgrade notes
it: Note sull'aggiornamento

source: If you are upgrading from a previous beta version and have any IPsec tunnels configured, you must run the following commands after the upgrade:
it: Se si sta eseguendo l'aggiornamento da una versione beta precedente e sono stati configurati tunnel IPsec, è necessario eseguire i seguenti comandi dopo l'aggiornamento:

source: Major changes on 2024-02-29
it: Modifiche principali del 29-02-2024

source: Image version: `8-23.05.2-ns.0.0.2-beta2`
it: Versione dell'immagine: ``8-23.05.2-ns.0.0.2-beta2``

source: The Beta2 release focuses on improving the new UI and enhancing the overall user experience.
it: La versione Beta2 si concentra sul miglioramento della nuova interfaccia utente e sull'ottimizzazione dell'esperienza utente complessiva.

source: New features
it: Nuove funzionalità

source: New packages included in the image:
it: Nuovi pacchetti inclusi nell'immagine:

source: Added SNMPD package for network monitoring and management.
it: Aggiunto il pacchetto SNMPD per il monitoraggio e la gestione della rete.

source: Dyndns package included for dynamic DNS services.
it: Pacchetto Dyndns incluso per i servizi DNS dinamici.

source: Expanded driver support for older network interfaces and vmnet environments.
it: Supporto driver ampliato per interfacce di rete meno recenti e ambienti vmnet.

source: User interface (UI):
it: Interfaccia utente (UI):

source: Default UI port changed to 9090, accessible from WAN. The UI is also accessible from LAN and WAN on port 443.
it: La porta UI predefinita è stata cambiata in 9090, accessibile dalla WAN. L'interfaccia utente è inoltre accessibile da LAN e WAN sulla porta 443.

source: LuCI interface disabled by default for streamlined experience.
it: Interfaccia LuCI disabilitata per impostazione predefinita per un'esperienza semplificata.

source: New page configure Source NAT, Masquerading, No-NAT and netmap rules.
it: Nuova pagina per configurare le regole Source NAT, Masquerading, No-NAT e netmap.

source: Improved readability of network packet counts on the network page.
it: Migliorata la leggibilità del conteggio dei pacchetti di rete nella pagina di rete.

source: Network:
it: Rete:

source: PPPoE with DHCPv6-PD support implemented.
it: Supporto PPPoE con DHCPv6-PD implementato.

source: It's now possible to configure bond network interfaces from the UI.
it: Ora è possibile configurare le interfacce di rete bond dall'interfaccia utente.

source: Automatic network change reconfiguration enabled.
it: Riconfigurazione automatica al cambio di rete abilitata.

source: All non-WAN interfaces displayed on the DPI page. To upgrade the DPI configuration on existing installations, execute:
it: Tutte le interfacce non-WAN vengono visualizzate nella pagina DPI. Per aggiornare la configurazione DPI sulle installazioni esistenti, eseguire:

source: Additional features:
it: Funzionalità aggiuntive:

source: Improved the installation script ``ns-install``: installation is now faster and it halts the system at the end of the installation process.
it: Migliorato lo script di installazione ``ns-install``: l'installazione è ora più veloce e il sistema viene arrestato al termine del processo di installazione.

source: Improved migration UI for smoother upgrade experience.
it: Interfaccia utente di migrazione migliorata per un'esperienza di aggiornamento più fluida.

source: DHCP static lease creation from existing dynamic leases.
it: Creazione di lease statici DHCP a partire da lease dinamici esistenti.

source: Two-factor authentication (2FA) for administrator accounts.
it: Autenticazione a due fattori (2FA) per account amministratore.

source: Redesigned login experience with a more integrated and admin-oriented look and feel.
it: Esperienza di accesso riprogettata con un aspetto più integrato e orientato all'amministratore.

source: Pre and post commit hooks added for enhanced API control.
it: Hook pre e post commit aggiunti per un controllo API migliorato.

source: Subscription-based opt-in feature for automatic updates, accessible only to users with active subscriptions.
it: Funzionalità di opt-in basata su abbonamento per aggiornamenti automatici, accessibile solo agli utenti con abbonamenti attivi.

source: Improved rule flexibility: now allows specifying single IP addresses (not just CIDR format) in source/destination fields for rules.
it: Flessibilità delle regole migliorata: ora è possibile specificare singoli indirizzi IP (non solo in formato CIDR) nei campi origine/destinazione delle regole.

source: Policy protection: prevents accidental deletion of policies already used in rules.
it: Protezione delle policy: impedisce l'eliminazione accidentale delle policy già utilizzate nelle regole.

source: Fixed mwan chart display: mwan chart within Netdata now shows correctly after multi-WAN configuration.
it: Corretto il display del grafico mwan: il grafico mwan all'interno di Netdata ora viene visualizzato correttamente dopo la configurazione multi-WAN.

source: Enhanced protocol handling: creates rules for all protocols (not just TCP/UDP) when "any" is selected.
it: Gestione avanzata dei protocolli: crea regole per tutti i protocolli (non solo TCP/UDP) quando viene selezionato "qualsiasi".

source: Improved rule readability: in rules with 2 or more source/destination addresses, only the second address was readily visible in the tooltip.
it: Migliorata la leggibilità delle regole: nelle regole con 2 o più indirizzi di origine/destinazione, solo il secondo indirizzo era immediatamente visibile nel suggerimento.

source: Port Forwarding:
it: Inoltro delle porte:

source: Streamlined configuration: source and destination ports are only required for TCP/UDP protocols.
it: Configurazione semplificata: le porte di origine e destinazione sono richieste solo per i protocolli TCP/UDP.

source: Simplified ALL protocol selection: when "ALL" protocol is chosen, other protocol options are disabled as they are redundant.
it: Selezione semplificata del protocollo ALL: quando viene scelto il protocollo "ALL", le altre opzioni di protocollo vengono disabilitate in quanto ridondanti.

source: Certificates:
it: Certificati:

source: Fixed issue: custom certificate being overwritten with self-generated certificate when set as default certificate for the firewall FQDN.
it: Problema risolto: il certificato personalizzato veniva sovrascritto da un certificato autogenerato quando impostato come certificato predefinito per il FQDN del firewall.

source: Correctly display certificate domain: on the certificate list, the subject displayed now corresponds to the client certificate instead of the first certificate in the chain.
it: Visualizzazione corretta del dominio del certificato: nell'elenco dei certificati, il soggetto visualizzato ora corrisponde al certificato client invece che al primo certificato nella catena.

source: Fix Let's Encrypt certificate deletion: forced acme.sh to generate a new configuration when recreating a Let's Encrypt certificate for the same domain, instead of reusing the existing one.
it: Correzione dell'eliminazione dei certificati Let's Encrypt: è stata forzata la generazione di una nuova configurazione da parte di acme.sh durante la ricreazione di un certificato Let's Encrypt per lo stesso dominio, invece di riutilizzare quella esistente.

source: Let's Encrypt certificate request: disabled automatic redirection from port 80 to 443 to avoid conflicts with acme.sh.
it: Richiesta certificato Let's Encrypt: disabilitato il reindirizzamento automatico dalla porta 80 alla 443 per evitare conflitti con acme.sh.

source: Fixed configuration loss: resolved issue where saved DPI filter configurations were deleted during upgrade from previous versions
it: Perdita di configurazione corretta: risolto il problema per cui le configurazioni salvate del filtro DPI venivano eliminate durante l'aggiornamento dalle versioni precedenti

source: Improved interface management: enabled editing of interfaces even after their associated zone is deleted.
it: Gestione migliorata delle interfacce: è ora possibile modificare le interfacce anche dopo che la zona associata è stata eliminata.

source: Log consistency: standardized API server logs for NethSecurity API server to match objects passed to scripts.
it: Coerenza dei log: i log del server API sono stati standardizzati per il server API di NethSecurity in modo da corrispondere agli oggetti passati agli script.

source: Resolved port update issue: changing OpenVPN Road Warrior service port through the UI now correctly reflects the update in the service configuration and associated firewall rule.
it: Risolto il problema di aggiornamento della porta: la modifica della porta del servizio OpenVPN Road Warrior tramite l'interfaccia utente ora si riflette correttamente nell'aggiornamento della configurazione del servizio e nella regola firewall associata.

source: Configuration protection: fixed issue where RoadWarrior configuration was lost when changing a user's password.
it: Protezione della configurazione: risolto il problema per cui la configurazione RoadWarrior veniva persa durante la modifica della password di un utente.

source: Enhanced authentication: addressed OpenVPN Roadwarrior authentication failures using local users in NethSecurity beta1.
it: Autenticazione avanzata: risolti i problemi di autenticazione di OpenVPN Roadwarrior utilizzando utenti locali in NethSecurity beta1.

source: Resolved tunnel server status: fixed issue where the tunnel server status was not correctly displayed in the UI.
it: Stato del server tunnel risolto: risolto il problema per cui lo stato del server tunnel non veniva visualizzato correttamente nell'interfaccia utente.

source: MAC address inclusion: resolved problem where MAC addresses were missing in the "unit" section of the Hotspot Manager when the hotspot relied on a VLAN.
it: Inclusione degli indirizzi MAC: risolto il problema per cui gli indirizzi MAC erano assenti nella sezione ``unità`` del Hotspot Manager quando l'hotspot si basava su una VLAN.

source: VLAN deletion: fixed issue preventing deletion of VLANs previously used by unregistered hotspots, even after the VLAN was freed.
it: Eliminazione VLAN: risolto un problema che impediva l'eliminazione delle VLAN precedentemente utilizzate da hotspot non registrati, anche dopo che la VLAN era stata liberata.

source: Enhanced status visibility: added enabled/disabled status to the main tab for quick reference.
it: Visibilità dello stato migliorata: aggiunto lo stato abilitato/disabilitato nella scheda principale per un riferimento rapido.

source: Fixed missing key value for a preconfigured advanced option, ensuring proper functionality.
it: Corretto il valore della chiave mancante per un'opzione avanzata preconfigurata, garantendo il corretto funzionamento.

source: Improved display of multiple options by removing redundant label.
it: Visualizzazione migliorata di opzioni multiple tramite la rimozione dell'etichetta ridondante.
