Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/release_notes.po
Languages: it

source: Improved port forward validation to reject invalid IPs when a destination port is defined.
it: Migliorata la validazione dell'inoltro delle porte per rifiutare IP non validi quando è definita una porta di destinazione.

source: Fixed OpenVPN tunnels with LZO compression failing to start.
it: Risolto il problema per cui i tunnel OpenVPN con compressione LZO non riuscivano ad avviarsi.

source: QoS and MultiWAN configurations now correctly update when a WAN interface is removed.
it: Le configurazioni QoS e MultiWAN ora si aggiornano correttamente quando un'interfaccia WAN viene rimossa.

source: DPI rules now correctly block ICMP traffic; resolved startup segfault and improved performance under load.
it: Le regole DPI ora bloccano correttamente il traffico ICMP; risolto il segfault all'avvio e migliorate le prestazioni sotto carico.

source: Fixed kebab menu functionality in port forwarding when domain sets are used in the “limit access to” section.
it: Funzionalità del menu kebab corretta nell'inoltro delle porte quando vengono utilizzati set di domini nella sezione “limita accesso a”.

source: Reverse proxy certificate usage indicators now show the correct status.
it: Gli indicatori di utilizzo del certificato del reverse proxy ora mostrano lo stato corretto.

source: Fixed controller issue where 2FA could activate after canceling setup; now only activates after successful OTP confirmation.
it: Corretto un problema nel controller in cui l'autenticazione a due fattori (2FA) poteva attivarsi dopo l'annullamento della configurazione; ora si attiva solo dopo la conferma OTP avvenuta con successo.

source: DHCP server now replies with a single message per request when multiple dnsmasq instances are configured.
it: Il server DHCP ora risponde con un solo messaggio per richiesta quando sono configurate più istanze di dnsmasq.
