Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/release_notes.po
Languages: it

source: IPsec rule NAT port: corrected port for Allow-IPsec-NAT rule, changed from 500 to 4500 (UDP)
it: Porta NAT regola IPsec: porta corretta per la regola Allow-IPsec-NAT, cambiata da 500 a 4500 (UDP)

source: Duplicate rules: prevented duplicate firewall rule creation on tunnel creations
it: Regole duplicate: impedita la creazione di regole firewall duplicate durante la creazione dei tunnel

source: Fix spelling of IPsec rule names
it: Correggere l'ortografia dei nomi delle regole IPsec

source: Only the first subnet in the IPSec tunnel is functional: when defining more than one network in an IPSec tunnel between different devices, only the first network works; traffic destined to other subnets in the tunnel is not routed correctly. A workaround is to create multiple tunnels with individual subnets. This issue does not occur between two NethSecurity 8 devices (as they use the same daemon), but it can occur between, for example, a NethSecurity 8 and a NethServer 7.9.
it: Solo la prima subnet nel tunnel IPSec è funzionante: quando si definiscono più di una rete in un tunnel IPSec tra dispositivi diversi, solo la prima rete funziona; il traffico destinato alle altre subnet nel tunnel non viene instradato correttamente. Una soluzione temporanea consiste nel creare più tunnel con subnet individuali. Questo problema non si verifica tra due dispositivi NethSecurity 8 (poiché utilizzano lo stesso demone), ma può verificarsi, ad esempio, tra un NethSecurity 8 e un NethServer 7.9.

source: Major changes on 2024-02-01
it: Modifiche principali del 2024-02-01

source: Image version: `8-23.05.2-ns.0.0.1-beta1`
it: Versione dell'immagine: ``8-23.05.2-ns.0.0.1-beta1``

source: The Beta1 release marks the transition to the new UI as the primary configuration interface. Luci remains active by default for configurations not yet available in the new UI and for verification purposes. Known bugs in the new interface can be found `here <https://trello.com/b/FndRrgIp/nethsecurity-project?filter=label:BUG>`_.
it: La release Beta1 segna la transizione verso la nuova interfaccia utente come principale interfaccia di configurazione. Luci rimane attivo per impostazione predefinita per le configurazioni non ancora disponibili nella nuova interfaccia e per scopi di verifica. I bug noti nella nuova interfaccia possono essere trovati `qui <https://trello.com/b/FndRrgIp/nethsecurity-project?filter=label:BUG>`_.

source: Main changes:
it: Modifiche principali:

source: Added a dedicated page for managing certificates and reverse proxy settings. Improved the import process for both configurations.
it: Aggiunta una pagina dedicata per la gestione dei certificati e delle impostazioni del reverse proxy. Migliorato il processo di importazione per entrambe le configurazioni.

source: Introduced a new page for configuring firewall rules. Users are advised to use this page instead of Luci's, as using both may lead to incompatibilities.
it: Introdotta una nuova pagina per la configurazione delle regole del firewall. Si consiglia di utilizzare questa pagina invece di quella di Luci, poiché l'uso di entrambe potrebbe causare incompatibilità.

source: Added a page for Quality of Service (QoS) configuration to enhance network traffic management.
it: Aggiunta una pagina per la configurazione della Qualità del Servizio (QoS) per migliorare la gestione del traffico di rete.

source: Added a page for configuring OpenVPN Roadwarrior. Updated the migration process for the new implementation.
it: Aggiunta una pagina per la configurazione di OpenVPN Roadwarrior. Aggiornato il processo di migrazione per la nuova implementazione.

source: Introduced the option to use a partition of the main disk as storage for logs.
it: Introdotta l'opzione per utilizzare una partizione del disco principale come spazio di archiviazione per i log.

source: Improved the migration process for multiwan and OpenVPN tunnels, enhancing overall system compatibility.
it: Migliorato il processo di migrazione per multiwan e tunnel OpenVPN, aumentando la compatibilità complessiva del sistema.

source: Streamlined the management of upgrades and migrations, focusing on a smoother transition.
it: Ottimizzata la gestione degli upgrade e delle migrazioni, con particolare attenzione a una transizione più fluida.

source: Implemented a new versioning system to uniquely identify each image, enhancing clarity in tracking releases.
it: È stato implementato un nuovo sistema di versionamento per identificare in modo univoco ogni immagine, migliorando la chiarezza nel tracciamento delle release.

source: Incorporated numerous usability improvements and fixed issues across existing pages, ensuring a more user-friendly experience.
it: Sono stati incorporati numerosi miglioramenti all'usabilità e risolti problemi nelle pagine esistenti, garantendo un'esperienza più intuitiva per l'utente.

source: Major changes on 2023-12-11
it: Modifiche principali del 11-12-2023

source: This alpha release is specifically crafted for evaluation purposes, focusing on testing the functionalities of the new system's user interface. Users are provided with the option to experience either the ongoing development of the new interface or stick with the established LuCI interface. Known bugs in the new interface can be found `here <https://trello.com/b/FndRrgIp/nethsecurity-project?filter=label:BUG>`_.
it: Questa versione alpha è stata specificamente realizzata per scopi di valutazione, con particolare attenzione al test delle funzionalità della nuova interfaccia utente del sistema. Viene fornita la possibilità di provare sia lo sviluppo in corso della nuova interfaccia sia di continuare a utilizzare l'interfaccia consolidata LuCI. I bug noti della nuova interfaccia possono essere trovati `qui <https://trello.com/b/FndRrgIp/nethsecurity-project?filter=label:BUG>`_.

source: **UI Enhancements**
it: **Miglioramenti dell'interfaccia utente**

source: Resolved numerous bugs across various pages, including DHCP and DPI filter, enhancing overall pages stability.
it: Risolti numerosi bug su diverse pagine, inclusi DHCP e filtro DPI, migliorando la stabilità complessiva delle pagine.

source: Introduced the OpenVPN tunnel configuration page.
it: Introdotta la pagina di configurazione del tunnel OpenVPN.

source: Added the IPsec tunnel configuration page.
it: Aggiunta la pagina di configurazione del tunnel IPsec.

source: Incorporated the Hotspot (Dedalo) configuration page.
it: Incorporata la pagina di configurazione Hotspot (Dedalo).

source: Implemented the Backup and Restore page.
it: Implementata la pagina di Backup e Ripristino.

source: Introduced exclusion functionality to the DPI filter page.
it: Introdotta la funzionalità di esclusione nella pagina del filtro DPI.

source: Exposed netdata reports within the UI, featuring a configurable ping latency monitor.
it: Report Netdata esposti all'interno dell'interfaccia utente, con un monitor della latenza ping configurabile.

source: Addressed the default language issue for non-translated languages.
it: Risolto il problema della lingua predefinita per le lingue non tradotte.

source: Refactored and improved the Network page.
it: Riorganizzata e migliorata la pagina Network.

source: Added a page to manage System Updates.
it: Aggiunta una pagina per gestire gli Aggiornamenti di Sistema.

source: Included a migration page from NethServer 7.
it: Inclusa una pagina di migrazione da NethServer 7.

source: Enabled factory reset functionality directly from the UI.
it: Abilitata la funzionalità di ripristino delle impostazioni di fabbrica direttamente dall'interfaccia utente.

source: Implemented a VPN Users page in preparation for the upcoming OpenVPN Road Warrior server.
it: È stata implementata una pagina Utenti VPN in preparazione del prossimo server OpenVPN Road Warrior.

source: **General Improvements**
it: **Miglioramenti generali**

source: Updated the base OpenWrt to version 23.05.2.
it: Aggiornata la base OpenWrt alla versione 23.05.2.

source: Established a mechanism to send alerts to remote portals, including my.nethesis.it and my.nethserver.com.
it: È stato stabilito un meccanismo per inviare avvisi ai portali remoti, inclusi my.nethesis.it e my.nethserver.com.

source: Added support for One-Time Passwords (OTP) in future OpenVPN Road Warrior server configurations.
it: Aggiunto il supporto per le One-Time Password (OTP) nelle future configurazioni del server OpenVPN Road Warrior.

source: **Note**: the bond configuration is still in progress, and as a result, bond-type network interfaces are currently non-functional in this release.
it: **Nota**: la configurazione del bond è ancora in corso e, di conseguenza, le interfacce di rete di tipo bond attualmente non sono funzionanti in questa release.

source: Major changes on 2023-10-31
it: Modifiche principali del 31-10-2023

source: This is an alpha release, designed for evaluation purposes to explore the functionalities of the new system. Users have the option to use the new interface, which is currently under development or the legacy LuCI interface. Please note that some features available on the old LuCI interface will be removed once the corresponding page on the new interface is completed.
it: Questa è una versione alpha, progettata per scopi di valutazione al fine di esplorare le funzionalità del nuovo sistema. È possibile utilizzare la nuova interfaccia, attualmente in fase di sviluppo, oppure l'interfaccia LuCI legacy. Si prega di notare che alcune funzionalità disponibili sulla vecchia interfaccia LuCI verranno rimosse una volta completata la pagina corrispondente sulla nuova interfaccia.

source: While the entire backend functionality is already operational and thoroughly tested, the new interface is not yet complete. Some bugs in the new interface are already known and can be found `here <https://trello.com/b/FndRrgIp/nethsecurity-project?filter=label:BUG>`_.
it: Sebbene l'intera funzionalità del backend sia già operativa e accuratamente testata, la nuova interfaccia non è ancora completa. Alcuni bug della nuova interfaccia sono già noti e possono essere trovati `qui <https://trello.com/b/FndRrgIp/nethsecurity-project?filter=label:BUG>`_.

source: The new interface includes the following features:
it: La nuova interfaccia include le seguenti funzionalità:

source: Subscription Management
it: Gestione degli abbonamenti

source: Hostname and Timezone Configuration
it: Configurazione di hostname e fuso orario

source: Additional Storage Setup
it: Configurazione dello spazio di archiviazione aggiuntivo

source: Network Interface Configuration
it: Configurazione dell'interfaccia di rete

source: DNS and DHCP Settings
it: Impostazioni DNS e DHCP

source: Routing Configuration
it: Configurazione del Routing

source: Multi-WAN Support
it: Supporto Multi-WAN

source: Port Forwarding Options
it: Opzioni di Port Forwarding

source: Zones and Policies Management
it: Gestione di Zone e Policy

source: Flashstart DNS Filtering
it: Filtraggio DNS Flashstart

source: Deep Packet Inspection (DPI) Filtering
it: Filtraggio Deep Packet Inspection (DPI)

source: Root User Password Change
it: Cambio della password dell'utente root

source: Access to System Logs
it: Accesso ai log di sistema

source: Releases glossary
it: Glossario delle release

source: The software release cycle includes four stages: Alpha, Beta, Release Candidate (RC), and Stable.
it: Il ciclo di rilascio del software include quattro fasi: Alpha, Beta, Release Candidate (RC) e Stable.

source: During the **Alpha** stage, the software is not thoroughly tested and may not include all planned features. This release is not suitable for production environments. However, it can be used to preview what's coming in the upcoming version. Please note that updates from an Alpha release to other releases are not supported.
it: Durante la fase **Alpha**, il software non è stato testato in modo approfondito e potrebbe non includere tutte le funzionalità pianificate. Questa versione non è adatta per ambienti di produzione. Tuttavia, può essere utilizzata per avere un'anteprima delle novità previste nella prossima versione. Si noti che gli aggiornamenti da una release Alpha ad altre release non sono supportati.

source: The **Beta** stage indicates that the software is mostly feature complete, but it may still contain many known and unknown bugs. This release should not be used on production environments. However, it can be used to test the software before deploying it to production. Updates from a Beta release to an RC or Stable release are supported but may require a manual procedure.
it: La fase **Beta** indica che il software è per lo più completo a livello di funzionalità, ma può ancora contenere numerosi bug noti e sconosciuti. Questa versione non dovrebbe essere utilizzata in ambienti di produzione. Tuttavia, può essere utilizzata per testare il software prima della distribuzione in produzione. Gli aggiornamenti da una release Beta a una release RC o Stable sono supportati, ma potrebbero richiedere una procedura manuale.

source: During the **Release Candidate (RC)** stage, the software is feature complete, and it contains no known bugs. If no major issues arise, it can be promoted to Stable. Updates from an RC release to a Stable release are supported and should be almost automatic. However, if you're new to the software, it's best to use it in production only if you already have some experience with it.
it: Durante la fase di **Release Candidate (RC)**, il software è completo di tutte le funzionalità e non contiene bug noti. Se non emergono problemi importanti, può essere promosso a Stable. Gli aggiornamenti da una versione RC a una versione Stable sono supportati e dovrebbero essere quasi automatici. Tuttavia, se si è nuovi al software, è consigliabile utilizzarlo in produzione solo se si ha già una certa esperienza con esso.

source: The **Stable** release is the most reliable and safe to use in production environments. It has been thoroughly tested and is considered to be free of major bugs.
it: La versione **Stable** è la più affidabile e sicura da utilizzare in ambienti di produzione. È stata accuratamente testata ed è considerata priva di bug importanti.

source: Image version: `8-24.10.0-ns.1.6.0`
it: Versione dell'immagine: ``8-24.10.0-ns.1.6.0``

source: New Features
it: Nuove funzionalità

source: High Availability: added support for two-node clusters in backup mode. automatic failover within seconds. configured via command line.
it: Alta disponibilità: aggiunto il supporto per cluster a due nodi in modalità backup. Failover automatico in pochi secondi. Configurazione tramite riga di comando.

source: Flashstarto ProPLus: added support for multi-profile configurations, dynamic blocklists, and improved dns client management.
it: Flashstarto ProPLus: aggiunto il supporto per configurazioni multi-profilo, blocklist dinamiche e una gestione migliorata del client DNS.

source: Security wizard: assists with initial security setup (password, ssh, and ui). appears after login if not yet completed and can be skipped.
it: Procedura guidata di sicurezza: assiste nella configurazione iniziale della sicurezza (password, ssh e interfaccia utente). Appare dopo l'accesso se non è ancora stata completata e può essere saltata.

source: Automatic persistent storage for logs: free disk space is auto-assigned to logs by default, preventing log loss during reboot. admins can change the destination.
it: Archiviazione persistente automatica per i log: lo spazio libero su disco viene assegnato automaticamente ai log per impostazione predefinita, prevenendo la perdita dei log durante il riavvio. Gli amministratori possono modificare la destinazione.

source: Threat Shield: blocked ip management from the ui: added interface to view, search, and unblock ips. ipv4 and ipv6 blocklists manageable from the ui.
it: Threat Shield: gestione degli IP bloccati dall'interfaccia utente: aggiunta un'interfaccia per visualizzare, cercare e sbloccare gli IP. Le blocklist IPv4 e IPv6 sono gestibili dall'interfaccia utente.

source: Service center sync status: subscription page now shows connection status, last sync time, and a "sync now" button.
it: Stato di sincronizzazione del service center: la pagina dell'abbonamento ora mostra lo stato della connessione, l'ora dell'ultima sincronizzazione e un pulsante ``Sincronizza ora``.

source: SNAT limited by interface: allows SNAT rules on specific network interfaces. simplifies advanced routing and failover setups. manageable via ui.
it: SNAT limitato per interfaccia: consente regole SNAT su specifiche interfacce di rete. semplifica configurazioni avanzate di routing e failover. gestibile tramite interfaccia utente.

source: Static leases filtering: added filter for dhcp static leases by interface for easier management of complex setups.
it: Filtraggio dei lease statici: aggiunto un filtro per i lease statici DHCP per interfaccia, per una gestione più semplice di configurazioni complesse.

source: Version in migration logs: migration logs and exports now include migration tool and destination system versions.
it: Versione nei log di migrazione: i log di migrazione e le esportazioni ora includono le versioni dello strumento di migrazione e del sistema di destinazione.

source: OpenVPN: fixed issue where renamed/deleted ad users could still access with old credentials. access tracking now updates correctly.
it: OpenVPN: risolto il problema per cui utenti AD rinominati/eliminati potevano ancora accedere con le vecchie credenziali. Il tracciamento degli accessi ora si aggiorna correttamente.

source: Firewall: prevented firewall zone names starting with numbers: avoids rule application issues.
it: Firewall: impediti i nomi delle zone del firewall che iniziano con numeri: evita problemi nell'applicazione delle regole.

source: Port forward: allows port forwarding without specifying a destination address.
it: Port forward: consente l'inoltro delle porte senza specificare un indirizzo di destinazione.

source: Certificates: possible to delete let's encrypt requests even if still pending.
it: Certificati: è possibile eliminare le richieste Let's Encrypt anche se ancora in sospeso.

source: OpenVPN: net-to-net openvpn tunnels with hyphens in the name can now be modified after migration.
it: OpenVPN: i tunnel net-to-net OpenVPN con trattini nel nome possono ora essere modificati dopo la migrazione.

source: Logs: fixed issue where logs could occupy root filesystem after a restore.
it: Log: risolto un problema per cui i log potevano occupare il filesystem root dopo un ripristino.

source: OpenVPN RW: adjusted renegotiation to prevent unexpected disconnections for certain authentication methods.
it: OpenVPN RW: regolata la rinegoziazione per prevenire disconnessioni inaspettate con determinati metodi di autenticazione.

source: Major changes on 2025-06-30
it: Modifiche principali del 30-06-2025

source: Major changes on 2025-10-30
it: Modifiche principali del 30-10-2025

source: Image version: `8.7.1`
it: Versione dell'immagine: ``8.7.1``

source: Fixed issue where dnsmasq could be stopped by keepalived even when not in HA mode.
it: Risolto il problema per cui dnsmasq poteva essere arrestato da keepalived anche quando non era in modalità HA.

source: Major changes on 2025-10-29
it: Modifiche principali del 29-10-2025

source: Image version: `8.7.0`
it: Versione dell'immagine: ``8.7.0``

source: High Availability is now production-ready after extensive testing and redesign, the design has changed from the beta version and requires reconfiguration.
it: L'Alta Disponibilità è ora pronta per l'ambiente di produzione dopo approfonditi test e una riprogettazione; il design è cambiato rispetto alla versione beta e richiede una nuova configurazione.

source: New WireGuard tunnel UI for creating and managing VPNs directly from the interface, with support for multiple servers and sharing via file or QR code. Existing command-line WireGuard tunnels are automatically migrated to the new UI.
it: Nuova interfaccia utente per tunnel WireGuard per la creazione e la gestione di VPN direttamente dall'interfaccia, con supporto per più server e condivisione tramite file o codice QR. I tunnel WireGuard esistenti creati da riga di comando vengono migrati automaticamente alla nuova interfaccia utente.

source: Improved DDoS and flood protection handling; configuration centralized under Threat Shield IP.
it: Gestione migliorata della protezione da DDoS e flood; configurazione centralizzata sotto Threat Shield IP.

source: Added local URL allowlist to Threat Shield DNS for more granular control.
it: Aggiunta una allowlist di URL locali a Threat Shield DNS per un controllo più granulare.

source: Automatic configuration templates introduced for GUEST and DMZ zones.
it: Introdotti modelli di configurazione automatica per le zone GUEST e DMZ.

source: Added option to download unencrypted backups locally using a dedicated button.
it: Aggiunta l'opzione per scaricare i backup non crittografati localmente tramite un pulsante dedicato.

source: Manually configured DNS servers now always take precedence over those provided by the ISP via DHCP or PPPoE.
it: I server DNS configurati manualmente ora hanno sempre la precedenza su quelli forniti dall'ISP tramite DHCP o PPPoE.

source: Improved DHCP behavior with FlashStart: no need to define DNS in DHCP options when FlashStart is active.
it: Comportamento DHCP migliorato con FlashStart: non è necessario definire il DNS nelle opzioni DHCP quando FlashStart è attivo.

source: System-generated port forwarding rules are now visible but read-only, clearly marked as automated.
it: Le regole di port forwarding generate automaticamente dal sistema sono ora visibili ma di sola lettura, chiaramente contrassegnate come automatiche.

source: Threat Shield IP automatically whitelists Nethesis enterprise service IPs to prevent false positives.
it: Threat Shield IP inserisce automaticamente nella lista bianca gli indirizzi IP dei servizi enterprise di Nethesis per prevenire falsi positivi.

source: Added support for IPSec DH Groups 19, 20, and 21.
it: Aggiunto il supporto per i gruppi DH 19, 20 e 21 di IPSec.

source: Added unit-group access control, IP-based restrictions, performance optimizations, and UI improvements in the controller.
it: Aggiunto il controllo degli accessi per i gruppi di unità, restrizioni basate su IP, ottimizzazioni delle prestazioni e miglioramenti dell'interfaccia utente nel controller.

source: Controller data and logs are now transmitted through the VPN tunnel for improved security.
it: I dati e i log del controller sono ora trasmessi attraverso il tunnel VPN per una maggiore sicurezza.

source: Added unit description field synchronized between units and controller.
it: Aggiunto il campo descrizione dell'unità sincronizzato tra le unità e il controller.

source: Added MTU configuration to resolve connectivity issues on low-quality networks.
it: Aggiunta la configurazione MTU per risolvere problemi di connettività su reti di bassa qualità.

source: Introduced remote support access (nethsupport) via temporary code; no credentials or 2FA required, with automatic revocation after session end.
it: Introdotto l’accesso di supporto remoto (nethsupport) tramite codice temporaneo; non sono richieste credenziali né 2FA, con revoca automatica al termine della sessione.

source: Fixed enabling/disabling of port forward rules via the kebab menu when domain set objects are configured.
it: Corretto l'abilitazione/disabilitazione delle regole di port forwarding tramite il menu kebab quando sono configurati oggetti di tipo domain set.
