Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/release_notes.po
Languages: it

source: Remote backup for all subscriptions: extend remote backup access to both Enterprise and Community subscriptions with additional backup information
it: Backup remoto per tutte le sottoscrizioni: estendere l’accesso al backup remoto sia alle sottoscrizioni Enterprise che Community con informazioni aggiuntive sul backup

source: New script to update packages with logging and stable channel access: implement a new update-packages script with enhanced logging and force-stable flag
it: Nuovo script per aggiornare i pacchetti con logging e accesso al canale stabile: implementare un nuovo script update-packages con logging avanzato e flag force-stable

source: Firewall objects: implement host set and domain set objects for enhanced firewall management
it: Oggetti firewall: implementare oggetti di tipo host set e domain set per una gestione avanzata del firewall

source: Add objects support in MultiWAN rules: implement objects support in MultiWAN UI for source and destination addresses
it: Aggiunta del supporto agli oggetti nelle regole MultiWAN: implementare il supporto agli oggetti nell'interfaccia utente MultiWAN per gli indirizzi di origine e destinazione

source: Add objects support in Port Forward rules: add objects support for destination address and restricted access in Port Forward rules
it: Aggiunta del supporto agli oggetti nelle regole di Port Forward: aggiunta del supporto agli oggetti per l'indirizzo di destinazione e per l'accesso ristretto nelle regole di Port Forward

source: Add objects support in Firewall rules: include objects support for source and destination addresses in Firewall rules
it: Aggiunta del supporto agli oggetti nelle regole del Firewall: includere il supporto agli oggetti per gli indirizzi di origine e destinazione nelle regole del Firewall

source: OpenVPN Road Warrior IP reservation: improve handling of reserved IPs in OpenVPN configuration to prevent conflicts
it: Prenotazione IP per OpenVPN Road Warrior: migliorare la gestione degli IP riservati nella configurazione di OpenVPN per prevenire conflitti

source: Backup: include installed package list in backup for easier restoration after image upgrade
it: Backup: includere l'elenco dei pacchetti installati nel backup per facilitare il ripristino dopo l'aggiornamento dell'immagine

source: Let's Encrypt certificate on web interface extra port: extend Let's Encrypt certificate usage to the ns-ui extra port
it: Certificato Let's Encrypt su porta extra dell'interfaccia web: estendere l'utilizzo del certificato Let's Encrypt alla porta extra di ns-ui

source: OpenVPN tunnel server: add option "remote-cert-tls" in exported file client configuration file
it: Server tunnel OpenVPN: aggiungere l'opzione "remote-cert-tls" nel file di configurazione client esportato

source: Custom DNS for hotspot: add support for changing default DNS for hotspot
it: DNS personalizzato per hotspot: aggiunta del supporto per la modifica del DNS predefinito per l'hotspot

source: Limited support for USB-to-Ethernet adapters: provide experimental support for USB-to-Ethernet adapters with manual driver installation
it: Supporto limitato per adattatori USB-Ethernet: fornire supporto sperimentale per adattatori USB-Ethernet con installazione manuale dei driver

source: Limited support for USB-to-Serial adapters: add experimental support for USB-to-Serial adapters with manual driver installation
it: Supporto limitato per adattatori USB-Seriale: aggiunto supporto sperimentale per adattatori USB-Seriale con installazione manuale del driver

source: Deny creation of certificates with already requested domains: prevent creation of duplicate certificates with the same domain
it: Negare la creazione di certificati con domini già richiesti: impedire la creazione di certificati duplicati con lo stesso dominio

source: Visual issue with DHCP objects in OpenVPN Road Warrior: fix missing fields and display errors in DHCP options
it: Problema di visualizzazione con oggetti DHCP in OpenVPN Road Warrior: correggere i campi mancanti ed errori di visualizzazione nelle opzioni DHCP

source: Cannot create reverse proxies: fix nginx configuration validation failure when creating reverse proxies
it: Impossibile creare proxy inversi: correggere l'errore di validazione della configurazione di nginx durante la creazione dei proxy inversi

source: Limit interface names to 13 characters: prevent mwan failure due to long interface names
it: Limitare i nomi delle interfacce a 13 caratteri: prevenire il fallimento di mwan a causa di nomi di interfacce troppo lunghi

source: OpenVPN, unable to remove reserved IP for Road Warrior client: fix issue where reserved IP cannot be removed for Roadwarrior clients
it: OpenVPN, impossibile rimuovere l'IP riservato per il client Road Warrior: risolto il problema per cui l'IP riservato non può essere rimosso per i client Roadwarrior

source: UI crash with over 3000 conntrack entries: fix UI crash and rpcd service break with large number of conntrack entries
it: Arresto anomalo dell'interfaccia utente con oltre 3000 voci conntrack: corretta l'interruzione dell'interfaccia utente e del servizio rpcd con un numero elevato di voci conntrack

source: MultiWAN, missing WAN disconnection/reconnection alerts: new implementation of WAN alerts to correctly handle connection and reconnection events
it: MultiWAN, avvisi di disconnessione/riconnessione WAN mancanti: nuova implementazione degli avvisi WAN per gestire correttamente gli eventi di connessione e riconnessione

source: Controller, display the name of disconnected users: show the name of disconnected units instead of just the UUID
it: Controller, visualizzare il nome degli utenti disconnessi: mostrare il nome delle unità disconnesse invece solo dell'UUID

source: Controller, display VPN port: add VPN port display in the NS8 UI for easier firewall configuration
it: Controller, visualizzazione porta VPN: aggiunta della visualizzazione della porta VPN nell'interfaccia utente di NS8 per una configurazione più semplice del firewall

source: Controller, validate CN: add validation rule for controller name field to allow only letters and numbers
it: Controller, convalida CN: aggiungere una regola di convalida per il campo nome controller per consentire solo lettere e numeri

source: Controller, do not remove .info file on disconnect: preserve unit information file for disconnected units
it: Controller, non rimuovere il file .info alla disconnessione: preservare il file delle informazioni dell'unità per le unità disconnesse

source: Controller, units continuously toggle connected/disconnected: address issue with erratic connection status display for multiple units
it: Controller, le unità alternano continuamente connesso/disconnesso: risolvere il problema della visualizzazione erratica dello stato di connessione per più unità

source: Migration, DHCP and DNS Services for blue/guest zone: enable DHCP and DNS services for migrated blue/guest zones
it: Migrazione, servizi DHCP e DNS per la zona blu/guest: abilitare i servizi DHCP e DNS per le zone blu/guest migrate

source: Migration, OpenVPN reserved IP not assigned: address issue with reserved IP assignment for migrated certificates
it: Migrazione, IP riservato OpenVPN non assegnato: problema di assegnazione dell'indirizzo IP riservato per certificati migrati

source: Migration, FlashStart username missing: fix issue where username field is not displayed in FlashStart interface after migration
it: Migrazione, nome utente FlashStart mancante: risolto il problema per cui il campo nome utente non viene visualizzato nell'interfaccia FlashStart dopo la migrazione

source: FlashStart, reduce number of queries: modify dnsdist configuration to optimize query handling and reduce unnecessary requests
it: FlashStart, ridurre il numero di query: modificare la configurazione di dnsdist per ottimizzare la gestione delle query e ridurre le richieste non necessarie

source: Major changes on 2024-07-05
it: Modifiche principali del 2024-07-05

source: Image version: `8-23.05.3-ns.1.1.0`
it: Versione dell'immagine: ``8-23.05.3-ns.1.1.0``

source: This releases focuses on fixing bugs and delivering new features.
it: Questa release si concentra sulla correzione di bug e sull'introduzione di nuove funzionalità.

source: Detailed changelog can be found `here <https://github.com/NethServer/nethsecurity/milestone/3?closed=1>`__.
it: Il changelog dettagliato è disponibile `qui <https://github.com/NethServer/nethsecurity/milestone/3?closed=1>`__.

source: Connections management: implemented interface for real-time monitoring and control of conntrack-tracked network connections
it: Gestione delle connessioni: implementata un'interfaccia per il monitoraggio e il controllo in tempo reale delle connessioni di rete tracciate da conntrack

source: MultiWAN sticky option: added sticky configuration in MultiWAN rules to maintain connection persistence across sessions
it: Opzione sticky MultiWAN: aggiunta la configurazione sticky nelle regole MultiWAN per mantenere la persistenza della connessione tra le sessioni

source: DPI signature updates: enabled updated Deep Packet Inspection signatures for both community and enterprise subscription types
it: Aggiornamenti delle firme DPI: firme aggiornate di Deep Packet Inspection abilitate per entrambi i tipi di abbonamento, community ed enterprise

source: Admin user management: implemented API functions to elevate local users to admin status and revoke admin privileges
it: Gestione utenti amministratori: implementate funzioni API per elevare utenti locali allo stato di amministratore e revocare i privilegi di amministratore

source: LDAP authentication enhancement: improved flexibility for Active Directory and non-standard LDAP Distinguished Name configurations
it: Miglioramento dell'autenticazione LDAP: maggiore flessibilità per Active Directory e configurazioni Distinguished Name LDAP non standard

source: Subscription repository authentication: implemented system_key verification for accessing subscription-based package repositories
it: Autenticazione del repository delle sottoscrizioni: implementata la verifica di system_key per l'accesso ai repository di pacchetti basati su sottoscrizione

source: NVME storage utilization: resolved issue preventing usage of unallocated NVME drive space for system logging
it: Utilizzo dello storage NVME: risolto un problema che impediva l'utilizzo dello spazio non allocato dell'unità NVME per la registrazione di sistema

source: Backup restore validation: added specific error messaging for incorrect passphrase input during backup restoration process
it: Validazione del ripristino del backup: aggiunti messaggi di errore specifici per l'inserimento di una passphrase errata durante il processo di ripristino del backup

source: MWAN metrics adjustment: modified interface metric allocation to start at 20 and increment by 10 for improved load balancing
it: Regolazione delle metriche MWAN: allocazione modificata delle metriche dell'interfaccia per iniziare da 20 e incrementare di 10 per un miglior bilanciamento del carico

source: Scheduled update UI consistency: corrected persistent display of completed scheduled updates in user interface
it: Coerenza dell'interfaccia utente per gli aggiornamenti programmati: corretta la visualizzazione persistente degli aggiornamenti programmati completati nell'interfaccia utente

source: MultiWAN policy labeling: fixed incorrect "balance" label display for custom single-gateway policies
it: Etichettatura delle policy MultiWAN: corretto il display errato dell'etichetta "balance" per le policy personalizzate con un solo gateway

source: MultiWAN form validation and input handling: implemented proper input field state management and form validation in policy editor
it: Validazione del modulo MultiWAN e gestione dell'input: implementata una corretta gestione dello stato dei campi di input e della validazione del modulo nell'editor delle policy

source: MultiWAN UI/UX refinement: enhanced port input flexibility and form submission logic for rules and policies
it: Raffinamento UI/UX MultiWAN: maggiore flessibilità nell'inserimento delle porte e logica di invio dei moduli migliorata per regole e policy

source: Post-migration DHCP functionality: addressed DHCP address assignment failure after version 7.9 to 8 migration
it: Funzionalità DHCP post-migrazione: risolto il problema di assegnazione degli indirizzi DHCP dopo la migrazione dalla versione 7.9 alla 8

source: VPN account creation side-effect: prevented unintended removal of user display names upon VPN account creation
it: Effetto collaterale della creazione dell'account VPN: impedita la rimozione non intenzionale dei nomi visualizzati degli utenti durante la creazione dell'account VPN

source: Migration network configuration: implemented removal of extraneous gateway entries from non-red interfaces
it: Configurazione della rete di migrazione: implementata la rimozione delle voci gateway superflue dalle interfacce non-red

source: MultiWAN migration logic: added automatic disabling of MultiWAN configurations with single provider during migration
it: Logica di migrazione MultiWAN: aggiunta la disabilitazione automatica delle configurazioni MultiWAN con un solo provider durante la migrazione

source: IPsec configuration display: corrected UI to accurately reflect custom IPsec tunnel parameter values
it: Visualizzazione configurazione IPsec: interfaccia utente corretta per riflettere accuratamente i valori dei parametri personalizzati del tunnel IPsec

source: Reverse proxy functionality: resolved proxy pass issues for WebTop access post-migration
it: Funzionalità di reverse proxy: risolti i problemi di proxy pass per l’accesso a WebTop dopo la migrazione

source: Local user database integrity: fixed disappearance of local user entries following system updates
it: Integrità del database utenti locali: risolta la scomparsa delle voci degli utenti locali dopo gli aggiornamenti di sistema

source: Inventory system robustness: improved handling of VLAN devices on bridge interfaces and DNS configuration retrieval
it: Robustezza del sistema di inventario: gestione migliorata dei dispositivi VLAN su interfacce bridge e recupero della configurazione DNS

source: Controller configuration persistence: fixed configuration file corruption issue after saving cluster interface settings
it: Persistenza della configurazione del controller: risolto il problema di corruzione del file di configurazione dopo il salvataggio delle impostazioni dell'interfaccia del cluster

source: Controller setup workflow: improved configuration form with advanced options and clearer user guidance
it: Flusso di lavoro per la configurazione del controller: modulo di configurazione migliorato con opzioni avanzate e indicazioni più chiare per l'utente

source: Major changes on 2024-06-05
it: Modifiche principali del 2024-06-05

source: **This is a security release**
it: **Questa è una release di sicurezza**

source: Image version: `8-23.05.3-ns.1.0.1`
it: Versione dell'immagine: ``8-23.05.3-ns.1.0.1``

source: Addressed security vulnerability: `GHSA-74xv-ww67-jjpx <https://github.com/NethServer/nethsecurity/security/advisories/GHSA-74xv-ww67-jjpx>`_ (disclosure will be published on 2024-06-20)
it: Risolta vulnerabilità di sicurezza: `GHSA-74xv-ww67-jjpx <https://github.com/NethServer/nethsecurity/security/advisories/GHSA-74xv-ww67-jjpx>`_ (la divulgazione sarà pubblicata il 20/06/2024)

source: Bug Fixes
it: Correzioni di bug

source: Security fix for GHSA-74xv-ww67-jjpx
it: Correzione di sicurezza per GHSA-74xv-ww67-jjpx

source: Ipsec: fix non working tunnel if selected WAN is a PPPoE over vlan
it: Ipsec: correzione del tunnel non funzionante se la WAN selezionata è una PPPoE su VLAN

source: MultiWAN: force maximum length for rules and policies names
it: MultiWAN: forza la lunghezza massima per i nomi di regole e policy

source: OpenVPN Road Warrior: prevent creation of users with trailing spaces
it: OpenVPN Road Warrior: impedire la creazione di utenti con spazi finali

source: Inventory: improve data collection for subscriptions and network
it: Inventario: migliorare la raccolta dei dati per abbonamenti e rete

source: Migration: fix OpenVPN Road Warrior users not visible in UI after migration
it: Migrazione: correggere la mancata visualizzazione degli utenti OpenVPN Road Warrior nell'interfaccia utente dopo la migrazione

source: API server: improved stability and performance by optimizing boot order for proper startup at boot time
it: Server API: stabilità e prestazioni migliorate ottimizzando l'ordine di avvio per garantire un corretto avvio al momento del boot

source: Major changes on 2024-05-22
it: Modifiche principali del 22-05-2024

source: **Stable**
it: **Stabile**

source: Image version: `8-23.05.3-ns.1.0.0`
it: Versione dell'immagine: ``8-23.05.3-ns.1.0.0``

source: The Stable release focuses on fixing bugs and improving the overall user experience.
it: La versione Stable si concentra sulla correzione dei bug e sul miglioramento dell'esperienza utente complessiva.

source: Detailed changelog can be found `here <https://github.com/NethServer/nethsecurity/milestone/2?closed=1>`__.
it: Il changelog dettagliato è disponibile `qui <https://github.com/NethServer/nethsecurity/milestone/2?closed=1>`__.

source: Routes: IPsec rules are now non-editable
it: Route: Le regole IPsec ora non sono modificabili

source: IPsec: added a validator for remote and local networks
it: IPsec: aggiunto un validatore per le reti remote e locali

source: Autoreload VPN pages: VPN pages now automatically reload
it: Ricaricamento automatico delle pagine VPN: le pagine VPN ora si ricaricano automaticamente

source: DHCP: added network scanning feature
it: DHCP: aggiunta la funzionalità di scansione della rete

source: IPsec: improved handling of multiple networks within a single tunnel
it: IPsec: gestione migliorata di più reti all'interno di un singolo tunnel

source: DHCP: force option for DHCP is now available in the UI
it: DHCP: l'opzione "force" per DHCP è ora disponibile nell'interfaccia utente

source: Threat shield: remove enterprise list on subscription removal
it: Threat shield: rimuovere l'elenco enterprise alla rimozione dell'abbonamento

source: DPI: remove premium signatures on unregister
it: DPI: rimuovere le firme premium alla deregistrazione

source: Subscription: improve unregister modal
it: Abbonamento: migliorare la finestra modale di annullamento registrazione

source: Inventory: collect basic usage statistics
it: Inventario: raccogliere statistiche di utilizzo di base

source: IPsec: better expose PFS option
it: IPsec: migliorare la visibilità dell'opzione PFS

source: Dashboard: add a notification of new available version
it: Dashboard: aggiungere una notifica di nuova versione disponibile

source: Firewall rules: improve overall page readability
it: Regole del firewall: migliorare la leggibilità complessiva della pagina

source: Zones and policies: improved drawer for WAN zone
it: Zone e policy: cassetto migliorato per la zona WAN

source: Dashboard: show a warning if DNS is not configured
it: Dashboard: mostra un avviso se il DNS non è configurato

source: NAT helpers: all NAT helpers are now included in the image but disabled by default
it: Helper NAT: tutti gli helper NAT sono ora inclusi nell'immagine ma disabilitati per impostazione predefinita

source: FlashStart: DNS resolution fails after disabling the service
it: FlashStart: la risoluzione DNS non funziona dopo la disattivazione del servizio

source: FlashStart: fix first configuratin
it: FlashStart: correggere la prima configurazione

source: Let’s Encrypt: certificates are not created
it: Let’s Encrypt: i certificati non vengono creati

source: FlashStart: redirect rule is ineffective
it: FlashStart: la regola di reindirizzamento non è efficace

source: Firewall: ipset is not updated after removing an address
it: Firewall: ipset non viene aggiornato dopo la rimozione di un indirizzo

source: Migration: host groups are not imported correctly in firewall rules
it: Migrazione: i gruppi host non vengono importati correttamente nelle regole del firewall

source: Firewall rules: unable to insert custom IP address
it: Regole del firewall: impossibile inserire un indirizzo IP personalizzato

source: Threat shield: changes to allowlist are not immediately applied
it: Threat shield: le modifiche alla allowlist non vengono applicate immediatamente

source: Migration: unable to edit imported IPsec tunnel
it: Migrazione: impossibile modificare il tunnel IPsec importato

source: OpenVPN road warrior: unable to re-create a previously created user from LDAP database
it: OpenVPN road warrior: impossibile ricreare un utente precedentemente creato dal database LDAP

source: OpenVPN RW: hosts are unreachable with bridged configuration
it: OpenVPN RW: gli host non sono raggiungibili con configurazione bridge

source: MultiWAN: track IP is not updated
it: MultiWAN: l'IP di monitoraggio non viene aggiornato

source: Reverse Proxy: allow IP list should not be mandatory
it: Reverse Proxy: la lista degli IP consentiti non dovrebbe essere obbligatoria

source: Controller: unable to connect unit if UI is disabled on port 443
it: Controller: impossibile connettere l'unità se l'interfaccia utente è disabilitata sulla porta 443

source: Subscription: unable to register a community subscription
it: Abbonamento: impossibile registrare un abbonamento community

source: Install from USB: bad partition table
it: Installazione da USB: tabella delle partizioni non valida

source: Migration: unable to start PPPoE interface
it: Migrazione: impossibile avviare l'interfaccia PPPoE

source: Threat shield: empty subscription feed
it: Threat shield: feed di sottoscrizione vuoto

source: Auto updates: cron job is not started during night
it: Aggiornamenti automatici: il job cron non viene avviato durante la notte

source: Threat shield not started from the UI
it: Scudo delle minacce non avviato dall'interfaccia utente

source: Migration: threat shield IP is not migrated
it: Migrazione: l'IP di Threat Shield non viene migrato

source: EFI: unable to use free space as extra storage
it: EFI: impossibile utilizzare lo spazio libero come memoria aggiuntiva

source: Zone: force creation in lowercase
it: Zona: forza la creazione in minuscolo

source: OpenVPN Road Warrior: OTP authentication, VPN disconnects after one hour
it: OpenVPN Road Warrior: autenticazione OTP, la VPN si disconnette dopo un'ora

source: ns-api: threatshield, set ban_nftexpiry and ban_logcount
it: ns-api: threatshield, impostare ban_nftexpiry e ban_logcount

source: NAT helpers: active FTP sessions do not transfer files
it: Helper NAT: le sessioni FTP attive non trasferiscono file

source: Major changes on 2024-04-29
it: Modifiche principali del 29-04-2024

source: **Relase Candidate 2**
it: **Release Candidate 2**

source: Image version: `8-23.05.3-ns.0.0.5-rc2`
it: Versione dell'immagine: ``8-23.05.3-ns.0.0.5-rc2``

source: The Release Candidate 2 release focuses on fixing bugs and improving the overall user experience. Detailed changelog can be found `here <https://github.com/NethServer/nethsecurity/milestone/1?closed=1>`__.
it: La versione Release Candidate 2 si concentra sulla correzione di bug e sul miglioramento dell'esperienza utente complessiva. Il changelog dettagliato è disponibile `qui <https://github.com/NethServer/nethsecurity/milestone/1?closed=1>`__.

source: Firewall rules: improved display of rules section.
it: Regole del firewall: visualizzazione migliorata della sezione delle regole.

source: FlashStart: added DNS resolution functionality after service disabling.
it: FlashStart: aggiunta la funzionalità di risoluzione DNS dopo la disattivazione del servizio.
