Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/release_notes.po
Languages: it

source: Release notes
it: Note di rilascio

source: NethSecurity releases changelogs.
it: NethSecurity changelog delle release.

source: List of `known bugs <https://github.com/NethServer/nethsecurity/issues?q=is%3Aissue%20is%3Aopen%20type%3ABug%20>`_
it: Elenco dei `bug noti <https://github.com/NethServer/nethsecurity/issues?q=is%3Aissue%20is%3Aopen%20type%3ABug%20>`_

source: Discussions around `possible bugs <http://community.nethserver.org/c/bug>`_
it: Discussioni su `possibili bug <http://community.nethserver.org/c/bug>`_

source: Major changes on 2025-04-10
it: Modifiche principali del 10-04-2025

source: Image version: `8-24.10.0-ns.1.5.1`
it: Versione dell'immagine: ``8-24.10.0-ns.1.5.1``

source: Bug fixes
it: Correzioni di bug

source: Bond: fixed issue with bond interfaces not having proper kernel module loaded
it: Bond: risolto il problema per cui le interfacce bond non caricavano correttamente il modulo kernel appropriato

source: Real-time traffic: adjusted traffic values to be more accurate across tables
it: Traffico in tempo reale: valori del traffico regolati per essere più accurati tra le varie tabelle

source: Threat Shield DNS/IP: removed graphic issue where more lists appears to have been enabled than the actual ones
it: Threat Shield DNS/IP: risolto un problema grafico in cui sembrava che fossero state abilitate più liste rispetto a quelle effettivamente attive

source: Monitoring: removed WAN ip display if the interface is offline
it: Monitoraggio: rimossa la visualizzazione dell'IP WAN se l'interfaccia è offline

source: UI: doubled the speed of the UI compressing the data sent to the browser
it: UI: velocizzata del doppio l'interfaccia utente comprimendo i dati inviati al browser

source: Major changes on 2025-04-08
it: Modifiche principali del 08-04-2025

source: Image version: `8-24.10.0-ns.1.5.0`
it: Versione dell'immagine: ``8-24.10.0-ns.1.5.0``

source: This release addresses a bug spotted in the previous release due to strengthening of the API backend.
it: Questa versione risolve un bug individuato nella versione precedente a causa del rafforzamento del backend API.

source: No additional changes have been made from the 1.5.0-rc1 to this release.
it: Non sono state apportate ulteriori modifiche rispetto alla versione 1.5.0-rc1 in questo rilascio.

source: Major changes on 2025-03-28
it: Modifiche principali del 28-03-2025

source: Image version: `8-24.10.0-ns.1.5.0-rc1`
it: Versione dell'immagine: ``8-24.10.0-ns.1.5.0-rc1``

source: This release contains new User Interfaces for services previously accessible only via Command Line, along with security enhancements and bug fixes.
it: Questa versione include nuove interfacce utente per servizi precedentemente accessibili solo tramite riga di comando, oltre a miglioramenti della sicurezza e correzioni di bug.

source: New features and improvements
it: Nuove funzionalità e miglioramenti

source: IPS: UI has been released
it: IPS: L'interfaccia utente è stata rilasciata

source: Threat Shield DNS: UI has been released
it: Threat Shield DNS: l'interfaccia utente è stata rilasciata

source: IP/MAC Binding: UI has been released
it: IP/MAC Binding: l'interfaccia utente è stata rilasciata

source: Netify Informatics: UI has been released released for service registration
it: Netify Informatics: L'interfaccia utente è stata rilasciata per la registrazione dei servizi

source: FlashStart DNS: Implementation improvements. NethSecurity’s DNS management is now independent from the DNS used for FlashStart to avoid any interaction with firewall services. External DNS servers are no longer required for unfiltered networks.
it: FlashStart DNS: Miglioramenti all’implementazione. La gestione DNS di NethSecurity è ora indipendente dal DNS utilizzato per FlashStart, evitando qualsiasi interazione con i servizi del firewall. I server DNS esterni non sono più necessari per le reti non filtrate.

source: Various modifications have been made to strengthen the system, including: API hardening, SNMP service is now disabled by default, Backup management modifications (subscription only)
it: Sono state apportate varie modifiche per rafforzare il sistema, tra cui: rafforzamento delle API, il servizio SNMP è ora disabilitato per impostazione predefinita, modifiche alla gestione dei backup (solo per abbonamento)

source: Bug fixes (this is a limited list of the most reported ones)
it: Correzioni di bug (questa è una lista limitata delle segnalazioni più frequenti)

source: Migration: OpenVPN device name issue when exceeding 16 characters
it: Migrazione: Problema con il nome del dispositivo OpenVPN quando supera i 16 caratteri

source: Migration: Loss of configuration for OpenVPN tunnels with similar names
it: Migrazione: Perdita della configurazione per tunnel OpenVPN con nomi simili

source: Migration: Road Warrior client migration interruption if a user certificate is missing
it: Migrazione: Interruzione della migrazione del client Road Warrior se manca un certificato utente

source: MultiWAN does not allow the firewall to send traffic outside if the lowest metric route is unavailable
it: MultiWAN non consente al firewall di inviare traffico all'esterno se la rotta con la metrica più bassa non è disponibile

source: OpenVPN Tunnel JSON export includes only the first remote endpoint, omitting others
it: L'esportazione JSON del tunnel OpenVPN include solo il primo endpoint remoto, omettendo gli altri

source: Enabling logging in firewall rules can overload the CPU
it: L'abilitazione della registrazione nei firewall rules può sovraccaricare la CPU

source: Netmap rules not loaded after a version update
it: Le regole Netmap non vengono caricate dopo un aggiornamento di versione

source: OpenVPN server web interface crashes if the user database is removed
it: L'interfaccia web del server OpenVPN va in crash se il database utenti viene rimosso

source: Firewall: “any” zone displayed as inactive
it: Firewall: la zona “any” viene visualizzata come inattiva

source: Port forward: error when assigning an object with an IP range
it: Port forwarding: errore durante l'assegnazione di un oggetto con un intervallo di IP

source: Major changes on 2024-12-18
it: Modifiche principali del 18-12-2024

source: Image version: `8-23.05.6-ns.1.4.1`
it: Versione dell'immagine: ``8-23.05.6-ns.1.4.1``

source: This release focuses on improved local monitoring and adds some experimental features.
it: Questa versione si concentra su un monitoraggio locale migliorato e aggiunge alcune funzionalità sperimentali.

source: The Realtime monitoring feature now allows users to filter traffic data by selecting a host and one of the following options: application, remote host, or protocol
it: La funzionalità di monitoraggio in tempo reale ora consente di filtrare i dati del traffico selezionando un host e una delle seguenti opzioni: applicazione, host remoto o protocollo

source: Realtime monitoring: added latency and drop rate charts
it: Monitoraggio in tempo reale: aggiunti grafici di latenza e tasso di perdita

source: Improve Netifyd network configuration: the configuration has been updated to improve network performance by limiting the number of interfaces it inspects
it: Miglioramento della configurazione di rete di Netifyd: la configurazione è stata aggiornata per migliorare le prestazioni di rete limitando il numero di interfacce che vengono ispezionate.

source: Ensure consistent hostname logging behavior in nginx logs: the nginx logs previously included the hostname twice, causing inconsistency inside Grafana
it: Garantire un comportamento coerente nella registrazione dell'hostname nei log di nginx: in precedenza, i log di nginx includevano l'hostname due volte, causando incoerenza all'interno di Grafana.

source: MultiWAN: add routing rules for router initiated traffic
it: MultiWAN: aggiungere regole di routing per il traffico iniziato dal router

source: FlashStart configuration is now automatically disabled if there is no active subscription
it: La configurazione di FlashStart viene ora automaticamente disabilitata se non è presente un abbonamento attivo.

source: Phonehome: collect statistics on the use of threat shield DNS
it: Phonehome: raccoglie statistiche sull'utilizzo di threat shield DNS

source: Experimental features
it: Funzionalità sperimentali

source: The following features are experimental and must be configured from the CLI:
it: Le seguenti funzionalità sono sperimentali e devono essere configurate dalla CLI:

source: MAC Binding: introduced MAC binding via DHCP reservation to enhance network security by associating specific MAC addresses with designated IP addresses
it: Associazione MAC: introdotta l'associazione MAC tramite prenotazione DHCP per migliorare la sicurezza della rete associando indirizzi MAC specifici a indirizzi IP designati

source: NUT support: configure UPS devices with NUT. This is not officially supported on machines with a subscription
it: Supporto NUT: configurare dispositivi UPS con NUT. Questa funzionalità non è ufficialmente supportata su macchine con una sottoscrizione

source: WireGuard configuration: configure WireGuard through the CLI, enabling management of multiple server instances and peers
it: Configurazione di WireGuard: configurare WireGuard tramite la CLI, consentendo la gestione di più istanze server e peer

source: Intrusion Prevention System (IPS): introduced Snort configuration via the CLI, allowing users to manage rules and policies
it: Intrusion Prevention System (IPS): introdotta la configurazione di Snort tramite CLI, consentendo la gestione di regole e politiche

source: Firewall rules: ipset reference not removed when modifying input rule
it: Regole del firewall: riferimento a ipset non rimosso durante la modifica della regola di input

source: Port forward: ipset reference not removed when modifying input rule
it: Port forwarding: riferimento a ipset non rimosso durante la modifica della regola di input

source: Firewall objects: host set modifications not reflected in nft rules
it: Oggetti firewall: le modifiche al set di host non sono riflesse nelle regole nft

source: OpenVPN Road Warrior: fix route issue with bond management address
it: OpenVPN Road Warrior: correggere il problema di routing con l'indirizzo di gestione del bond

source: Storage: disk was not displayed in UI after system update
it: Archiviazione: il disco non è stato visualizzato nell'interfaccia utente dopo l'aggiornamento del sistema

source: Flashstart: fixed and issue that prevented to send the heartbeat
it: Flashstart: risolto un problema che impediva l'invio del heartbeat

source: Migration: VPN accounts not visible if username contains uppercase letters
it: Migrazione: gli account VPN non sono visibili se il nome utente contiene lettere maiuscole

source: Dashboard: incorrect error message despite successful API response
it: Dashboard: messaggio di errore non corretto nonostante la risposta API sia avvenuta con successo

source: Monitoring: error when OpenVPN RoadWarrior has an incomplete configuration
it: Monitoraggio: errore quando OpenVPN RoadWarrior ha una configurazione incompleta

source: Migration: PPPoE alias import fails with invalid argument error
it: Migrazione: l'importazione dell'alias PPPoE non riesce con errore di argomento non valido

source: Major changes on 2024-10-17
it: Modifiche principali del 17-10-2024

source: Image version: `8-23.05.5-ns.1.3.0`
it: Versione dell'immagine: ``8-23.05.5-ns.1.3.0``

source: This release focuses on monitoring, migration improvements and better NethSecurity Controller integration.
it: Questa versione si concentra sul monitoraggio, sui miglioramenti della migrazione e su una migliore integrazione con NethSecurity Controller.

source: Detailed changelog can be found `here <https://github.com/NethServer/nethsecurity/milestone/5?closed=1>`__
it: Il changelog dettagliato è disponibile `qui <https://github.com/NethServer/nethsecurity/milestone/5?closed=1>`__

source: Update to OpenWrt 23.05.5: see upstream `changelog <https://openwrt.org/releases/23.05/notes-23.05.5>`_
it: Aggiornamento a OpenWrt 23.05.5: vedere il `changelog upstream <https://openwrt.org/releases/23.05/notes-23.05.5>`_

source: Centralized unit update management: from the controller it should be possible to update the unit seamlessly (packages and/or image)
it: Gestione centralizzata degli aggiornamenti delle unità: dal controller dovrebbe essere possibile aggiornare l'unità senza interruzioni (pacchetti e/o immagine)

source: Real time monitoring page: create a comprehensive dashboard for NethSecurity monitoring
it: Pagina di monitoraggio in tempo reale: creare una dashboard completa per il monitoraggio di NethSecurity

source: Historical monitoring: historical monitoring allows the user to see how the firewall is behaving from the NethSecurity Controller
it: Monitoraggio storico: il monitoraggio storico consente di visualizzare il comportamento del firewall dal NethSecurity Controller

source: Support virtual machine tools for KVM an VMware: remove all tools from the image and provide them as optional packages
it: Supporto degli strumenti per macchine virtuali per KVM e VMware: rimuovere tutti gli strumenti dall'immagine e fornirli come pacchetti opzionali

source: Port forward: support all objects inside restrict field: implement support for multiple object types in the "restrict access from" field
it: Port forwarding: supporto per tutti gli oggetti nel campo di restrizione: implementare il supporto per più tipi di oggetti nel campo "limita accesso da"

source: Inventory, advanced usage statistics: gather anonymous statistics on system usage
it: Inventario, statistiche avanzate di utilizzo: raccogliere statistiche anonime sull'utilizzo del sistema

source: Improve Threat Shield UI: expose logging and brute force protection settings in the Threat Shield page
it: Miglioramento dell'interfaccia di Threat Shield: esporre le impostazioni di logging e di protezione contro gli attacchi brute force nella pagina di Threat Shield

source: NAT helpers UI: new NAT helper configuration page
it: Interfaccia NAT helpers: nuova pagina di configurazione dei NAT helper

source: Remote support (ns-don): open netdata port (19999): add access to port 19999 from tunDON to allow viewing netdata UI from remote support sessions
it: Supporto remoto (ns-don): aprire la porta netdata (19999): aggiungere l’accesso alla porta 19999 da tunDON per consentire la visualizzazione dell’interfaccia utente di netdata durante le sessioni di supporto remoto

source: NAT rules: add "0.0.0.0/0 any address": add "0.0.0.0/0 any address" option among destination address suggestions
it: Regole NAT: aggiungere "0.0.0.0/0 qualsiasi indirizzo": aggiungere l'opzione "0.0.0.0/0 qualsiasi indirizzo" tra i suggerimenti per l'indirizzo di destinazione

source: Zoned and policies: allow to set the logging policy for each zone
it: Zone e policy: consente di impostare la policy di logging per ciascuna zona

source: DNS and DHCP page: search is now case insensitive
it: Pagina DNS e DHCP: la ricerca ora non distingue tra maiuscole e minuscole

source: OpenVPN Road Warrior: add a button to download all OpenVPN certificates associated with a specific Road Warrior instance
it: OpenVPN Road Warrior: aggiungere un pulsante per scaricare tutti i certificati OpenVPN associati a una specifica istanza Road Warrior

source: UI: improves usability, navigation, layout, and visual elements on multiple pages
it: UI: migliora l'usabilità, la navigazione, il layout e gli elementi visivi su più pagine

source: Migration: at the end of the migration, a log file is created with all the actions performed, the log is available at ``/root/migration.log``
it: Migrazione: al termine della migrazione viene creato un file di log con tutte le azioni eseguite; il log è disponibile in ``/root/migration.log``

source: MultiWAN: improve default configuration to restore the uplink after all WANs losed connectivity
it: MultiWAN: migliorare la configurazione predefinita per ripristinare l'uplink dopo che tutte le WAN hanno perso la connettività

source: Migration: fix firewall rules that were using blue zone
it: Migrazione: correggere le regole del firewall che utilizzavano la zona blue

source: Migration: network configuration not migrated if alias has no gateway
it: Migrazione: configurazione di rete non migrata se l'alias non ha un gateway

source: Migration: fixes firewall rules with "any" service migrate incorrectly
it: Migrazione: correzione delle regole del firewall con il servizio "any" che migrano in modo errato

source: Migration: fixes root password authentication flag incorrectly displayed
it: Migrazione: corregge la visualizzazione errata del flag di autenticazione con password di root

source: Migration: rename VPN interfaces that caused a firewall error if the name was too long
it: Migrazione: rinominare le interfacce VPN che causavano un errore del firewall se il nome era troppo lungo

source: Migration: fixes missing account_email in ACME that caused a certificate renewal failure
it: Migrazione: risolve la mancanza di account_email in ACME che causava un errore nel rinnovo del certificato

source: Migration: fixes wrong zone for OpenVPN and IPsec custom rules
it: Migrazione: corregge la zona errata per le regole personalizzate di OpenVPN e IPsec

source: Migration: fixes incorrect reflection zone on port forward for VPNs
it: Migrazione: corregge la zona di riflessione errata sul port forwarding per le VPN

source: Migration: remove custom zones on migration, zones are converted to CIDR networks
it: Migrazione: rimuovere le zone personalizzate durante la migrazione, le zone vengono convertite in reti CIDR

source: Migration: fixes FlashStart not enabled on guest/blue interface
it: Migrazione: risolto il problema per cui FlashStart non era abilitato sull'interfaccia guest/blue

source: Migration: fixes OpenVPN Road Warrior certificate not exported if CN contains the dot character
it: Migrazione: risolto il problema per cui il certificato OpenVPN Road Warrior non veniva esportato se il CN conteneva il carattere punto

source: Migration: correctly import OpenVPN Road Warrior users without 'status' prop
it: Migrazione: importazione corretta degli utenti OpenVPN Road Warrior senza la proprietà 'status'

source: OpenVPN Road Warrior: add client compression setting missing that was missing in .ovpn file
it: OpenVPN Road Warrior: aggiunta l'impostazione di compressione client che mancava nel file .ovpn

source: OpenVPN Road Warrior: fix IP pool management
it: OpenVPN Road Warrior: correggere la gestione del pool di indirizzi IP

source: OpenVPN Road Warrior: fix expired CRL that was causing a connection failure after 6 months
it: OpenVPN Road Warrior: risolto il problema del CRL scaduto che causava un errore di connessione dopo 6 mesi

source: OpenVPN tunnel between NS7 and NS8 cipher: connection was failing despite showing "connected"
it: Tunnel OpenVPN tra NS7 e NS8 cifratura: la connessione non riusciva nonostante mostrasse "connesso"

source: OpenVPN tunnel client: fix displayed mode
it: Client tunnel OpenVPN: correggere la modalità visualizzata

source: OpenVPN tunnel client: wrong "bridged" mode as new default, new default is now r"outed"
it: Client tunnel OpenVPN: modalità "bridged" errata come nuovo valore predefinito, il nuovo valore predefinito è ora "routed"

source: OpenVPN tunnel client resets cipher to `AES-128-CBC`: correctly set cipher without resetting it
it: Il client tunnel OpenVPN reimposta il cifrario su ``AES-128-CBC``: impostare correttamente il cifrario senza reimpostarlo

source: OpenVPN tunnel client: correctly set "tap" and "tun" mode on client tunnel creation
it: Client tunnel OpenVPN: impostare correttamente la modalità "tap" e "tun" durante la creazione del tunnel client

source: Unable to disable legacy LuCI UI after system upgrade: fix LuCI UI disable option
it: Impossibile disabilitare l'interfaccia utente LuCI legacy dopo l'aggiornamento del sistema: correggere l'opzione di disabilitazione dell'interfaccia LuCI

source: Controller connection (ns-plug): force cleanup of package cache and sync unit status
it: Connessione del controller (ns-plug): forza la pulizia della cache dei pacchetti e la sincronizzazione dello stato dell'unità

source: Migration: improve in place migrate, add delay before image write to reduce issues when writing the kernel
it: Migrazione: migliorare la migrazione in-place, aggiungere un ritardo prima della scrittura dell'immagine per ridurre i problemi durante la scrittura del kernel

source: Conntrack: make sure counters is set: Avoid error from missing counters.
it: Conntrack: assicurarsi che counters sia impostato: evitare errori dovuti a counters mancanti.

source: Reverse proxy: correctly set default certificate
it: Reverse proxy: impostare correttamente il certificato predefinito

source: Reverse proxy: fix configuration to allow access only from the specified network
it: Reverse proxy: correggere la configurazione per consentire l'accesso solo dalla rete specificata

source: Netdata: mitigated issue with orphaned fping process continuing to ping removed IPs
it: Netdata: risolto un problema con il processo fping orfano che continuava a eseguire ping su IP rimossi

source: Cannot logout while a toast notification is shown: prevent toast notifications from blocking the account menu
it: Impossibile effettuare il logout mentre è visualizzata una notifica toast: impedire che le notifiche toast blocchino il menu account

source: API server: fix restarting on package update
it: Server API: correggere il riavvio durante l'aggiornamento del pacchetto

source: Interface page fails with QoS enabled on PPPoE: improve validator on network configuration page
it: La pagina dell'interfaccia non funziona con QoS abilitato su PPPoE: migliorare il validatore nella pagina di configurazione della rete

source: Cannot duplicate a port forward: fix duplication of port forwarding rule
it: Impossibile duplicare un inoltro di porta: correggere la duplicazione della regola di port forwarding

source: Report: disable "open report" button when UI is displayed from the controller
it: Report: disabilitare il pulsante ``Apri report`` quando l'interfaccia utente è visualizzata dal controller

source: DPI report: fix crash on netifyd restart
it: Report DPI: risolto arresto anomalo al riavvio di netifyd

source: Major changes on 2024-08-08
it: Modifiche principali del 08-08-2024

source: Image version: `8-23.05.4-ns.1.2.0`
it: Versione dell'immagine: ``8-23.05.4-ns.1.2.0``

source: This release focuses on new features for subscriptions and improved user experience.
it: Questa versione si concentra su nuove funzionalità per gli abbonamenti e su un'esperienza utente migliorata.

source: Detailed changelog can be found `here <https://github.com/NethServer/nethsecurity/milestone/4?closed=1>`__
it: Il changelog dettagliato è disponibile `qui <https://github.com/NethServer/nethsecurity/milestone/4?closed=1>`__

source: Update to OpenWrt 23.05.4: update OpenWrt to version 23.05.4 with relevant package and core changes
it: Aggiornamento a OpenWrt 23.05.4: aggiornare OpenWrt alla versione 23.05.4 con le relative modifiche ai pacchetti e al core

source: Free Threat Shield lists for community: implement free Threat Shield lists for community users, enhancing overall threat protection
it: Liste Threat Shield gratuite per la community: implementare liste Threat Shield gratuite per gli utenti della community, migliorando la protezione complessiva dalle minacce
