Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/remote_access.po
Languages: it

source: Remote access
it: Accesso remoto

source: Default credentials
it: Credenziali predefinite

source: Default credentials are:
it: Le credenziali predefinite sono:

source: User: ``root``
it: Utente: ``root``

source: Such credentials can be used to log in to the web interface or using SSH:
it: Queste credenziali possono essere utilizzate per accedere all'interfaccia web o tramite SSH:

source: Web user interface: **https://<server_ip>:9090**
it: Interfaccia utente web: **https://<server_ip>:9090**

source: SSH default port: **22**
it: Porta SSH predefinita: **22**

source: NethSecurity's default hostname is: ``NethSec``
it: Il nome host predefinito di NethSecurity è: ``NethSec``

source: This hostname can be modified in the System Settings section.
it: Questo hostname può essere modificato nella sezione Impostazioni di sistema.

source: The default password for the root user is ``Nethesis,1234``. It is recommended to change the password immediately after logging in for the first time.
it: La password predefinita per l'utente root è ``Nethesis,1234``. Si consiglia di cambiare la password immediatamente dopo il primo accesso.

source: Reset root password
it: Reimpostare la password di root

source: The ``root password`` can be reset by entering in :ref:`Failsafe mode <failsafe-section>`. Once in this mode, you can change the password by executing the following commands. ::
it: La ``root password`` può essere reimpostata accedendo alla :ref:`Modalità Failsafe <failsafe-section>`. Una volta in questa modalità, è possibile cambiare la password eseguendo i seguenti comandi. ::

source: Restart the firewall with the command ::
it: Riavviare il firewall con il comando ::

source: Web user interface
it: Interfaccia utente web

source: NethSecurity UI (User Interface), the NethSecurity official web interface, is available on port ``9090`` at the following URL: **https://<server_ip>:9090**.
it: L'interfaccia utente di NethSecurity (User Interface), l'interfaccia web ufficiale di NethSecurity, è disponibile sulla porta ``9090`` al seguente URL: **https://<server_ip>:9090**.

source: To ease the access, NethSecurity UI is also available on standard HTTP port ``443`` at the following URL: **https://<server_ip>** or **http://<server_fqdn>**.
it: Per facilitare l'accesso, l'interfaccia utente di NethSecurity è disponibile anche sulla porta HTTP standard ``443`` al seguente URL: **https://<server_ip>** oppure **http://<server_fqdn>**.

source: Both URLs are accessible from LAN and WAN by default.
it: Entrambi gli URL sono accessibili dalla LAN e dalla WAN per impostazione predefinita.

source: Restricting access to NethSecurity UI
it: Limitazione dell'accesso all'interfaccia utente di NethSecurity

source: By default, this interface is accessible on port 9090 from both your internal network (LAN) and the wider internet (WAN). While convenient, this can potentially introduce a security risk.
it: Per impostazione predefinita, questa interfaccia è accessibile sulla porta 9090 sia dalla rete interna (LAN) sia da internet (WAN). Sebbene sia conveniente, ciò può potenzialmente rappresentare un rischio per la sicurezza.

source: To mitigate this risk, you have two options (remove or restrict access):
it: Per mitigare questo rischio, sono disponibili due opzioni (rimuovere o limitare l'accesso):

source: remove the ``Allow-UI-from-WAN`` rule: go to the Firewall rules page, navigate to the ``Input rules`` tab, and locate the "Allow-UI-from-WAN" rule. Click the :guilabel:`Delete` button to remove it
it: rimuovere la regola ``Allow-UI-from-WAN``: andare alla pagina delle regole del Firewall, navigare nella scheda ``Regole di input`` e individuare la regola "Allow-UI-from-WAN". Fare clic sul pulsante :guilabel:`Elimina` per rimuoverla

source: restrict access from specific IPs or networks: in the Firewall rules page, locate the "Allow-UI-from-WAN" rule and click the :guilabel:`Edit` button. In the ``Source address`` field, enter the IP addresses or network CIDRs from which you want to allow access to the NethSecurity UI.
it: limitare l'accesso da IP o reti specifiche: nella pagina delle regole del Firewall, individuare la regola "Allow-UI-from-WAN" e fare clic sul pulsante :guilabel:`Modifica`. Nel campo ``Indirizzo sorgente``, inserire gli indirizzi IP o i CIDR di rete dai quali si desidera consentire l'accesso all'interfaccia utente di NethSecurity.

source: For example, to allow access only from your home network, you could enter the 192.168.1.0/24 network. Only allow access from trusted IP addresses or networks. Leaving this field blank will allow anyone on the internet to access the NethSecurity UI.
it: Ad esempio, per consentire l'accesso solo dalla propria rete domestica, si potrebbe inserire la rete 192.168.1.0/24. Consentire l'accesso solo da indirizzi IP o reti affidabili. Lasciando questo campo vuoto, chiunque su Internet potrà accedere all'interfaccia utente di NethSecurity.

source: Additional security measures:
it: Misure di sicurezza aggiuntive:

source: use a strong password for the admin user
it: utilizzare una password robusta per l'utente amministratore

source: enable :ref:`two-factor authentication (2FA) <2fa-section>` for the admin user
it: abilitare :ref:`l'autenticazione a due fattori (2FA) <2fa-section>` per l'utente amministratore

source: keep your firewall up to date with the latest security patches
it: mantenere il firewall aggiornato con le ultime patch di sicurezza

source: Change web user interface port
it: Modificare la porta dell'interfaccia utente web

source: Users can change the NethSecurity UI port.
it: Gli utenti possono modificare la porta dell'interfaccia utente di NethSecurity.

source: To change the NethSecurity UI port from 9090 to 8181, execute: ::
it: Per modificare la porta dell'interfaccia utente di NethSecurity da 9090 a 8181, eseguire: ::

source: The controller uses port 9090 to communicate with the unit. Changing the port will prevent the controller from managing the NethSecurity.
it: Il controller utilizza la porta 9090 per comunicare con l'unità. Modificare la porta impedirà al controller di gestire NethSecurity.

source: Disable web user interface on port 443
it: Disabilitare l'interfaccia utente web sulla porta 443

source: While exposing port 443 (HTTPS) can be necessary for certain services, directly accessing the NethSecurity UI through this port may introduce a potential security risk. Here's how to safely maintain port 443 functionality while protecting your NethSecurity UI.
it: Sebbene l'esposizione della porta 443 (HTTPS) possa essere necessaria per alcuni servizi, l'accesso diretto all'interfaccia utente di NethSecurity tramite questa porta può rappresentare un potenziale rischio per la sicurezza. Ecco come mantenere in modo sicuro la funzionalità della porta 443 proteggendo al contempo l'interfaccia utente di NethSecurity.

source: If you don't require accessing the NethSecurity UI through port 443, disable it to minimize attack opportunities. Execute the following commands on your NethServer system: ::
it: Se non è necessario accedere all'interfaccia utente di NethSecurity tramite la porta 443, disabilitarla per ridurre al minimo le opportunità di attacco. Eseguire i seguenti comandi sul sistema NethServer: ::

source: This option disables access to the NethSecurity UI through both the server IP address and FQDN on port 443.
it: Questa opzione disabilita l'accesso all'interfaccia utente di NethSecurity sia tramite l'indirizzo IP del server che tramite FQDN sulla porta 443.

source: If you need port 443 for other services, configure your firewall to redirect traffic destined for port 443 to a separate web server hosting those services. Ensure this separate server has strong security measures in place.
it: Se è necessario utilizzare la porta 443 per altri servizi, configurare il firewall per reindirizzare il traffico destinato alla porta 443 a un server web separato che ospita tali servizi. Assicurarsi che questo server separato disponga di solide misure di sicurezza.

source: Privacy policy
it: Informativa sulla privacy

source: In some cases, it is necessary to display the privacy policy of a product before login. NethSecurity does not display any privacy policy by default, but it is possible to add a link to an external website that contains the privacy policy.
it: In alcuni casi, è necessario visualizzare l'informativa sulla privacy di un prodotto prima dell'accesso. NethSecurity non mostra alcuna informativa sulla privacy per impostazione predefinita, ma è possibile aggiungere un collegamento a un sito web esterno che contiene l'informativa sulla privacy.

source: To add a link to the privacy policy, access the command line and execute: ::
it: Per aggiungere un collegamento all'informativa sulla privacy, accedere alla riga di comando ed eseguire: ::

source: Substitute ``https://mysite.org/privacy_policy`` with the URL of your privacy policy.
it: Sostituire ``https://mysite.org/privacy_policy`` con l'URL della propria informativa sulla privacy.

source: The link to the privacy policy will be displayed inside the login page after next page refresh.
it: Il link alla privacy policy verrà visualizzato all'interno della pagina di accesso dopo il prossimo aggiornamento della pagina.

source: Legacy web user interface
it: Interfaccia utente web legacy

source: Changes done via LuCI web interface may break the official NethSecurity UI. Use at your own risk!
it: Le modifiche effettuate tramite l'interfaccia web LuCI possono compromettere il funzionamento dell'interfaccia ufficiale di NethSecurity. Utilizzare a proprio rischio!

source: NethSecurity offers also LuCI, the original OpenWrt web interface, which provides a wide range of configuration options but is not officially supported. Luci is disabled by default. To enable it, execute: ::
it: NethSecurity offre anche LuCI, l'interfaccia web originale di OpenWrt, che fornisce un'ampia gamma di opzioni di configurazione ma non è ufficialmente supportata. LuCI è disabilitato per impostazione predefinita. Per abilitarla, eseguire: ::

source: Once enabled, Luci will be available only on port 443 at this URL: **https://<server_ip>/cgi-bin/luci**
it: Una volta abilitato, Luci sarà disponibile solo sulla porta 443 a questo URL: **https://<server_ip>/cgi-bin/luci**

source: Changes to the following LuCI pages are known to cause unpredictable behavior:
it: Le modifiche alle seguenti pagine di LuCI sono note per causare comportamenti imprevedibili:

source: HTTP access tab: it configures uhttpd which is not present inside NethSecurity
it: Scheda accesso HTTP: configura uhttpd che non è presente all'interno di NethSecurity

source: Logging tab: it configures logd which is not present inside NethSecurity
it: Scheda Registrazione: configura logd, che non è presente all'interno di NethSecurity.

source: Networking: configuration created with this page is not compatible with NethSecurity UI
it: Rete: la configurazione creata con questa pagina non è compatibile con l'interfaccia utente di NethSecurity

source: If previously enabled, the LuCI web interface can be disabled by executing: ::
it: Se precedentemente abilitata, l'interfaccia web LuCI può essere disabilitata eseguendo: ::

source: NethSecurity UI 2FA
it: Interfaccia utente NethSecurity 2FA

source: Protecting your NethSecurity administrator account is crucial, and Two-Factor Authentication (2FA) adds an extra layer of security beyond just a password. 2FA requires two verification steps when logging in. Instead of just a password, you'll also need a temporary code generated by a separate app on your smartphone or tablet. This significantly reduces the risk of unauthorized access even if your password is compromised.
it: Proteggere l'account amministratore di NethSecurity è fondamentale, e l'Autenticazione a Due Fattori (2FA) aggiunge un ulteriore livello di sicurezza oltre alla sola password. La 2FA richiede due passaggi di verifica durante l'accesso. Invece di utilizzare solo una password, sarà necessario anche un codice temporaneo generato da un'app separata sul proprio smartphone o tablet. Questo riduce significativamente il rischio di accessi non autorizzati anche nel caso in cui la password venga compromessa.

source: Enabling 2FA on NethSecurity UI:
it: Abilitazione dell'autenticazione a due fattori (2FA) nell'interfaccia utente di NethSecurity:

source: Log in to your NethSecurity web interface
it: Accedere all'interfaccia web di NethSecurity

source: Click on the user icon in the top right corner and select ``Account settings``
it: Fare clic sull'icona utente nell'angolo in alto a destra e selezionare ``Impostazioni account``

source: Find the Two-factor authentication option and click :guilabel:`Configure 2FA`
it: Individuare l'opzione Autenticazione a due fattori e fare clic su :guilabel:`Configura 2FA`

source: Setting up your authenticator app:
it: Configurazione dell'app di autenticazione:

source: Download an authenticator app on your smartphone or tablet. Popular options include FreeOTP, Google Authenticator, and Microsoft Authenticator.
it: Scaricare un'app di autenticazione sul proprio smartphone o tablet. Le opzioni più diffuse includono FreeOTP, Google Authenticator e Microsoft Authenticator.

source: Open the app and scan the QR code displayed on the NethSecurity web interface. This will add your NethSecurity account to the authenticator app.
it: Aprire l'app e scansionare il codice QR visualizzato sull'interfaccia web di NethSecurity. Questo aggiungerà l'account NethSecurity all'app di autenticazione.

source: Enter the 6-digit code displayed by your authenticator app in the One-Time Password (OTP) field on the NethSecurity web interface.
it: Inserire il codice a 6 cifre visualizzato dall'app di autenticazione nel campo One-Time Password (OTP) dell'interfaccia web di NethSecurity.

source: The system will also provide you with a set of backup codes. These codes can be used to log in if you lose your smartphone or authenticator app. Store these codes securely, preferably offline.
it: Il sistema fornirà anche un set di codici di backup. Questi codici possono essere utilizzati per accedere nel caso in cui si perda lo smartphone o l'app di autenticazione. Conservare questi codici in modo sicuro, preferibilmente offline.

source: You can disable 2FA from the same page.
it: È possibile disabilitare l'autenticazione a due fattori (2FA) dalla stessa pagina.

source: NethSecurity UI administrators
it: Amministratori dell'interfaccia utente di NethSecurity

source: The default user for accessing the user web interface is root, but it is possible to create other administrator users with access only to the web interface.
it: L'utente predefinito per accedere all'interfaccia web utente è root, ma è possibile creare altri utenti amministratori con accesso esclusivo all'interfaccia web.

source: To create a user in the local database, enter the `Username` and `Display name`. Ensure to set a password for the user; this is mandatory for administrator users. If the user needs administrative access to the web interface, enable the `Administrator user` option.
it: Per creare un utente nel database locale, inserire il ``Nome utente`` e il ``Nome visualizzato``. Assicurarsi di impostare una password per l'utente; questa è obbligatoria per gli utenti amministratori. Se l'utente necessita di accesso amministrativo all'interfaccia web, abilitare l'opzione ``Utente amministratore``.

source: It is possible to grant or remove administrative access only to users residing in the local database.
it: È possibile concedere o revocare l'accesso amministrativo solo agli utenti presenti nel database locale.

source: Auditing user actions
it: Verifica delle azioni utente

source: Every time an administrator logs in to the NethSecurity UI, the system logs the event, inside the `/var/log/messages` file. Example of login event for user `goofy`: ::
it: Ogni volta che un amministratore accede all'interfaccia utente di NethSecurity, il sistema registra l'evento all'interno del file `/var/log/messages`. Esempio di evento di accesso per l'utente `goofy`: ::

source: Example of logout event for user `goofy`: ::
it: Esempio di evento di logout per l'utente `goofy`: ::

source: Also every action performed by an administrator inside the NethSecurity UI is logged inside the `/var/log/messages` file. Example of action performed by user `goofy`: ::
it: Inoltre, ogni azione eseguita da un amministratore all'interno dell'interfaccia NethSecurity viene registrata nel file `/var/log/messages`. Esempio di azione eseguita dall'utente `goofy`: ::

source: By default, the system accepts SSH connections on the standard port 22 from the internal network (LAN). Root access is enabled using the default password. To allow SSH access from the wider internet (WAN), a firewall input rule must be added for the server's listening port.
it: Per impostazione predefinita, il sistema accetta connessioni SSH sulla porta standard 22 dalla rete interna (LAN). L'accesso come root è abilitato utilizzando la password predefinita. Per consentire l'accesso SSH da internet (WAN), è necessario aggiungere una regola di input del firewall per la porta di ascolto del server.

source: From a Linux machine, use the following command: ::
it: Da una macchina Linux, utilizzare il seguente comando: ::

source: VGA console and keyboard layout
it: Console VGA e layout tastiera

source: If the machine has a VGA/DVI/HDMI video port, connect a monitor to it. Then, you will be able to log in to the console using the default credentials above.
it: Se la macchina dispone di una porta video VGA/DVI/HDMI, collegare un monitor ad essa. In questo modo sarà possibile accedere alla console utilizzando le credenziali predefinite sopra indicate.

source: Please note that the system is configured with the US keyboard layout.
it: Si noti che il sistema è configurato con il layout di tastiera US.

source: To temporarily change the current keyboard layout to Italian, log in to the system and then execute the following command: ::
it: Per modificare temporaneamente il layout della tastiera corrente in italiano, accedere al sistema ed eseguire il seguente comando: ::

source: The keyboard layout configuration can be saved by writing the keymap code inside ``/etc/keymap``. Example for ``it`` (Italian) keymap: ::
it: La configurazione del layout della tastiera può essere salvata scrivendo il codice della mappa dei tasti all'interno di ``/etc/keymap``. Esempio per la mappa dei tasti ``it`` (italiana): ::

source: To obtain the list of available keymaps, execute the following command: ::
it: Per ottenere l'elenco delle keymap disponibili, eseguire il seguente comando: ::

source: Serial console
it: Console seriale

source: If the machine has a serial port (RS-232, tipically available with DE-9 connector or RJ45/8P8C connector) it's possible to access the firewall directly through it using a null-modem cable and a terminal program. ``PuTTY`` (version 0.60 or higher) is a common choice if you are using Microsoft Windows, while Linux distros offer tools as ``minicom``, ``picocom``, or ``screen``.
it: Se la macchina dispone di una porta seriale (RS-232, tipicamente disponibile con connettore DE-9 o connettore RJ45/8P8C) è possibile accedere direttamente al firewall tramite essa utilizzando un cavo null-modem e un programma terminale. ``PuTTY`` (versione 0.60 o superiore) è una scelta comune se si utilizza Microsoft Windows, mentre le distribuzioni Linux offrono strumenti come ``minicom``, ``picocom`` o ``screen``.

source: Default acces parameters for NethSecurity 8 are:
it: I parametri di accesso predefiniti per NethSecurity 8 sono:

source: Baud rate: 115200,
it: Velocità di trasmissione: 115200,

source: Data bits:8
it: Bit dati: 8

source: Parity :None
it: Parità : Nessuna

source: Stop bits to 1
it: Bit di stop su 1

source: These last three parameters are often abbreviated as 8N1
it: Questi ultimi tre parametri sono spesso abbreviati come 8N1

source: USB-to-Serial Adapters
it: Adattatori USB-Seriale

source: In case of need, NethSecurity can be used to access another server via the serial console. If the hardware does not have an RS-232 port, USB-to-serial adapters can be used. For this reason, it is possible to download and install drivers for the most common adapters on NethSecurity. These drivers are provided as-is and are **not supported by Nethesis** (if using an Enterprise or Subscription version).
it: In caso di necessità, NethSecurity può essere utilizzato per accedere a un altro server tramite la console seriale. Se l'hardware non dispone di una porta RS-232, è possibile utilizzare adattatori USB-seriale. Per questo motivo, è possibile scaricare e installare i driver per gli adattatori più comuni su NethSecurity. Questi driver sono forniti così come sono e **non sono supportati da Nethesis** (in caso di utilizzo della versione Enterprise o Subscription).

source: Extra packages, including kernel modules, are not preserved across image upgrades, so in the event of an upgrade, you will need to download and install them again if needed.
it: I pacchetti extra, inclusi i moduli del kernel, non vengono mantenuti durante gli aggiornamenti dell'immagine; pertanto, in caso di aggiornamento, sarà necessario scaricarli e installarli nuovamente se necessario.

source: Two packages are provided for installation, covering the vast majority of adapters available on the market. ::
it: Sono forniti due pacchetti per l'installazione, che coprono la grande maggioranza degli adattatori disponibili sul mercato. ::

source: To install Prolific PL2303 driver:
it: Per installare il driver Prolific PL2303:

source: The logs will show an output similar to this:
it: I log mostreranno un output simile al seguente:

source: If your client has received an IP address from NethSecurity's DHCP, it will use NethSecurity as both gateway and DNS server. Under these conditions you can contact NethSecurity using its hostname **nethsec** instead of the **server_ip** e.g.
it: Se il client ha ricevuto un indirizzo IP dal DHCP di NethSecurity, utilizzerà NethSecurity sia come gateway che come server DNS. In queste condizioni è possibile contattare NethSecurity utilizzando il suo hostname **nethsec** invece di **server_ip**, ad esempio
