Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/remote_support.po
Languages: it

source: Remote support
it: Supporto remoto

source: Enterprise subscription required
it: È necessaria una subscription Enterprise

source: This feature is available only if the firewall has a valid Enterprise subscription.
it: Questa funzionalità è disponibile solo se il firewall dispone di un abbonamento Enterprise valido.

source: The :ref:`Enterprise subscription <subscription-section>` allows you to access the Nethesis remote support.
it: L'abbonamento :ref:`Enterprise <subscription-section>` consente di accedere al supporto remoto Nethesis.

source: The remote support session will connect the firewall to a `WindMill instance <https://github.com/nethesis/windmill>`_ hosted by Nethesis at ``sos.nethesis.it``. The firewall must be able to connect to the above host on port ``1194`` UDP. If port ``1194`` is closed, the system will try to fallback on port ``443`` TCP.
it: La sessione di supporto remoto collegherà il firewall ad una `istanza di WindMill <https://github.com/nethesis/windmill>`_ ospitato da Nethesis su ``sos.nethesis.it``. Il firewall deve poter connettersi all'host sopra indicato sulla porta ``1194`` UDP. Se la porta ``1194`` è chiusa, il sistema tenterà di utilizzare come alternativa la porta ``443`` TCP.

source: The remote support must be started and stopped by the firewall administrator. To start a session:
it: Il supporto remoto deve essere avviato e interrotto dall'amministratore del firewall. Per avviare una sessione:

source: access the ``Subscription`` page and go to the ``Remote support`` section
it: Accedere alla pagina ``Subscription`` e andare alla sezione ``Supporto remoto``

source: click the :guilabel:`Start session` button
it: fare clic sul pulsante :guilabel:`Avvia sessione`

source: copy the ``Session ID`` and share it with the support team
it: Copiare ``ID sessione`` e condividerlo con il team di supporto.

source: To terminate the session, click the :guilabel:`End session` button.
it: Per terminare la sessione, fare clic sul pulsante :guilabel:`Termina sessione`.
