Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/reset_recovery.po
Languages: it

source: NethSecurity provides multiple options to reset your firewall and restore its functionality:
it: NethSecurity offre diverse opzioni per reimpostare il firewall e ripristinarne la funzionalità:

source: :ref:`Factory reset <factory_reset-section>`: choosing this method erases all your installed packages and customized settings, reverting the firewall back to its original state as it was after NethSecurity installation.
it: :ref:`Ripristino delle impostazioni di fabbrica <factory_reset-section>`: scegliendo questo metodo vengono cancellati tutti i pacchetti installati e le impostazioni personalizzate, riportando il firewall allo stato originale come dopo l’installazione di NethSecurity.

source: :ref:`Failsafe mode <failsafe-section>`: this option is useful if you have lost control of your device, making it inaccessible due to a configuration error. Failsafe mode allows you to reboot the firewall into a basic operating state while retaining most of your packages and settings.
it: :ref:`Modalità failsafe <failsafe-section>`: questa opzione è utile se si è perso il controllo del dispositivo, rendendolo inaccessibile a causa di un errore di configurazione. La modalità failsafe consente di riavviare il firewall in uno stato operativo di base, mantenendo la maggior parte dei pacchetti e delle impostazioni.

source: :ref:`Recovery mode <recovery-section>`: if your firewall's firmware becomes corrupted, recovery mode comes to the rescue. It enables you to install new firmware and unbrick a faulty machine.
it: :ref:`Modalità di ripristino <recovery-section>`: se il firmware del firewall si danneggia, la modalità di ripristino viene in soccorso. Consente di installare un nuovo firmware e di ripristinare una macchina non funzionante.

source: In NethSecurity, a factory reset refers to the process of reverting the firewall device back to its original settings and configuration as it was when it was first installed. This procedure erases all the customized settings, configurations, installed packages, and user data on the device, effectively restoring it to a pristine state.
it: In NethSecurity, un ripristino alle impostazioni di fabbrica si riferisce al processo di riportare il dispositivo firewall alle impostazioni e configurazioni originali, come quando è stato installato per la prima volta. Questa procedura cancella tutte le impostazioni personalizzate, le configurazioni, i pacchetti installati e i dati utente presenti sul dispositivo, riportandolo di fatto a uno stato iniziale.

source: This procedure relies on the completion of the boot process. If the factory reset doesn't work, consider using failsafe mode instead.
it: Questa procedura si basa sul completamento del processo di boot. Se il ripristino delle impostazioni di fabbrica non funziona, si consiglia di utilizzare la modalità failsafe.

source: To start fresh without reinstalling the firmware, access the ``Factory reset`` page under the ``System`` section. Click the :guilabel:`Perform factory reset` button to reset the firewall to its original state. The factory reset process will take a few seconds to complete. Once the process is complete, the firewall will reboot automatically.
it: Per iniziare da zero senza reinstallare il firmware, accedere alla pagina ``Factory reset`` nella sezione ``Sistema``. Fare clic sul pulsante :guilabel:`Esegui factory reset` per ripristinare il firewall allo stato originale. Il processo di factory reset richiederà alcuni secondi per essere completato. Una volta terminato il processo, il firewall si riavvierà automaticamente.

source: The factory reset restores the currently installed version. For instance, if the firewall was initially installed with version 23.05.0 and then updated to 23.05.1, after the factory reset, you will have a clean installation of version 23.05.1.
it: Il ripristino alle impostazioni di fabbrica reinstalla la versione attualmente installata. Ad esempio, se il firewall è stato inizialmente installato con la versione 23.05.0 e poi aggiornato alla 23.05.1, dopo il ripristino alle impostazioni di fabbrica si avrà un'installazione pulita della versione 23.05.1.

source: If the storage on which NethSecurity is running has been configured with a partition to save logs, the 'Factory reset' done from the Web UI will also remove the log partition and all its data.
it: Se lo storage su cui è in esecuzione NethSecurity è stato configurato con una partizione per salvare i log, il comando ``Factory reset`` eseguito dall'interfaccia Web rimuoverà anche la partizione dei log e tutti i suoi dati.

source: If NethSecurity was installed through an in-place migration from NethServer 7, the factory reset will not restore the default configuration. Instead, the system will restart with all configurations migrated from NethServer 7.
it: Se NethSecurity è stato installato tramite una migrazione in-place da NethServer 7, il ripristino alle impostazioni di fabbrica non ripristinerà la configurazione predefinita. Invece, il sistema verrà riavviato con tutte le configurazioni migrate da NethServer 7.

source: If you prefer a clean start, you can proceed with a new :ref:`installation <install-section>` rather than using the factory reset.
it: Se si preferisce un nuovo inizio, è possibile procedere con una nuova :ref:`installazione <install-section>` invece di utilizzare il ripristino delle impostazioni di fabbrica.

source: Alternatively, you can follow these steps:
it: In alternativa, è possibile seguire questi passaggi:

source: Update your NethSecurity with a newer image (if present) or using a standard image downloaded from :ref:`downloading <download-section>`.This will rewrite the ROM of your NethSecurity with a standard one, removing any migration files.
it: Aggiornare NethSecurity con una nuova immagine (se presente) oppure utilizzando un'immagine standard scaricata da :ref:`downloading <download-section>`. Questa operazione sovrascriverà la ROM di NethSecurity con una versione standard, rimuovendo eventuali file di migrazione.

source: Now you can perform the Factory Reset, which will lead you to a clean start.
it: Ora è possibile eseguire il ripristino alle impostazioni di fabbrica, che porterà a una nuova partenza pulita.

source: If you want to execute the factory reset from command line, just execute the following command. ::
it: Se si desidera eseguire il ripristino alle impostazioni di fabbrica da riga di comando, è sufficiente eseguire il seguente comando. ::

source: Failsafe mode
it: Modalità failsafe

source: NethSecurity provides a failsafe mode that can override the current configuration of your device. If your device becomes inaccessible due to a configuration error, failsafe mode comes to your rescue. When you boot into failsafe mode, the device initializes in a basic operating state, using a set of predefined defaults, allowing you to address the issue manually.
it: NethSecurity fornisce una modalità failsafe che può sovrascrivere la configurazione corrente del dispositivo. Se il dispositivo diventa inaccessibile a causa di un errore di configurazione, la modalità failsafe interviene in soccorso. Quando si avvia il dispositivo in modalità failsafe, esso si inizializza in uno stato operativo di base, utilizzando un insieme di valori predefiniti, permettendo di risolvere manualmente il problema.

source: However, it's important to note that failsafe mode cannot resolve more complex issues such as faulty hardware or a damaged kernel. While it resembles a reset, failsafe mode enables you to access your device and restore settings if necessary, whereas a reset would simply erase all configurations.
it: Tuttavia, è importante notare che la modalità failsafe non può risolvere problemi più complessi come hardware difettoso o un kernel danneggiato. Sebbene assomigli a un ripristino, la modalità failsafe consente di accedere al dispositivo e ripristinare le impostazioni se necessario, mentre un ripristino cancellerebbe semplicemente tutte le configurazioni.

source: The simplest way to activate failsafe mode is to connect directly to the firewall using a VGA/HDMI monitor or a serial cable. To do this, boot the machine, wait for the Grub boot menu to appear, and select ``NethSecurity (failsafe)``.
it: Il modo più semplice per attivare la modalità failsafe è collegarsi direttamente al firewall utilizzando un monitor VGA/HDMI o un cavo seriale. Per farlo, avviare la macchina, attendere che appaia il menu di avvio Grub e selezionare ``NethSecurity (failsafe)``.

source: You can access the firewall directly through the serial port using a null-modem cable and a common terminal program. For Windows, you can use ``PuTTY`` version 0.60 or higher. For Linux, options include ``minicom`` and ``picocom``. Set the baud rate to 115200, data bits to 8, parity to None, and stop bits to 1 (abbreviated as 8N1).
it: È possibile accedere direttamente al firewall tramite la porta seriale utilizzando un cavo null-modem e un comune programma terminale. Per Windows, è possibile utilizzare ``PuTTY`` versione 0.60 o superiore. Per Linux, le opzioni includono ``minicom`` e ``picocom``. Impostare la velocità di trasmissione (baud rate) a 115200, i bit di dati a 8, la parità su Nessuna e i bit di stop a 1 (abbreviato come 8N1).

source: After entering failsafe mode, the firewall will start with a network address of 192.168.1.1/24, usually on the eth0 network interface, and only essential services will be operational. It's important to note that the DHCP server will be inactive in failsafe mode. Follow the instructions displayed on the screen to mount the root filesystem and access other utilities as needed.
it: Dopo l'accesso alla modalità failsafe, il firewall si avvierà con l'indirizzo di rete 192.168.1.1/24, solitamente sull'interfaccia di rete eth0, e saranno operativi solo i servizi essenziali. È importante notare che il server DHCP sarà inattivo in modalità failsafe. Seguire le istruzioni visualizzate sullo schermo per montare il filesystem root e accedere ad altre utilità secondo necessità.

source: If you want to execute the factory reset in failsafe mode, just execute the following commands. ::
it: Se si desidera eseguire il ripristino alle impostazioni di fabbrica in modalità failsafe, è sufficiente eseguire i seguenti comandi. ::

source: This commands will not delete the log partition from disk if it exists. If you need to delete the old partition please refer to the :ref:`storage-section` for more details.
it: Questo comando non eliminerà la partizione di log dal disco se esiste. Se è necessario eliminare la vecchia partizione, fare riferimento alla :ref:`storage-section` per maggiori dettagli.

source: Emergency recovery
it: Recupero di emergenza

source: Emergency recovery in NethSecurity, also known as unbricking, is a feature enabling users to restore their firewall device in cases of severe malfunctions. Unbricking ensures that even the most critical issues can be resolved, restoring the device to full functionality, unless there are hardware failures.
it: Il ripristino d'emergenza in NethSecurity, noto anche come unbricking, è una funzionalità che consente di ripristinare il dispositivo firewall in caso di malfunzionamenti gravi. L'unbricking garantisce che anche i problemi più critici possano essere risolti, riportando il dispositivo alla piena funzionalità, salvo guasti hardware.

source: If you still have access to the system, you can use the following commands to download and write the image: ::
it: Se si ha ancora accesso al sistema, è possibile utilizzare i seguenti comandi per scaricare e scrivere l'immagine: ::

source: This command will display the path of the downloaded image. Use this path in the following command: ::
it: Questo comando visualizzerà il percorso dell'immagine scaricata. Utilizzare questo percorso nel comando seguente: ::

source: If you can't access the system, :ref:`download the latest image <download-section>`, then follow :ref:`installation instructions <install_bare_metal-section>` to write the image directly into the storage media.
it: Se non è possibile accedere al sistema, :ref:`scaricare l'immagine più recente <download-section>`, quindi seguire le :ref:`istruzioni di installazione <install_bare_metal-section>` per scrivere direttamente l'immagine sul supporto di memorizzazione.
