Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/reverse_proxy.po
Languages: it

source: Certificates and reverse proxy
it: Certificati e reverse proxy

source: NethSecurity provides a reverse proxy using `nginx <https://nginx.org>`_. A reverse proxy, sometimes called also proxy pass, is a server that sits in front of one or more web servers and forwards requests to them. It can be used to improve performance, security, and reliability.
it: NethSecurity fornisce un reverse proxy utilizzando `nginx <https://nginx.org>`_. Un reverse proxy, talvolta chiamato anche proxy pass, è un server che si trova davanti a uno o più web server e inoltra le richieste verso di essi. Può essere utilizzato per migliorare le prestazioni, la sicurezza e l'affidabilità.

source: In simpler terms, a reverse proxy is like a traffic cop for web servers. It directs incoming requests to the appropriate server and sends back the responses.
it: In termini più semplici, un reverse proxy è come un vigile del traffico per i server web. Instrada le richieste in arrivo al server appropriato e restituisce le risposte.

source: Reverse proxies are often used to improve performance by caching static content and distributing traffic across multiple servers. They can also be used to increase security by implementing the TLS endpoint.
it: I reverse proxy sono spesso utilizzati per migliorare le prestazioni memorizzando nella cache i contenuti statici e distribuendo il traffico su più server. Possono anche essere utilizzati per aumentare la sicurezza implementando l'endpoint TLS.

source: The reverse proxy is only available on port 443 (HTTPS) and *not* on port 80 (HTTP).
it: Il reverse proxy è disponibile solo sulla porta 443 (HTTPS) e *non* sulla porta 80 (HTTP).

source: This page allows users to configure proxy pass settings, specifying whether the rule applies to a domain or a path. For domain configurations, users can select a certificate. The destination URL determines where incoming requests are forwarded, and the allowed network field provides the option to restrict access to specific CIDR-formatted networks. A description can be added for clarity.
it: Questa pagina consente di configurare le impostazioni di proxy pass, specificando se la regola si applica a un dominio o a un percorso. Per le configurazioni di dominio, è possibile selezionare un certificato. L'URL di destinazione determina dove vengono inoltrate le richieste in ingresso e il campo rete consentita offre la possibilità di limitare l'accesso a specifiche reti in formato CIDR. È possibile aggiungere una descrizione per maggiore chiarezza.

source: To configure a new proxy pass, click on the :guilabel:`Add reverse proxy` and customize the following options:
it: Per configurare un nuovo proxy pass, fare clic su :guilabel:`Aggiungi reverse proxy` e personalizzare le seguenti opzioni:

source: ``Type``: choose between Domain or Path. If type is ``Path``, enter the resource path starting with a '/' for matching rules (e.g., ``/resource-path``). If type is ``Domain``, enter the fully qualified domain name for website matching rules. Select also an associated :ref:`certificate <certificates-section>`.
it: ``Tipo``: scegliere tra Dominio o Percorso. Se il tipo è ``Percorso``, inserire il percorso della risorsa iniziando con una '/' per le regole di corrispondenza (ad esempio, ``/resource-path``). Se il tipo è ``Dominio``, inserire il nome di dominio completo per le regole di corrispondenza del sito web. Selezionare anche un :ref:`certificato <certificates-section>` associato.

source: ``Destination URL``: specify the forwarding location for incoming requests (e.g., ``http://destination-server:port/path``).
it: ``URL di destinazione``: specificare la posizione di inoltro per le richieste in arrivo (ad esempio, ``http://destination-server:port/path``).

source: ``Allowed networks``: define allowed IPv4/IPv6 networks in CIDR format. By default, accessible from anywhere.
it: ``Reti permesse``: definire le reti IPv4/IPv6 consentite in formato CIDR. Per impostazione predefinita, accessibile da qualsiasi luogo.

source: ``Description``: optionally, add a description for clarity.
it: ``Descrizione``: facoltativamente, aggiungere una descrizione per maggiore chiarezza.

source: Additional information:
it: Informazioni aggiuntive:

source: Headers sent to destination server: X-Forwarded-Proto, X-Forwarded-For, X-Real-IP are always sent.
it: Header verso il server di destinazione: X-Forwarded-Proto, X-Forwarded-For, X-Real-IP sono sempre inviati.

source: Certificate validation: if the destination uses HTTPS, the certificate is not validated to avoid errors on misconfigured servers.
it: Validazione del certificato: se la destinazione utilizza HTTPS, il certificato non viene validato per evitare errori su server configurati in modo errato.

source: WebSocket support: all reverse proxies automatically support WebSockets.
it: Supporto WebSocket: tutti i reverse proxy supportano automaticamente i WebSocket.

source: Certificates
it: Certificati

source: The ``Certificates`` page centralizes certificate management functionalities, facilitating the handling of certificates on the firewall. At the firewall's initial startup, a self-signed certificate is automatically generated. This certificate serves as a default secure option.
it: La pagina ``Certificati`` centralizza le funzionalità di gestione dei certificati, facilitando la gestione dei certificati sul firewall. Al primo avvio del firewall, viene generato automaticamente un certificato autofirmato. Questo certificato funge da opzione sicura predefinita.

source: The certificate management page allows users to upload custom certificates, request certificates from Let's Encrypt, and manage existing certificates.
it: La pagina di gestione dei certificati consente di caricare certificati personalizzati, richiedere certificati da Let's Encrypt e gestire i certificati esistenti.

source: The page lists all certificates, highlighting the default certificate. To set a certificate as the default certificate, click on the :guilabel:`Set as default` button. The default certificate is the one automatically served when accessing the :ref:`web user interface <web_user_interface-section>`, both on port 443, :ref:`9090 or custom port <change_ui_port-section>`.
it: La pagina elenca tutti i certificati, evidenziando il certificato predefinito. Per impostare un certificato come certificato predefinito, fare clic sul pulsante :guilabel:`Imposta come predefinito`. Il certificato predefinito è quello servito automaticamente quando si accede all':ref:`interfaccia web utente <web_user_interface-section>`, sia sulla porta 443, sia sulla :ref:`9090 o su una porta personalizzata <change_ui_port-section>`.

source: Let's Encrypt is a free, automated, and open Certificate Authority (CA) that provides SSL/TLS certificates for securing websites. These certificates ensure encrypted communication between web servers and users' browsers, enhancing security and privacy on the internet. Unlike traditional CAs, Let's Encrypt offers SSL certificates through an automated system, making it accessible to website owners and administrators without significant costs or technical expertise.
it: Let's Encrypt è una Certificate Authority (CA) gratuita, automatizzata e aperta che fornisce certificati SSL/TLS per la protezione dei siti web. Questi certificati garantiscono una comunicazione crittografata tra i server web e i browser degli utenti, migliorando la sicurezza e la privacy su Internet. A differenza delle CA tradizionali, Let's Encrypt offre certificati SSL tramite un sistema automatizzato, rendendoli accessibili ai proprietari e agli amministratori di siti web senza costi significativi o particolari competenze tecniche.

source: The certificate page allows users to request certificates from Let's Encrypt. The process is straightforward and requires minimal configuration. Users can specify a meaningful name for the certificate and one or more domains. The certificate is automatically renewed every 60 days.
it: La pagina del certificato consente di richiedere certificati da Let's Encrypt. Il processo è semplice e richiede una configurazione minima. È possibile specificare un nome significativo per il certificato e uno o più domini. Il certificato viene rinnovato automaticamente ogni 60 giorni.

source: The Let's Encrypt certificate request process involves the following steps:
it: Il processo di richiesta del certificato Let's Encrypt prevede i seguenti passaggi:

source: click on the :guilabel:`Add Let's Encrypt certificate` button;
it: fare clic sul pulsante :guilabel:`Aggiungi certificato Let's Encrypt`;

source: specify a meaningful name for the certificate;
it: specificare un nome significativo per il certificato;

source: specify one or more domains for the certificate;
it: specificare uno o più domini per il certificato;

source: click on the :guilabel:`Save` button.
it: fare clic sul pulsante :guilabel:`Salva`.

source: The validation process can be performed in two ways:
it: Il processo di validazione può essere eseguito in due modi:

source: Standalone mode (HTTP validation): the Standalone mode involves temporarily stopping the web server to allow the ACME client tool to bind to the required ports directly. It serves the authentication challenges to prove domain ownership, obtaining and installing the certificate.
it: Modalità standalone (validazione HTTP): la modalità standalone prevede l'arresto temporaneo del server web per consentire allo strumento client ACME di collegarsi direttamente alle porte richieste. Serve le challenge di autenticazione per dimostrare la proprietà del dominio, ottenendo e installando il certificato.

source: DNS validation: DNS validation requires adding a specific DNS TXT record to the domain's DNS configuration. ACME client checks for this record to verify domain ownership. This method is useful in situations where modifying web server configurations is challenging or not desired.
it: Validazione DNS: la validazione DNS richiede l'aggiunta di uno specifico record DNS TXT alla configurazione DNS del dominio. Il client ACME verifica la presenza di questo record per confermare la proprietà del dominio. Questo metodo è utile in situazioni in cui modificare la configurazione del server web risulta difficile o non è desiderato.

source: When standalone mode is selected, make sure the following requirements are met:
it: Quando viene selezionata la modalità standalone, assicurarsi che siano soddisfatti i seguenti requisiti:

source: The firewall must be reachable from outside on port 80. The acme client will:
it: Il firewall deve essere raggiungibile dall'esterno sulla porta 80. Il client acme:

source: temporarily bind to port 80 to serve the authentication challenges
it: associare temporaneamente alla porta 80 per servire le sfide di autenticazione

source: temporarily open port 80 to the public Internet to perform the validation.
it: apri temporaneamente la porta 80 verso Internet pubblico per eseguire la convalida.

source: Once the validation is complete, port 80 is automatically closed. Please note that if port 80 is forwarded to another server, the validation will fail.
it: Una volta completata la convalida, la porta 80 viene chiusa automaticamente. Si noti che, se la porta 80 è inoltrata a un altro server, la convalida non andrà a buon fine.

source: The domains that you want the certificate for must be public domain names associated to server own public IP. Make sure you have public DNS name pointing to your server (you can check with sites like `VDNS <http://viewdns.info/>`_).
it: I domini per cui si desidera il certificato devono essere nomi di dominio pubblici associati all'indirizzo IP pubblico del server. Assicurarsi di avere un nome DNS pubblico che punti al proprio server (è possibile verificare con siti come `VDNS <http://viewdns.info/>`_).

source: Select DNS validation if your DNS provider supports API access. Choose the DNS provider from the drop-down menu and enter the API key and secret. Follow the `acme.sh DNS providers documentation <https://github.com/acmesh-official/acme.sh/wiki/dnsapi>`_) to know which API key and secret are required for your DNS provider. The DNS validation is the only one supported for wildcard certificates.
it: Selezionare la convalida DNS se il proprio provider DNS supporta l'accesso tramite API. Scegliere il provider DNS dal menu a discesa e inserire la chiave API e il segreto. Consultare la `documentazione dei provider DNS di acme.sh <https://github.com/acmesh-official/acme.sh/wiki/dnsapi>`_ per sapere quale chiave API e quale segreto sono richiesti dal proprio provider DNS. La convalida DNS è l'unica supportata per i certificati wildcard.

source: The certificate generation process can take a few minutes. During this time, the certificate status is ``Pending``.
it: Il processo di generazione del certificato può richiedere alcuni minuti. Durante questo periodo, lo stato del certificato è ``In attesa``.

source: If the Let's Encrypt certificate request fails, the user can debug the process by entering the following commands in the terminal: ::
it: Se la richiesta del certificato Let's Encrypt fallisce, è possibile eseguire il debug del processo inserendo i seguenti comandi nel terminale: ::

source: The debug messages will be printed on the standard output. After the problem is solved, the user can disable debug by entering the following command in the terminal: ::
it: I messaggi di debug verranno stampati sull'output standard. Dopo che il problema è stato risolto, è possibile disabilitare il debug inserendo il seguente comando nel terminale: ::

source: Custom certificate
it: Certificato personalizzato

source: The user can upload a custom certificate to the firewall.
it: L'utente può caricare un certificato personalizzato nel firewall.

source: The process involves the following steps:
it: Il processo prevede i seguenti passaggi:

source: click on the :guilabel:`Import certificate` button
it: fare clic sul pulsante :guilabel:`Importa certificato`

source: specify a meaningful name for the certificate
it: specificare un nome significativo per il certificato

source: drag and drop the certificate, private key, and optionally, the chain certificate; ensure that all uploaded files adhere to the `PEM format <https://en.wikipedia.org/wiki/Privacy-Enhanced_Mail>`_ standards
it: trascinare e rilasciare il certificato, la chiave privata e, facoltativamente, il certificato della catena; assicurarsi che tutti i file caricati rispettino gli standard del formato `PEM <https://en.wikipedia.org/wiki/Privacy-Enhanced_Mail>`_

source: click on the :guilabel:`Save` button
it: fare clic sul pulsante :guilabel:`Salva`
