Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/setup_wizard.po
Languages: it

source: Setup wizard
it: Procedura guidata di configurazione

source: The first time the web user interface is accessed, a setup wizard is launched. This guided process can assist you in establishing a secure initial configuration for the firewall and ensures that the unit is ready for deployment in a production environment.
it: La prima volta che si accede all'interfaccia utente web, viene avviata una procedura guidata di configurazione. Questo processo guidato può assistere nella creazione di una configurazione iniziale sicura per il firewall e garantisce che l'unità sia pronta per essere distribuita in un ambiente di produzione.

source: For optimal security and to ensure a controlled configuration environment, it is strongly recommended that you complete the setup wizard before connecting the device to the internet.
it: Per una sicurezza ottimale e per garantire un ambiente di configurazione controllato, si raccomanda vivamente di completare la procedura guidata di configurazione prima di collegare il dispositivo a Internet.

source: Welcome to the setup wizard
it: Benvenuti nella procedura guidata di configurazione

source: On the first page of the setup wizard, you can click :guilabel:`Start setup` to initiate the guided setup process. Alternatively, you can click :guilabel:`Skip wizard` to bypass the wizard and access the web user interface directly. However, it is highly recommended to complete the setup wizard to ensure a secure and functional configuration.
it: Nella prima pagina della procedura guidata di configurazione, è possibile fare clic su :guilabel:`Inizia il setup` per avviare il processo di configurazione guidata. In alternativa, è possibile fare clic su :guilabel:`Salta procedura guidata` per saltare la procedura guidata e accedere direttamente all'interfaccia web utente. Tuttavia, è fortemente consigliato completare la procedura guidata di configurazione per garantire una configurazione sicura e funzionale.

source: Step 1: Change root password
it: Passaggio 1: Cambiare la password di root

source: You are required to define a new, secure password for the root account. This measure significantly reduces the risk of compromise by eliminating reliance on publicly known default credentials.
it: È necessario definire una nuova password sicura per l'account root. Questa misura riduce significativamente il rischio di compromissione eliminando la dipendenza da credenziali predefinite pubblicamente note.

source: The updated root password will be applied immediately upon confirmation.
it: La password di root aggiornata verrà applicata immediatamente al momento della conferma.

source: Ensure the new credentials are securely stored (e.g., by using a password manager) before proceeding to the next configuration step.
it: Assicurarsi che le nuove credenziali siano archiviate in modo sicuro (ad esempio, utilizzando un password manager) prima di procedere con il passaggio successivo della configurazione.

source: If you restart the setup wizard after changing root password (e.g., by closing and reopening the browser tab), you will need to use the new password to access the web interface.
it: Se si riavvia la procedura guidata di configurazione dopo aver cambiato la password di root (ad esempio, chiudendo e riaprendo la scheda del browser), sarà necessario utilizzare la nuova password per accedere all'interfaccia web.

source: Step 2: SSH Access
it: Passaggio 2: Accesso SSH

source: You can customize SSH access to suit your security and operational requirements.
it: È possibile personalizzare l'accesso SSH per soddisfare i requisiti di sicurezza e operativi.

source: Default access configuration
it: Configurazione di accesso predefinita

source: LAN Access is enabled by default to allow administrative access from within the trusted local network.
it: L'accesso LAN è abilitato per impostazione predefinita per consentire l'accesso amministrativo dall'interno della rete locale attendibile.

source: WAN Access is disabled by default to prevent exposure to external threats from untrusted networks.
it: L'accesso WAN è disabilitato per impostazione predefinita per prevenire l'esposizione a minacce esterne provenienti da reti non affidabili.

source: Settings
it: Impostazioni

source: **TCP port**: the listening port for SSH can be changed if needed. The default value is 22.
it: **Porta TCP**: la porta di ascolto per SSH può essere modificata se necessario. Il valore predefinito è 22.

source: **Root login with password**: it is advised to disable password-based root login for SSH. Disabling this option significantly reduces the risk of unauthorized access by limiting the potential for brute-force password attacks.
it: **Accesso root con password**: si consiglia di disabilitare l'accesso root tramite password per SSH. Disabilitare questa opzione riduce significativamente il rischio di accessi non autorizzati, limitando la possibilità di attacchi brute-force alle password.

source: If password-based login for the root user is disabled, it is essential to upload the root user's SSH public key to the device to ensure continued remote access.
it: Se l'accesso tramite password per l'utente root è disabilitato, è essenziale caricare la chiave pubblica SSH dell'utente root sul dispositivo per garantire il continuo accesso remoto.

source: Step 3: Web interface access on TCP port 9090
it: Passaggio 3: Accesso all'interfaccia web sulla porta TCP 9090

source: Configure access parameters for the web user interface, which operates on port 9090.
it: Configurare i parametri di accesso per l'interfaccia utente web, che opera sulla porta 9090.

source: Default configuration
it: Configurazione predefinita

source: By default, web interface access is enabled from the LAN, allowing administrative management from within the trusted local network.
it: Per impostazione predefinita, l'accesso all'interfaccia web è abilitato dalla LAN, consentendo la gestione amministrativa dall'interno della rete locale attendibile.

source: You can choose from the following access options for WAN connectivity:
it: È possibile scegliere tra le seguenti opzioni di accesso per la connettività WAN:

source: **Disabled** (recommended): this option disables web interface access from the WAN, preventing exposure to external threats.
it: **Disabilitato** (consigliato): questa opzione disabilita l'accesso all'interfaccia web dalla WAN, prevenendo l'esposizione a minacce esterne.

source: **Enabled**: full access to the web interface is permitted from any WAN source. This mode should only be used in secure environments or when necessary for remote management, and must be protected with strong credentials
it: **Abilitato**: l'accesso completo all'interfaccia web è consentito da qualsiasi sorgente WAN. Questa modalità dovrebbe essere utilizzata solo in ambienti sicuri o quando necessario per la gestione remota, e deve essere protetta con credenziali robuste.

source: **Limited**: web interface access from WAN is restricted to specified IP addresses or networks. You have to define one or more of the following:
it: **Limitato**: l'accesso all'interfaccia web dalla WAN è limitato agli indirizzi IP o alle reti specificate. È necessario definire uno o più dei seguenti:

source: IP address
it: Indirizzo IP

source: CIDR-formatted networks (e.g., 192.168.1.0/24)
it: Reti in formato CIDR (ad es., 192.168.1.0/24)

source: IP address ranges (e.g., 203.0.113.10-203.0.113.20)
it: Intervalli di indirizzi IP (ad es., 203.0.113.10-203.0.113.20)

source: If you choose the **Limited** option, the IP addresses you configured will appear at the end of the wizard under **Firewall > Rules > Input rules**.
it: Se si sceglie l'opzione **Limitato**, gli indirizzi IP configurati appariranno alla fine della procedura guidata sotto **Firewall > Regole > Regole di input**.

source: Step 4: Web interface and WAN access on TCP port 443
it: Passaggio 4: Interfaccia web e accesso WAN sulla porta TCP 443

source: Set up access controls for the web interface and WAN connections on port 443.
it: Impostare i controlli di accesso per l'interfaccia web e le connessioni WAN sulla porta 443.

source: **Web interface service on TCP port 443**: by default, the web user interface is available on TCP port 9090. Enabling this option also makes it accessible on TCP port 443. It is recommended to keep this additional access disabled and always use TCP port 9090 to access the web UI.
it: **Servizio dell'interfaccia web sulla porta TCP 443**: per impostazione predefinita, l'interfaccia utente web è disponibile sulla porta TCP 9090. Abilitando questa opzione, l'interfaccia sarà accessibile anche sulla porta TCP 443. Si consiglia di mantenere disabilitato questo accesso aggiuntivo e di utilizzare sempre la porta TCP 9090 per accedere all'interfaccia web.

source: **WAN access on TCP port 443**: this option controls if WAN access on port 443 is disabled (recommended) or enabled. Beware, by leaving this option disabled, reverse proxies will not function.
it: **Accesso WAN sulla porta TCP 443**: questa opzione controlla se l'accesso WAN sulla porta 443 è disabilitato (consigliato) o abilitato. Attenzione, lasciando questa opzione disabilitata, i reverse proxy non funzioneranno.

source: Step 5: Summary
it: Passaggio 5: Riepilogo

source: The summary page provides an opportunity to review the unit configuration before applying changes.
it: La pagina di riepilogo offre l'opportunità di rivedere la configurazione dell'unità prima di applicare le modifiche.

source: WAN access to the web interface may be restricted by your current settings. Applying the changes while connected via port 443 could result in loss of access. Verify your configuration meets your remote access needs, particularly when using reverse proxies.
it: L'accesso WAN all'interfaccia web potrebbe essere limitato dalle impostazioni correnti. L'applicazione delle modifiche mentre si è connessi tramite la porta 443 potrebbe comportare la perdita dell'accesso. Verificare che la configurazione soddisfi le esigenze di accesso remoto, in particolare quando si utilizzano reverse proxy.

source: Use the 'Previous' button to go back and make adjustments if needed. Click 'Finish setup' to apply the changes and complete the setup wizard.
it: Utilizzare il pulsante ``Precedente`` per tornare indietro ed effettuare eventuali modifiche se necessario. Fare clic su ``Fine configurazione`` per applicare le modifiche e completare la procedura guidata di configurazione.
