Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/snmp.po
Languages: it

source: SNMP Server
it: Server SNMP

source: Simple Network Management Protocol (SNMP) provides a standardized way to monitor and manage network devices like your firewall remotely. It allows authorized users to retrieve essential information like device status, performance metrics, and configuration settings.
it: Il Simple Network Management Protocol (SNMP) fornisce un metodo standardizzato per monitorare e gestire dispositivi di rete come il firewall da remoto. Consente agli utenti autorizzati di recuperare informazioni essenziali come lo stato del dispositivo, metriche sulle prestazioni e impostazioni di configurazione.

source: The SNMP server is **disabled by default** on your firewall, allowing access from within your local area network (LAN) on all IPv4 and IPv6 addresses.
it: Il server SNMP è **disabilitato per impostazione predefinita** sul firewall, consentendo l'accesso dalla rete locale (LAN) su tutti gli indirizzi IPv4 e IPv6.

source: If the system has been updated from v1.4.1 or earlier, the SNMP server will be **enabled by default**. To disable it, follow the steps in the :ref:`Disabling the SNMP Server <snmp-server-disabling>` section.
it: Se il sistema è stato aggiornato dalla versione v1.4.1 o precedente, il server SNMP sarà **abilitato per impostazione predefinita**. Per disabilitarlo, seguire i passaggi nella sezione :ref:`Disabilitazione del server SNMP <snmp-server-disabling>`.

source: Configuring the SNMP Server
it: Configurazione del server SNMP

source: It's crucial to configure essential information that identifies your device. Here's how to do it through the command line:
it: È fondamentale configurare le informazioni essenziali che identificano il dispositivo. Ecco come farlo tramite la riga di comando:

source: Open a terminal window on your firewall.
it: Aprire una finestra del terminale sul firewall.

source: Use the following commands to set the desired values for `sysLocation`, `sysContact`, and `sysName`:
it: Utilizzare i seguenti comandi per impostare i valori desiderati per ``sysLocation``, ``sysContact`` e ``sysName``:

source: Replace `<string>` with the relevant information. For example:
it: Sostituire `<string>` con le informazioni pertinenti. Ad esempio:

source: After making changes, apply them using:
it: Dopo aver apportato le modifiche, applicarle utilizzando:

source: The SNMP server configuration is stored in the `/etc/config/snmpd` file.
it: La configurazione del server SNMP è memorizzata nel file `/etc/config/snmpd`.

source: You can test the configuration by using an SNMP client like `snmpwalk` or `snmpget` from a remote machine. For example: ::
it: È possibile testare la configurazione utilizzando un client SNMP come ``snmpwalk`` o ``snmpget`` da una macchina remota. Ad esempio: ::

source: Disabling the SNMP Server
it: Disabilitazione del server SNMP

source: If you don't require remote access to the SNMP server, you can disable it for additional security. Follow these steps:
it: Se non è necessario l'accesso remoto al server SNMP, è possibile disabilitarlo per una maggiore sicurezza. Seguire questi passaggi:

source: Use the following commands to disable the server:
it: Utilizzare i seguenti comandi per disabilitare il server:

source: **Remember:** Disabling the SNMP server might impact monitoring tools or applications relying on it.
it: **Nota:** La disattivazione del server SNMP potrebbe influire sugli strumenti di monitoraggio o sulle applicazioni che ne fanno affidamento.

source: Enabling remote access
it: Abilitazione dell'accesso remoto

source: If you need to access the SNMP server from outside your LAN, create a firewall rule that allows incoming UDP traffic on port ``161`` to the firewall itself. Remember, opening this port increases risk, so proceed with caution and make sure to restict the access only from selected IP addresses.
it: Se è necessario accedere al server SNMP dall'esterno della propria LAN, creare una regola firewall che consenta il traffico UDP in ingresso sulla porta ``161`` verso il firewall stesso. Ricordare che l'apertura di questa porta aumenta il rischio, quindi procedere con cautela e assicurarsi di limitare l'accesso solo da indirizzi IP selezionati.

source: Security considerations
it: Considerazioni sulla sicurezza

source: Prioritize security before enabling remote access:
it: Dare priorità alla sicurezza prima di abilitare l'accesso remoto:

source: **Strong Community String:** Replace the default "public" community string with a complex and unique one.
it: **Stringa di community robusta:** Sostituire la stringa di community predefinita "public" con una complessa e unica.

source: **Access Control:** Implement Access Control Lists (ACLs) to restrict access to authorized IP addresses only.
it: **Controllo accessi:** Implementare le Access Control List (ACL) per limitare l'accesso esclusivamente agli indirizzi IP autorizzati.
