Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/speedtest.po
Languages: it

source: The Speedtest tool is a widely used application for measuring the speed and performance of an internet connection. It provides users with detailed information about their download and upload speeds, as well as their ping and jitter. This tool is essential for diagnosing network issues, verifying service provider claims, and ensuring optimal performance for various online activities.
it: Lo strumento Speedtest è un'applicazione ampiamente utilizzata per misurare la velocità e le prestazioni di una connessione Internet. Fornisce informazioni dettagliate sulle velocità di download e upload, oltre che su ping e jitter. Questo strumento è essenziale per diagnosticare problemi di rete, verificare le affermazioni dei fornitori di servizi e garantire prestazioni ottimali per varie attività online.

source: In NethSecurity the Speedtest tool is available as a built-in feature accessible only from the command line.
it: In NethSecurity lo strumento Speedtest è disponibile come funzionalità integrata accessibile solo dalla riga di comando.

source: Usage
it: Utilizzo

source: Since the test can be influenced by QoS settings, it is better to disable it before running the test: ::
it: Poiché il test può essere influenzato dalle impostazioni QoS, è preferibile disabilitarle prima di eseguire il test: ::

source: Speedtest automatically selects the best server based on the user's location. To run a speed test, simply type the following command in the terminal: ::
it: Speedtest seleziona automaticamente il server migliore in base alla posizione dell'utente. Per eseguire un test di velocità, è sufficiente digitare il seguente comando nel terminale: ::

source: This command will perform a full test, including latency, download, and upload speed tests. The selection of the server is based on the user's location and the server's availability. Sometimes, the server selection may not be optimal, resulting in inaccurate speed test results.
it: Questo comando eseguirà un test completo, includendo test di latenza, velocità di download e upload. La selezione del server si basa sulla posizione dell'utente e sulla disponibilità del server. A volte, la selezione del server potrebbe non essere ottimale, con conseguenti risultati inaccurati del test di velocità.

source: To overcome this issue, users can force the selection of the server by using the ``--force-by-latency-test`` option: ::
it: Per superare questo problema, è possibile forzare la selezione del server utilizzando l'opzione ``--force-by-latency-test``: ::

source: Remember to re-enable QoS after running the test: ::
it: Ricordarsi di riabilitare QoS dopo aver eseguito il test: ::

source: The speedtest tool randomly selects a server to perform the test. In a MultiWAN environment, the server selection can be influenced by the WAN interface used to reach the server.
it: Lo strumento speedtest seleziona casualmente un server per eseguire il test. In un ambiente MultiWAN, la selezione del server può essere influenzata dall'interfaccia WAN utilizzata per raggiungere il server.

source: It is possible to force the selection of the WAN interface using mwan3 wrapper.
it: È possibile forzare la selezione dell'interfaccia WAN utilizzando il wrapper mwan3.

source: Given a WAN device named ``wan1``, the following command will run the speedtest using the selected interface: ::
it: Dato un dispositivo WAN chiamato ``wan1``, il seguente comando eseguirà lo speedtest utilizzando l'interfaccia selezionata: ::
