Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/storage.po
Languages: it

source: In certain instances, you may encounter challenges utilizing the primary disk for log storage, as the user interface may not present any options. In such cases, the issue typically stems from a pre-existing partition on the disk, which must be removed beforehand to ensure proper utilization by the system.
it: In alcune circostanze, potrebbero verificarsi difficoltà nell'utilizzo del disco principale per l'archiviazione dei log, poiché l'interfaccia utente potrebbe non presentare alcuna opzione. In questi casi, il problema deriva solitamente dalla presenza di una partizione preesistente sul disco, che deve essere rimossa preventivamente per garantirne il corretto utilizzo da parte del sistema.

source: This typically occurs even after performing a default reset using failsafe mode (which does not remove the log partition), in order to allow the system to use again the storage to save new logs you need to remove the old partition.
it: Questo si verifica tipicamente anche dopo aver eseguito un ripristino alle impostazioni predefinite utilizzando la modalità failsafe (che non rimuove la partizione dei log); per consentire al sistema di utilizzare nuovamente lo storage per salvare nuovi log è necessario rimuovere la vecchia partizione.

source: This can be easily done this way.
it: Questo può essere fatto facilmente in questo modo.

source: Verify if the log partition is present with the command:
it: Verificare se la partizione di log è presente con il comando:

source: Partition 3 is the one used for logs.
it: La partizione 3 è quella utilizzata per i log.

source: to remove partition 3 execute the command:
it: per rimuovere la partizione 3 eseguire il comando:

source: Now verify again the partition table with the command:
it: Ora verificare nuovamente la tabella delle partizioni con il comando:

source: Partition 3 should not be visible.
it: La partizione 3 non dovrebbe essere visibile.

source: Now the storage is ready to be configured for logs from the Web UI.
it: Ora lo storage è pronto per essere configurato per i log dall'interfaccia Web.

source: Troubleshooting
it: Risoluzione dei problemi

source: Starting from version 8.6, NethSecurity automatically saves system logs to a persistent storage partition on bare metal installations (*refer to the dedicated section below for virtual machines*).
it: A partire dalla versione 8.6, NethSecurity salva automaticamente i log di sistema su una partizione di storage persistente nelle installazioni bare metal (*fare riferimento alla sezione dedicata qui sotto per le macchine virtuali*).

source: This guarantees that logs remain available across reboots or unexpected shutdowns, even if the storage has not been manually configured. The default log retention period is 52 weeks.
it: Questo garantisce che i log rimangano disponibili anche dopo riavvii o arresti imprevisti, anche se lo storage non è stato configurato manualmente. Il periodo di conservazione dei log predefinito è di 52 settimane.

source: For **new installations** the system automatically creates a dedicated partition on the main disk to store logs.
it: Per **nuove installazioni** il sistema crea automaticamente una partizione dedicata sul disco principale per memorizzare i log.

source: For **upgrades**:
it: Per **gli aggiornamenti**:

source: if no storage had previously been configured, the system automatically sets it up using unallocated space on the primary disk
it: se non è stato precedentemente configurato alcun storage, il sistema lo imposta automaticamente utilizzando lo spazio non allocato sul disco principale

source: if storage was already configured, it remains unchanged
it: se lo storage era già stato configurato, rimane invariato

source: This behavior improves reliability and does not require manual intervention. However, users can still manage storage settings from the web interface.
it: Questo comportamento migliora l'affidabilità e non richiede interventi manuali. Tuttavia, è comunque possibile gestire le impostazioni di archiviazione dall'interfaccia web.

source: Persistent log storage can be disabled (not recommended), or moved to a different disk if needed. If disabled, the system will automatically reconfigure it during a future upgrade.
it: L'archiviazione persistente dei log può essere disabilitata (non raccomandato), oppure spostata su un disco diverso se necessario. Se disabilitata, il sistema la riconfigurerà automaticamente durante un futuro aggiornamento.

source: Manual configuration
it: Configurazione manuale

source: Manual configuration of additional storage is still available and works as follows:
it: La configurazione manuale dello storage aggiuntivo è ancora disponibile e funziona come segue:

source: If using an additional device, connect it to the system.
it: Se si utilizza un dispositivo aggiuntivo, collegarlo al sistema.

source: Access the ``Storage`` page under the ``System`` section in the right-hand menu.
it: Accedere alla pagina ``Storage`` nella sezione ``Sistema`` nel menu a destra.

source: Select the storage device where logs should be saved.
it: Selezionare il dispositivo di archiviazione su cui devono essere salvati i log.

source: Click on the button :guilabel:`Format and configure storage`.
it: Fare clic sul pulsante :guilabel:`Formatta e configura lo storage`.

source: If the selected device is the **primary disk**, the system will generate a new partition using any unallocated space.
it: Se il dispositivo selezionato è il **disco primario**, il sistema genererà una nuova partizione utilizzando qualsiasi spazio non allocato.

source: If an **additional disk** is selected, the system will erase all existing partitions and data and create a single new partition.
it: Se viene selezionato un **disco aggiuntivo**, il sistema cancellerà tutte le partizioni e i dati esistenti e creerà una nuova partizione singola.

source: The storage is then:
it: Lo storage è quindi:

source: Formatted with the ``ext4`` filesystem
it: Formattato con il filesystem ``ext4``

source: Mounted at ``/mnt/data``
it: Montato in ``/mnt/data``

source: Used by ``rsyslog`` to write logs to ``/mnt/data/log/messages``
it: Utilizzato da ``rsyslog`` per scrivere i log in ``/mnt/data/log/messages``

source: Rotated weekly by ``logrotate``
it: Ruotato settimanalmente da ``logrotate``

source: Synchronized daily (at night) for additional data like metrics
it: Sincronizzato quotidianamente (di notte) per dati aggiuntivi come le metriche

source: To remove persistent storage and return to in-memory logging, click on the button :guilabel:`Remove storage`.
it: Per rimuovere lo storage persistente e tornare al logging in memoria, fare clic sul pulsante :guilabel:`Rimuovi storage`.

source: Virtual Machines
it: Macchine Virtuali

source: When installing NethSecurity on a virtual machine, the recommended method is to generate the virtual disk from the official image. In this mode, logs are not stored persistently by default. To enable persistent log storage, you must attach a second virtual disk to the virtual machine. As an alternative, you can extend the virtual disk and use the free disk space to create a new partition like on a physical hardware.
it: Quando si installa NethSecurity su una macchina virtuale, il metodo raccomandato è generare il disco virtuale dall'immagine ufficiale. In questa modalità, i log non vengono memorizzati in modo persistente per impostazione predefinita. Per abilitare la memorizzazione persistente dei log, è necessario collegare un secondo disco virtuale alla macchina virtuale. In alternativa, è possibile estendere il disco virtuale e utilizzare lo spazio libero su disco per creare una nuova partizione come su un hardware fisico.

source: Behavior in versions prior to 8.6
it: Comportamento nelle versioni precedenti alla 8.6

source: In earlier versions of NethSecurity, logs were written by default to a **volatile in-memory directory**. To persist logs, storage had to be configured **manually**, either by using unallocated space on the system disk or by attaching a secondary disk.
it: Nelle versioni precedenti di NethSecurity, i log venivano scritti per impostazione predefinita in una **directory volatile in memoria**. Per rendere persistenti i log, era necessario configurare lo storage **manualmente**, utilizzando lo spazio non allocato sul disco di sistema oppure collegando un disco secondario.
