Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/subscription.po
Languages: it

source: Subscription
it: Abbonamento

source: `Nethesis <https://www.nethesis.it>`_ offers two types of subscription services for NethSecurity, which provides additional benefits and features:
it: `Nethesis <https://www.nethesis.it>`_ offre due tipi di servizi in abbonamento per NethSecurity, che forniscono vantaggi e funzionalità aggiuntive:

source: **Community subscription**: self-service registration mostly suited for IT consultant. For more info, see the `subscription plans <https://nethsecurity.org/subscription>`_ page.
it: **Abbonamento Community**: registrazione self-service principalmente adatta a consulenti IT. Per ulteriori informazioni, consultare la pagina `piani di abbonamento <https://nethsecurity.org/subscription>`_.

source: Community subscription portal is available at `my.nethserver.com <https://my.nethserver.com>`_
it: Il portale di sottoscrizione della community è disponibile su `my.nethserver.com <https://my.nethserver.com>`_

source: **Enterprise subscription**: service reserved to Nethesis resellers, please contact the `sales department <mailto:info@nethesis.it>`_.
it: **Abbonamento Enterprise**: servizio riservato ai rivenditori Nethesis, si prega di contattare il `reparto vendite <mailto:info@nethesis.it>`_.

source: Enterprise subscription portal is available at: `my.nethesis.it <https://my.nethesis.it>`_
it: Il portale di sottoscrizione Enterprise è disponibile all'indirizzo: `my.nethesis.it <https://my.nethesis.it>`_

source: Typical benefits of the subscription service include:
it: I vantaggi tipici del servizio in abbonamento includono:

source: **Monitoring portals**: subscribers can access monitoring portals to manage their subscription and receive :ref:`alerts <alert-section>` for registered servers.
it: **Portali di monitoraggio**: gli abbonati possono accedere ai portali di monitoraggio per gestire il proprio abbonamento e ricevere :ref:`avvisi <alert-section>` per i server registrati.

source: **Enhanced DPI signatures**: firewalls with a valid subscription have access to a much larger database of :ref:`DPI signatures <dpi_filter-section>` (more than 1820 in total instead of 415) that are regularly updated.
it: **Firme DPI avanzate**: i firewall con un abbonamento valido hanno accesso a un database molto più ampio di :ref:`firme DPI <dpi_filter-section>` (oltre 1820 in totale invece di 415) che viene aggiornato regolarmente.

source: **Enterprise Block lists**: Firewalls with a valid subscription can purchase high-quality IP and DNS blocklists. These lists are actively maintained, updated very frequently, and exhibit high effectiveness while generating a very low number of false positives, they can be used in :ref:`IP <threat_shield_ip-section>` and :ref:`DNS <threat_shield_dns-section>` block lists.
it: **Liste di blocco Enterprise**: I firewall con un abbonamento valido possono acquistare liste di blocco IP e DNS di alta qualità. Queste liste sono attivamente mantenute, aggiornate molto frequentemente e presentano un'elevata efficacia generando un numero molto basso di falsi positivi; possono essere utilizzate nelle :ref:`liste di blocco IP <threat_shield_ip-section>` e :ref:`DNS <threat_shield_dns-section>`.

source: **Automatic remote backup**: subscribers can benefit from automatic remote backups of the firewall configuration. This feature is crucial for businesses that need to ensure the safety of their data and configurations.
it: **Backup remoto automatico**: gli abbonati possono beneficiare di backup remoti automatici della configurazione del firewall. Questa funzionalità è fondamentale per le aziende che devono garantire la sicurezza dei propri dati e delle configurazioni.

source: **Support**: subscribers can receive priority support on stable releases. This can be crucial for businesses relying on NethSecurity for their operations. See also :ref:`remote_support-section`.
it: **Supporto**: gli abbonati possono ricevere supporto prioritario sulle versioni stabili. Questo può essere cruciale per le aziende che si affidano a NethSecurity per le proprie operazioni. Vedere anche :ref:`remote_support-section`.

source: **Consultation and customization**: subscribers could get consultation services and assistance with customization to tailor the server's functionalities according to specific business requirements.
it: **Consulenza e personalizzazione**: gli abbonati possono usufruire di servizi di consulenza e assistenza per la personalizzazione, al fine di adattare le funzionalità del server alle specifiche esigenze aziendali.

source: It's important to note that while a subscription might not be required for normal use, businesses with specific needs or those seeking additional support and features might find value in subscribing to NethSecurity offer.
it: È importante notare che, sebbene un abbonamento possa non essere necessario per l'uso normale, le aziende con esigenze specifiche o che cercano supporto e funzionalità aggiuntive potrebbero trovare vantaggioso sottoscrivere l'offerta NethSecurity.

source: Register the system
it: Registrare il sistema

source: To register the system, follow the below steps:
it: Per registrare il sistema, seguire i passaggi riportati di seguito:

source: Access the Enterprise or Community portal, add a new server and copy the token
it: Accedere al portale Enterprise o Community, aggiungere un nuovo server e copiare il token

source: Access the firewall and go to the ``Subscription`` page
it: Accedere al firewall e andare alla pagina ``Subscription``

source: Paste the token inside the ``Authentication token`` field
it: Incollare il token nel campo ``Authentication token``

source: Click the :guilabel:`Register` button
it: Fare clic sul pulsante :guilabel:`Registrati`

source: The system will automatically register to the correct Enterprise or Community portal.
it: Il sistema si registrerà automaticamente al portale Enterprise o Community corretto.

source: Please note that the registration process requires an active internet connection.
it: Si noti che il processo di registrazione richiede una connessione Internet attiva.

source: Remove the subscription
it: Rimuovere l'abbonamento

source: When the subscription expires, or at the end of a trial period, click the :guilabel:`Cancel registration` button.
it: Quando l'abbonamento scade, o al termine del periodo di prova, fare clic sul pulsante :guilabel:`Annulla registrazione`.
