Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/system_requirements.po
Languages: it

source: System requirements
it: Requisiti di sistema

source: NethSecurity is currently available only for `x86-64 architecture <https://en.wikipedia.org/wiki/X86-64>`_.
it: NethSecurity è attualmente disponibile solo per l'`architettura x86-64 <https://en.wikipedia.org/wiki/X86-64>`_.

source: Minimum hardware requirements:
it: Requisiti hardware minimi:

source: 1 vCPU/cores
it: 1 vCPU/core

source: 1GB of RAM
it: 1 GB di RAM

source: 1GB of disk space
it: 1 GB di spazio su disco

source: 2 Ethernet network cards
it: 2 schede di rete Ethernet

source: Recommended hardware requirements:
it: Requisiti hardware consigliati:

source: 2 vCPU/cores
it: 2 vCPU/core

source: 2GB of RAM
it: 2 GB di RAM

source: 1GB if disk space plus an additional USB storage for persistent data like logs
it: 1 GB di spazio su disco più una memoria USB aggiuntiva per dati persistenti come i log
