Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/threat_shield_ip.po
Languages: it

source: NethSecurity is equipped with various tools and integrations useful for countering threats coming from the internet. One of these tools is Threat Shield IP, which blocks any traffic coming from compromised IP addresses or destined to them as well as any requests addressed to hostnames that could be malicious.
it: NethSecurity è dotato di diversi strumenti e integrazioni utili per contrastare le minacce provenienti da Internet. Uno di questi strumenti è Threat Shield IP, che blocca qualsiasi traffico proveniente da indirizzi IP compromessi o a essi destinato, così come qualsiasi richiesta indirizzata a nomi host che potrebbero essere dannosi.

source: The service can load community-maintained blocklists or can rely on high-quality blocklists very frequently updated and maintained by `Nethesis <https://www.nethesis.it>`_ and `Yoroy <https://yoroi.company>`_ a leading company focused on CyberSecurity and member of `Cyber Threat Alliance <https://www.cyberthreatalliance.org>`_. Yoroi blacklists ensure great effectiveness and high confidence, minimizing the possibility of false positives.
it: Il servizio può caricare blocklist mantenute dalla comunità oppure può fare affidamento su blocklist di alta qualità, aggiornate e mantenute molto frequentemente da `Nethesis <https://www.nethesis.it>`_ e `Yoroi <https://yoroi.company>`_, un'azienda leader nel settore della CyberSecurity e membro della `Cyber Threat Alliance <https://www.cyberthreatalliance.org>`_. Le blacklist di Yoroi garantiscono grande efficacia e un elevato livello di affidabilità, riducendo al minimo la possibilità di falsi positivi.

source: Please note that to access the Nethesis and Yoroi blocklists, the machine must have a valid extra entitlement for this service.
it: Si noti che, per accedere alle blocklist di Nethesis e Yoroi, la macchina deve disporre di un extra entitlement valido per questo servizio.

source: Configuration
it: Configurazione

source: The service is disabled by default, to enable it navigate to the ``Threat shield IP`` page under the ``Security`` section. Access the ``Settings`` tab and activate the ``Status`` switch.
it: Il servizio è disabilitato per impostazione predefinita; per abilitarlo, navigare alla pagina ``Threat shield IP`` nella sezione ``Sicurezza``. Accedere alla scheda ``Impostazioni`` e attivare l'interruttore ``Stato``.

source: When the service is enabled, the ``Blocklist feeds`` tab will display all available blocklists. You can enable or disable each blocklist by using the switch on the right side of the list. Enabled blocklists will be automatically updated at regular intervals. NethSecurity 8 allows the use of Community and Enterprise blocklists.
it: Quando il servizio è abilitato, la scheda ``Blocklist feed`` mostrerà tutte le blocklist disponibili. È possibile abilitare o disabilitare ciascuna blocklist utilizzando l'interruttore sul lato destro dell'elenco. Le blocklist abilitate verranno aggiornate automaticamente a intervalli regolari. NethSecurity 8 consente l'utilizzo di blocklist Community ed Enterprise.

source: Community blocklists
it: Blocklist della community

source: Community blocklists are sourced from community contributors and cover various areas: Ads blocking, Malware blocking, Spam blocking, Tracker blocking, and so on. NethSecurity makes them available as they are. The type of usage license may vary depending on the provider, so if the use is not personal, you may need to inquire with the provider.
it: Le blocklist della community sono fornite da contributori della community e coprono diverse aree: blocco delle pubblicità, blocco di malware, blocco dello spam, blocco dei tracker e così via. NethSecurity le rende disponibili così come sono. Il tipo di licenza d'uso può variare a seconda del fornitore, quindi, se l'utilizzo non è personale, potrebbe essere necessario informarsi presso il fornitore.

source: Community lists maintenance
it: Manutenzione delle liste della community

source: Each blocklist is maintained by its specific provider. NethSecurity already includes the URLs for downloading the feeds, which are valid at the time of the release. However, because these URLs are hard-coded, if the provider changes them, some blocklists may no longer be downloadable.
it: Ogni blocklist è gestita dal relativo provider specifico. NethSecurity include già gli URL per il download dei feed, validi al momento del rilascio. Tuttavia, poiché questi URL sono integrati nel software, se il provider li modifica, alcune blocklist potrebbero non essere più scaricabili.

source: Enterprise blocklists
it: Blocklist Enterprise

source: Subscription required
it: Abbonamento richiesto

source: This feature is available only if the firewall has a valid :ref:`Community or Enterprise subscription <subscription-section>`.
it: Questa funzionalità è disponibile solo se il firewall dispone di un abbonamento :ref:`Community o Enterprise <subscription-section>` valido.

source: Enterprise blocklists are specifically focused on security and offer several advantages over community-maintained blocklists:
it: Le blocklist Enterprise sono specificamente orientate alla sicurezza e offrono diversi vantaggi rispetto alle blocklist mantenute dalla comunità:

source: **Quality and accuracy**: Enterprise blocklists, such as the ones provided by Nethesis and Yoroi, are curated and maintained by reputable cybersecurity companies. These companies have dedicated teams that continuously monitor and update the blocklists to ensure they are accurate and effective in blocking malicious traffic. This results in a higher level of quality and accuracy compared to community-maintained blocklists, which may not receive the same level of attention and updates.
it: **Qualità e accuratezza**: Le blocklist Enterprise, come quelle fornite da Nethesis e Yoroi, sono curate e mantenute da aziende di cybersecurity affidabili. Queste aziende dispongono di team dedicati che monitorano e aggiornano continuamente le blocklist per garantire che siano accurate ed efficaci nel bloccare il traffico dannoso. Questo si traduce in un livello superiore di qualità e accuratezza rispetto alle blocklist mantenute dalla comunità, che potrebbero non ricevere la stessa attenzione e frequenza di aggiornamenti.

source: **Timeliness**: Enterprise blocklists are frequently updated to include the latest threats and malicious IP addresses. Cybersecurity companies like Nethesis and Yoroi actively track emerging threats and promptly add them to their blocklists. This ensures that your system is protected against the most recent and evolving threats.
it: **Tempestività**: Le blocklist Enterprise vengono aggiornate frequentemente per includere le minacce più recenti e gli indirizzi IP dannosi. Aziende di cybersecurity come Nethesis e Yoroi monitorano attivamente le minacce emergenti e le aggiungono tempestivamente alle loro blocklist. Questo garantisce che il sistema sia protetto contro le minacce più recenti e in evoluzione.

source: **Reduced false positives**: False positives occur when legitimate traffic is mistakenly blocked. Enterprise blocklists are designed to minimize false positives by carefully curating and verifying the listed IP addresses and hostnames. The companies behind Enterprise blocklists have robust processes in place to ensure that only malicious entities are included in the blocklists. This reduces the chances of legitimate traffic being blocked, minimizing disruptions to your network or services.
it: **Riduzione dei falsi positivi**: I falsi positivi si verificano quando il traffico legittimo viene bloccato per errore. Le blocklist Enterprise sono progettate per ridurre al minimo i falsi positivi attraverso una selezione e una verifica accurata degli indirizzi IP e dei nomi host elencati. Le aziende che gestiscono le blocklist Enterprise adottano processi rigorosi per garantire che solo entità malevole vengano incluse nelle blocklist. Questo riduce la probabilità che il traffico legittimo venga bloccato, minimizzando le interruzioni alla rete o ai servizi.

source: **Enterprise support**: Enterprise blocklists often come with additional support and services tailored for enterprise environments. This includes access to technical support, documentation, and integration assistance. If any issues or questions arise while using the Enterprise blocklists, you can rely on the support provided by the cybersecurity companies to help you address them effectively.
it: **Supporto Enterprise**: Le blocklist Enterprise spesso includono supporto aggiuntivo e servizi specifici per ambienti aziendali. Questo comprende l’accesso al supporto tecnico, alla documentazione e all’assistenza per l’integrazione. In caso di problemi o domande durante l’utilizzo delle blocklist Enterprise, è possibile fare affidamento sul supporto fornito dalle aziende di cybersecurity per affrontarli in modo efficace.

source: Yoroi and Nethesis blocklists are Enterprise blocklists. These lists will be listed only if the machine has a valid :ref:`Enterprise or Community subscription <subscription-section>` and a valid entitlement for the Threat Shield IP service.
it: Le blocklist Yoroi e Nethesis sono blocklist Enterprise. Queste liste saranno visualizzate solo se la macchina dispone di un :ref:`abbonamento Enterprise o Community valido <subscription-section>` e di un diritto valido per il servizio Threat Shield IP.

source: Logging
it: Log

source: The Threat Shield IP feature includes advanced logging capabilities to monitor and track potential threats. The logging section allows you to configure which types of blocked packets are logged:
it: La funzionalità Threat Shield IP include capacità avanzate di registrazione per monitorare e tracciare potenziali minacce. La sezione di registrazione consente di configurare quali tipi di pacchetti bloccati vengono registrati:

source: Log packets blocked in pre-routing chain: when enabled, this option logs packets that are blocked in the pre-routing chain, which processes packets before they enter the routing table.
it: Log dei pacchetti bloccati nella chain di pre-routing: quando abilitata, questa opzione registra i pacchetti che vengono bloccati nella catena di pre-routing, che elabora i pacchetti prima che entrino nella tabella di routing.

source: Log packets blocked in input chain: his option, when activated, logs packets blocked in the input chain, which handles packets destined to the firewall itself. Please note that this option can generate a large number of logs if the firewall is under heavy traffic.
it: Log dei pacchetti bloccati nella chain di input: questa opzione, quando attivata, registra i pacchetti bloccati nella catena di input, che gestisce i pacchetti destinati direttamente al firewall stesso. Si noti che questa opzione può generare un numero elevato di log se il firewall è sottoposto a traffico intenso.

source: Log packets blocked in forward chain: Enabling this logs packets blocked in the forward chain, which processes packets being routed through the firewall.
it: Log dei pacchetti bloccati nella chain di forward: Abilitando questa opzione vengono registrati i pacchetti bloccati nella catena di forward, che elabora i pacchetti instradati attraverso il firewall.

source: Log packets blocked forwarded from LAN: This option logs packets that are blocked when forwarded from the Local Area Network (LAN).
it: Log dei pacchetti bloccati inoltrati dalla LAN: Questa opzione registra i pacchetti che vengono bloccati quando vengono inoltrati dalla rete locale (LAN).

source: These logging options provide granular control over which blocked packets are recorded, allowing to expose metrics inside the :ref:`real-time monitoring <real_time_monitoring-section>` and :ref:`historical monitoring <historical_monitoring-section>` sections.
it: Queste opzioni di logging offrono un controllo granulare su quali pacchetti bloccati vengono registrati, permettendo di esporre metriche all'interno delle sezioni :ref:`monitoraggio in tempo reale <real_time_monitoring-section>` e :ref:`monitoraggio storico <historical_monitoring-section>`.

source: Local allowlist
it: Allowlist locale

source: Sometimes it may be necessary to allow access to certain IP addresses, to do this you can use the ``Local allowlist`` tab. Use the :guilabel:`Add address` button to add a new address to the list. The address can be a valid IPv4/IPv6 address with optional CIDR notation, a MAC address, or a fully qualified hostname (FQDN).
it: A volte può essere necessario consentire l'accesso a determinati indirizzi IP; per farlo è possibile utilizzare la scheda ``Allowlist locale``. Utilizzare il pulsante :guilabel:`Aggiungi indirizzo` per aggiungere un nuovo indirizzo all'elenco. L'indirizzo può essere un indirizzo IPv4/IPv6 valido con notazione CIDR opzionale, un indirizzo MAC oppure un hostname completamente qualificato (FQDN).

source: For example, the address can be:
it: Ad esempio, l'indirizzo può essere:

source: IPv4 address: 192.168.0.1
it: Indirizzo IPv4: 192.168.0.1

source: IPv6 address: 2001:0db8:85a3:0000:0000:8a2e:0370:7334
it: Indirizzo IPv6: 2001:0db8:85a3:0000:0000:8a2e:0370:7334

source: IPv4 address with CIDR notation: 192.168.0.0/24
it: Indirizzo IPv4 con notazione CIDR: 192.168.0.0/24

source: MAC address: 00:0a:95:9d:68:16
it: Indirizzo MAC: 00:0a:95:9d:68:16

source: Fully qualified hostname: example.com
it: Nome host completamente qualificato: example.com

source: A comment can be associated with each address to facilitate management.
it: È possibile associare un commento a ciascun indirizzo per facilitarne la gestione.

source: You can add a comment to provide additional information about the address, such as its purpose or owner. This can help in organizing and managing the allowlist effectively.
it: È possibile aggiungere un commento per fornire informazioni aggiuntive sull'indirizzo, come ad esempio il suo scopo o il proprietario. Questo può aiutare a organizzare e gestire la allowlist in modo efficace.

source: Local blocklist
it: Blocklist locale

source: Threat Shield IP includes a local blocklist functionality, which allows you to manually specify addresses that should always be blocked. This provides an additional layer of customization to your security setup.
it: Threat Shield IP include una funzionalità di blocklist locale, che consente di specificare manualmente gli indirizzi che devono essere sempre bloccati. Questo offre un ulteriore livello di personalizzazione alla configurazione della sicurezza.

source: To access and customize the blocklist, navigate to the ``Local blocklist`` tab in the Threat Shield IP interface. Use the :guilabel:`Add address` button to include new entries. Each entry is composed by an address and a description. Valid syntax for the address is the same as for the :ref:`local_allowlist-section`.
it: Per accedere e personalizzare la blocklist, navigare nella scheda ``Blocklist locale`` nell'interfaccia Threat Shield IP. Utilizzare il pulsante :guilabel:`Aggiungi indirizzo` per includere nuove voci. Ogni voce è composta da un indirizzo e una descrizione. La sintassi valida per l'indirizzo è la stessa utilizzata per la :ref:`local_allowlist-section`.

source: When adding addresses to the local blocklist, ensure you enter them correctly to avoid accidentally blocking legitimate traffic. It's also a good practice to include a descriptive comment for each entry to help with future management and auditing of your blocklist.
it: Quando si aggiungono indirizzi alla blocklist locale, assicurarsi di inserirli correttamente per evitare di bloccare accidentalmente traffico legittimo. È inoltre buona pratica includere un commento descrittivo per ogni voce, in modo da facilitare la gestione e la verifica futura della propria blocklist.

source: Block brute force attacks
it: Bloccare gli attacchi brute force

source: When Threat Shield IP is enabled, the system automatically starts checking for brute force attack attempts on firewall services. By default, the monitored services include SSH access and the login to NethSecurity UI. The system detects login attempts and automatically blocks IPs that have failed to enter the correct credentials.
it: Quando Threat Shield IP è abilitato, il sistema avvia automaticamente il controllo dei tentativi di attacco brute force sui servizi del firewall. Per impostazione predefinita, i servizi monitorati includono l'accesso SSH e il login all'interfaccia utente di NethSecurity. Il sistema rileva i tentativi di accesso e blocca automaticamente gli IP che non sono riusciti a inserire le credenziali corrette.

source: To enable or disable the brute force protection, navigate to the ``Block brute force attacks`` section in the Threat Shield IP interface, under the ``Settings`` tab and use the switch to activate or deactivate the feature.
it: Per abilitare o disabilitare la protezione contro gli attacchi brute force, accedere alla sezione ``Blocca attacchi brute force`` nell'interfaccia Threat Shield IP, sotto la scheda ``Impostazioni`` e utilizzare l'interruttore per attivare o disattivare la funzionalità.

source: The feature can be customized by adjusting the following settings:
it: La funzionalità può essere personalizzata modificando le seguenti impostazioni:

source: ``Ban after N failed accesses``: this setting determines the number of failed login attempts allowed before an IP address is banned. The default value is typically 3, but can be adjusted as needed. A lower value increases security but may also increase the risk of false positives, like blocking legitimate users who mistype their credentials.
it: ``Ban dopo N accessi falliti``: questa impostazione determina il numero di tentativi di accesso falliti consentiti prima che un indirizzo IP venga bannato. Il valore predefinito è solitamente 3, ma può essere modificato secondo necessità. Un valore più basso aumenta la sicurezza ma può anche aumentare il rischio di falsi positivi, ad esempio bloccando utenti legittimi che inseriscono erroneamente le proprie credenziali.

source: ``Patterns to detect attacks``: this field allows you to specify patterns that the system uses to identify potential brute force attacks. Common patterns include:
it: ``Pattern per rilevare gli attacchi``: questo campo consente di specificare i pattern che il sistema utilizza per identificare potenziali attacchi di forza bruta. I pattern comuni includono:

source: *Exit before auth from*: detects bad authentication attempts to SSH service
it: *Exit before auth from*: rileva tentativi di autenticazione non riusciti al servizio SSH

source: *authentication failed for user*: identifies failed authentication attempts to NethSecurity web interface
it: *autenticazione non riuscita per l'utente*: identifica i tentativi di autenticazione non riusciti all'interfaccia web di NethSecurity

source: *TLS Auth Error*, *TLS handshake failed*, *AUTH_FAILED*: detects failed authentication attempts to OpenVPN service
it: *Errore di autenticazione TLS*, *Handshake TLS non riuscito*, *AUTH_FAILED*: rileva tentativi di autenticazione non riusciti al servizio OpenVPN

source: You can add additional patterns using the :guilabel:`Add pattern`` button to customize the detection mechanism. Each pattern can be a valid *grep* regular expression.
it: È possibile aggiungere ulteriori pattern utilizzando il pulsante :guilabel:`Aggiungi pattern` per personalizzare il meccanismo di rilevamento. Ogni pattern può essere una valida espressione regolare *grep*.

source: ``Ban time``: this setting determines the duration for which an IP address remains banned after exceeding the allowed number of failed attempts. The default is often set to 30 minutes, but can be adjusted based on your security requirements.
it: ``Tempo di ban``: questa impostazione determina la durata per cui un indirizzo IP rimane bannato dopo aver superato il numero consentito di tentativi falliti. Il valore predefinito è spesso impostato a 30 minuti, ma può essere modificato in base alle proprie esigenze di sicurezza.

source: You can perform further actions using the command line; these are the supported commands:
it: È possibile eseguire ulteriori azioni utilizzando la riga di comando; questi sono i comandi supportati:

source: View all IP addresses currently on the blocklist: ``/etc/init.d/banip survey blocklistv4``
it: Visualizzare tutti gli indirizzi IP attualmente presenti nella blocklist: ``/etc/init.d/banip survey blocklistv4``

source: Look up a specific IP in the blocklist: ``/etc/init.d/banip search IP_ADDRESS``
it: Cercare un IP specifico nella blocklist: ``/etc/init.d/banip search IP_ADDRESS``

source: Unban an IP address: ``nft delete element inet banIP blocklistv4 { IP_ADDRESS }``
it: Rimuovere il ban da un indirizzo IP: ``nft delete element inet banIP blocklistv4 { IP_ADDRESS }``

source: Bear in mind that you need to specify the correct blocklist in commands when prompted (``blocklistv4`` for IPv4, ``blocklistv6`` for IPv6).
it: Tenere presente che è necessario specificare la blocklist corretta nei comandi quando richiesto (``blocklistv4`` per IPv4, ``blocklistv6`` per IPv6).

source: Block DoS
it: Bloccare DoS

source: Threat Shield IP also includes protection against various types of Denial of Service (DoS) attacks. DoS protection limits excessive suspicious requests of a certain type, blocking that kind of traffic until the situation normalizes.
it: Threat Shield IP include anche la protezione contro vari tipi di attacchi Denial of Service (DoS). La protezione DoS limita le richieste sospette eccessive di un certo tipo, bloccando quel tipo di traffico fino a quando la situazione non si normalizza.

source: ``Block ICMP DoS``: when enabled, this option protects against DoS attacks using the Internet Control Message Protocol (ICMP). The limit is set to 100 packets per second for all traffic passing through the firewall.
it: ``Blocca DoS ICMP``: quando abilitata, questa opzione protegge dagli attacchi DoS che utilizzano il protocollo Internet Control Message Protocol (ICMP). Il limite è impostato a 100 pacchetti al secondo per tutto il traffico che passa attraverso il firewall.

source: ``Block TCP DoS``: this option, when activated, guards against TCP-based DoS attacks based on bad packets. A packet could be considered bad if it is not part of an established connection or if it is part of a connection that has been closed. The limit is set to 10 bad packets per second for all traffic passing through the firewall.
it: ``Blocca TCP DoS``: questa opzione, quando attivata, protegge da attacchi DoS basati su TCP che utilizzano pacchetti non validi. Un pacchetto può essere considerato non valido se non fa parte di una connessione stabilita o se appartiene a una connessione che è stata chiusa. Il limite è impostato a 10 pacchetti non validi al secondo per tutto il traffico che attraversa il firewall.

source: ``Block UDP DoS``: Enabling this protects against User Datagram Protocol (UDP) based DoS attacks. The limit is set to 100 packets per second for all traffic passing through the firewall.
it: ``Blocca DoS UDP``: L'abilitazione di questa opzione protegge da attacchi DoS basati su User Datagram Protocol (UDP). Il limite è impostato a 100 pacchetti al secondo per tutto il traffico che attraversa il firewall.
