Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/threat_shield_dns.po
Languages: it

source: Please note that to access the Nethesis and Yoroi blocklists, the unit must have a valid extra entitlement for this service.
it: Si noti che, per accedere alle blocklist di Nethesis e Yoroi, l'unità deve disporre di un abbonamento extra valido per questo servizio.

source: Configuration
it: Configurazione

source: Please use Threat shield DNS only if you are not already using the FlashStart service. Both services operate at the DNS level and cannot be used together. The UI prevents enabling them simultaneously to avoid conflicts.
it: Utilizzare Threat shield DNS solo se non si sta già utilizzando il servizio FlashStart. Entrambi i servizi operano a livello DNS e non possono essere utilizzati insieme. L'interfaccia utente impedisce di abilitarli contemporaneamente per evitare conflitti.

source: The service is disabled by default, to enable it navigate to the ``Threat shield DNS`` page under the ``Security`` section. Access the ``Settings`` tab and activate the ``Status`` switch.
it: Il servizio è disattivato per impostazione predefinita; per abilitarlo, navigare alla pagina ``Threat shield DNS`` nella sezione ``Sicurezza``. Accedere alla scheda ``Impostazioni`` e attivare l'interruttore ``Stato``.

source: When the service is enabled, the ``Blocklist sources`` tab will display all available blocklists. You can enable or disable each blocklist by using the switch on the right side of the list. Enabled blocklists will be automatically updated at regular intervals.
it: Quando il servizio è abilitato, la scheda ``Sorgenti blocklist`` mostrerà tutte le blocklist disponibili. È possibile abilitare o disabilitare ciascuna blocklist utilizzando l'interruttore sul lato destro dell'elenco. Le blocklist abilitate verranno aggiornate automaticamente a intervalli regolari.

source: To specify on which zones the service should be active, select them in the ``Force DNS redirection on these zones`` combobox.
it: Per specificare su quali zone il servizio deve essere attivo, selezionarle nella combobox ``Forza la redirezione DNS in queste zone``.

source: ``Redirected ports`` allows you to specify which ports should be redirected to Threat shield DNS service.
it: ``Porte redirezionate`` consente di specificare quali porte devono essere reindirizzate al servizio DNS di Threat shield.

source: Community blocklists
it: Blocklist della community

source: Community blocklists are sourced from community contributors and block various domains related to: ads, malware, spam, tracker, explicit sexual content, piracy and so on. NethSecurity makes them available as they are. The type of usage license may vary depending on the provider, so if the use is not personal, you may need to inquire with the provider.
it: Le blocklist della community sono fornite da contributori della community e bloccano vari domini relativi a: pubblicità, malware, spam, tracker, contenuti sessuali espliciti, pirateria e così via. NethSecurity le rende disponibili così come sono. Il tipo di licenza d'uso può variare a seconda del fornitore, quindi, se l'utilizzo non è personale, potrebbe essere necessario informarsi presso il fornitore.

source: Community lists maintenance
it: Manutenzione delle liste della community

source: Each blocklist is maintained by its specific provider. NethSecurity already includes the URLs for downloading the feeds, which are valid at the time of the release. However, because these URLs are hard-coded, if the provider changes them, some blocklists may no longer be downloadable.
it: Ogni blocklist è gestita dal relativo provider specifico. NethSecurity include già gli URL per il download dei feed, che sono validi al momento del rilascio. Tuttavia, poiché questi URL sono codificati all'interno del sistema, se il provider li modifica, alcune blocklist potrebbero non essere più scaricabili.

source: Enterprise blocklists
it: Blocklist Enterprise

source: Subscription required
it: Subscription richiesta

source: This feature is available only if the unit has a valid :ref:`Community or Enterprise subscription <subscription-section>`.
it: Questa funzionalità è disponibile solo se l'unità dispone di un valido :ref:`abbonamento Community o Enterprise <subscription-section>`.

source: Enterprise blocklists are specifically focused on security and offer several advantages over community-maintained blocklists:
it: Le blocklist enterprise sono specificamente focalizzate sulla sicurezza e offrono diversi vantaggi rispetto alle blocklist mantenute dalla comunità:

source: **Quality and accuracy**: Enterprise blocklists, such as the ones provided by Nethesis and Yoroi, are curated and maintained by reputable cybersecurity companies. These companies have dedicated teams that continuously monitor and update the blocklists to ensure they are accurate and effective in blocking malicious traffic. This results in a higher level of quality and accuracy compared to community-maintained blocklists, which may not receive the same level of attention and updates.
it: **Qualità e accuratezza**: Le blocklist aziendali, come quelle fornite da Nethesis e Yoroi, sono curate e mantenute da aziende di cybersecurity affidabili. Queste aziende dispongono di team dedicati che monitorano e aggiornano continuamente le blocklist per garantire che siano accurate ed efficaci nel bloccare il traffico dannoso. Questo si traduce in un livello superiore di qualità e accuratezza rispetto alle blocklist mantenute dalla comunità, che potrebbero non ricevere la stessa attenzione e frequenza di aggiornamenti.

source: **Timeliness**: Enterprise blocklists are frequently updated to include the latest threats and malicious IP addresses. Cybersecurity companies like Nethesis and Yoroi actively track emerging threats and promptly add them to their blocklists. This ensures that your system is protected against the most recent and evolving threats.
it: **Tempestività**: Le blocklist aziendali vengono aggiornate frequentemente per includere le minacce più recenti e gli indirizzi IP dannosi. Aziende di cybersecurity come Nethesis e Yoroi monitorano attivamente le minacce emergenti e le aggiungono tempestivamente alle loro blocklist. Questo garantisce che il sistema sia protetto contro le minacce più recenti e in evoluzione.

source: **Reduced false positives**: False positives occur when legitimate traffic is mistakenly blocked. Enterprise blocklists are designed to minimize false positives by carefully curating and verifying the listed IP addresses and hostnames. The companies behind Enterprise blocklists have robust processes in place to ensure that only malicious entities are included in the blocklists. This reduces the chances of legitimate traffic being blocked, minimizing disruptions to your network or services.
it: **Falsi positivi ridotti**: I falsi positivi si verificano quando il traffico legittimo viene bloccato per errore. Le blocklist Enterprise sono progettate per ridurre al minimo i falsi positivi attraverso una selezione e una verifica accurata degli indirizzi IP e dei nomi host elencati. Le aziende che gestiscono le blocklist Enterprise dispongono di processi solidi per garantire che solo entità malevole vengano incluse nelle blocklist. Questo riduce la possibilità che il traffico legittimo venga bloccato, minimizzando le interruzioni alla rete o ai servizi.

source: **Enterprise support**: Enterprise blocklists often come with additional support and services tailored for enterprise environments. This includes access to technical support, documentation, and integration assistance. If any issues or questions arise while using the Enterprise blocklists, you can rely on the support provided by the cybersecurity companies to help you address them effectively.
it: **Supporto Enterprise**: Le blocklist Enterprise spesso includono supporto aggiuntivo e servizi pensati per ambienti aziendali. Questo comprende l’accesso al supporto tecnico, alla documentazione e all’assistenza per l’integrazione. In caso di problemi o domande durante l’utilizzo delle blocklist Enterprise, è possibile fare affidamento sul supporto fornito dalle aziende di cybersecurity per affrontarli in modo efficace.

source: Yoroi and Nethesis blocklists are Enterprise blocklists. These lists will be listed only if the unit has a valid :ref:`Enterprise or Community subscription <subscription-section>` and a valid entitlement for the Threat Shield service.
it: Le blocklist Yoroi e Nethesis sono blocklist Enterprise. Queste liste saranno visualizzate solo se l'unità dispone di un valido :ref:`abbonamento Enterprise o Community <subscription-section>` e di un diritto valido per il servizio Threat Shield.

source: Filter bypass
it: Bypass del filtro

source: Some hosts or subnets may need to bypass Threat shield DNS filtering. To configure filter bypass, navigate to the ``Filter bypass`` tab of Threat shield DNS. Use the :guilabel:`Add bypass` button to add a new address to the list. The address can be a valid IPv4/IPv6 address with optional CIDR notation.
it: Alcuni host o subnet potrebbero dover bypassare il filtro DNS di Threat shield. Per configurare il bypass del filtro, navigare nella scheda ``Bypass filtro`` di Threat shield DNS. Utilizzare il pulsante :guilabel:`Aggiungi bypass` per aggiungere un nuovo indirizzo all'elenco. L'indirizzo può essere un indirizzo IPv4/IPv6 valido con notazione CIDR opzionale.

source: Local blocklist
it: Blocklist locale

source: To block specific domains not included in the blocklists, you can navigate to the ``Local blocklist`` tab of Threat shield DNS. Use the :guilabel:`Add domain` button to add a domain to the list; you can add a description to the domain to help you remember why it was added.
it: Per bloccare domini specifici non inclusi nelle blocklist, è possibile navigare nella scheda ``Blocklist locale`` di Threat shield DNS. Utilizzare il pulsante :guilabel:`Aggiungi dominio` per aggiungere un dominio all'elenco; è possibile aggiungere una descrizione al dominio per ricordare il motivo per cui è stato aggiunto.

source: The DNS resolution for the names listed in the blocklist will also affect the unit itself
it: La risoluzione DNS per i nomi elencati nella blocklist influenzerà anche l'unità stessa

source: Advanced configuration
it: Configurazione avanzata

source: When Threat shield DNS is enabled:
it: Quando Threat shield DNS è abilitato:

source: A new category source file is generated based on the unit registration and entitlement.
it: Un nuovo file sorgente di categoria viene generato in base alla registrazione dell'unità e ai diritti.

source: All DNS queries are redirected to the local machine.
it: Tutte le query DNS vengono reindirizzate alla macchina locale.

source: Adblock is configured to use the new category source file and will be started automatically.
it: Adblock è configurato per utilizzare il nuovo file di origine delle categorie e verrà avviato automaticamente.

source: Even if not recommended, it's possible to use Adblock without Threat shield DNS. For more detailed configuration options, please refer to the `developer manual <https://dev.nethsecurity.org/packages/ns-threat_shield/#ts-dns>`_.
it: Anche se non è raccomandato, è possibile utilizzare Adblock senza Threat shield DNS. Per opzioni di configurazione più dettagliate, consultare il `manuale per sviluppatori <https://dev.nethsecurity.org/packages/ns-threat_shield/#ts-dns>`_.

source: Threat shield DNS uses Adblock which blocks any request to domains considered malicious. The service can load community-maintained blocklists or use Enterprise feeds provided by `Nethesis <https://www.nethesis.it>`_ and `Yoroi <https://yoroi.company>`_ a leading company focused on CyberSecurity and member of `Cyber Threat Alliance <https://www.cyberthreatalliance.org>`_.
it: Threat shield DNS utilizza Adblock, che blocca qualsiasi richiesta verso domini considerati dannosi. Il servizio può caricare liste di blocco mantenute dalla comunità oppure utilizzare feed Enterprise forniti da `Nethesis <https://www.nethesis.it>`_ e `Yoroi <https://yoroi.company>`_, un'azienda leader focalizzata sulla CyberSecurity e membro della `Cyber Threat Alliance <https://www.cyberthreatalliance.org>`_.
