Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/troubleshooting.po
Languages: it

source: Troubleshooting
it: Risoluzione dei problemi

source: NethSecurity is a sophisticated firewall system with numerous interconnected components. While the system automates many configurations seamlessly, occasional breakdowns can occur.
it: NethSecurity è un sistema firewall sofisticato con numerosi componenti interconnessi. Sebbene il sistema automatizzi molte configurazioni in modo trasparente, possono occasionalmente verificarsi dei malfunzionamenti.

source: You can create a support request and report issues to the Nethesis support team or the NethServer community forum.
it: È possibile creare una richiesta di supporto e segnalare problemi al team di supporto Nethesis o al forum della community NethServer.

source: For stable releases, you can open a ticket on the `Nethesis helpdesk portal <https://helpdesk.nethesis.it>`_ if your machine has a subscription.
it: Per le versioni stabili, è possibile aprire un ticket sul `portale helpdesk di Nethesis <https://helpdesk.nethesis.it>`_ se la macchina dispone di una sottoscrizione.

source: For unstable releases, you can open a new thread on the `NethServer community English-only forum <https://community.nethserver.org>`_ in the NethSecurity category. If you are a Nethesis partner, you can open a new Italian thread on the `Nethesis partner community <https://partner.nethesis.it>`_ in the NethSecurity category.
it: Per le release instabili, è possibile aprire una nuova discussione sul `forum della community NethServer solo in inglese <https://community.nethserver.org>`_ nella categoria NethSecurity. Se si è partner Nethesis, è possibile aprire una nuova discussione in italiano sulla `community partner Nethesis <https://partner.nethesis.it>`_ nella categoria NethSecurity.

source: When opening a support request or reporting an issue, you should follow these guidelines to ensure a quick and effective resolution:
it: Quando si apre una richiesta di supporto o si segnala un problema, è necessario seguire queste linee guida per garantire una risoluzione rapida ed efficace:

source: Assign clear and descriptive titles to each ticket or discussion.
it: Assegnare titoli chiari e descrittivi a ciascun ticket o discussione.

source: Provide complete and detailed information in each request.
it: Fornire informazioni complete e dettagliate in ogni richiesta.

source: Include screenshots, logs, and any other relevant information to aid in troubleshooting.
it: Includere screenshot, log e qualsiasi altra informazione rilevante per facilitare la risoluzione dei problemi.

source: Collaborate with the support team by providing feedback and responding to their inquiries.
it: Collaborare con il team di supporto fornendo feedback e rispondendo alle loro richieste.

source: **1. Gather information**
it: **1. Raccogliere informazioni**

source: Before creating a support request, it's crucial to gather as much information as possible about the issue you're facing. This helps the support team identify and resolve the problem quickly.
it: Prima di creare una richiesta di supporto, è fondamentale raccogliere quante più informazioni possibili sul problema riscontrato. Questo aiuta il team di supporto a identificare e risolvere il problema rapidamente.

source: Your support request should include the following:
it: La richiesta di assistenza dovrebbe includere quanto segue:

source: **Your system configuration:** This includes the version of NethSecurity you're using; you can find the information inside the Dashboard page. Please report the full version like ``8 23.05.2-ns.0.0.1-beta1-96-ga759afb``
it: **Configurazione del sistema:** Questa include la versione di NethSecurity in uso; l'informazione è disponibile all'interno della pagina Dashboard. Si prega di riportare la versione completa, ad esempio ``8 23.05.2-ns.0.0.1-beta1-96-ga759afb``

source: **The problem you're encountering:** Describe the problem in detail, including the steps you took to reproduce it.
it: **Il problema riscontrato:** Descrivere il problema in dettaglio, includendo i passaggi eseguiti per riprodurlo.

source: **Any error messages:** If you receive any error messages, include them in your request. You can use the :ref:`user interface <troubleshooting_ui-section>` to gather this information, or access the command line and use ``less /var/log/messages`` to find the relevant logs.
it: **Eventuali messaggi di errore:** Se vengono visualizzati messaggi di errore, includerli nella richiesta. È possibile utilizzare l':ref:`interfaccia utente <troubleshooting_ui-section>` per raccogliere queste informazioni, oppure accedere alla riga di comando e utilizzare ``less /var/log/messages`` per trovare i log rilevanti.

source: **Any changes you made:** If you made any changes to your system configuration, list them in your request.
it: **Eventuali modifiche apportate:** Se sono state apportate modifiche alla configurazione del sistema, elencarle nella richiesta.

source: **Your desired outcome:** What do you hope to achieve by contacting support?
it: **Risultato desiderato:** Qual è l'obiettivo che si intende raggiungere contattando il supporto?

source: **2. Describe the problem objectively**
it: **2. Descrivere il problema in modo oggettivo**

source: When describing the problem, focus on objective symptoms. Avoid subjective statements like "it's not working" or "it's slow." Instead, describe what happens when you perform specific actions.
it: Quando si descrive il problema, concentrarsi su sintomi oggettivi. Evitare affermazioni soggettive come "non funziona" o "è lento". Invece, descrivere cosa accade quando si eseguono azioni specifiche.

source: Example: instead of saying "The firewall isn't working," you could say "When I try to access a website, I receive this error message."
it: Esempio: invece di dire "Il firewall non funziona", si potrebbe dire "Quando si tenta di accedere a un sito web, viene visualizzato questo messaggio di errore."

source: **3. Respond to requests for information**
it: **3. Rispondere alle richieste di informazioni**

source: If the support team asks you to perform tests or provide additional details, do so promptly and thoroughly. The more information you provide, the easier it is for them to solve the issue.
it: Se il team di supporto richiede di eseguire dei test o di fornire ulteriori dettagli, è necessario farlo tempestivamente e in modo accurato. Più informazioni vengono fornite, più sarà semplice per loro risolvere il problema.

source: **4. Communicate the outcome of the solution**
it: **4. Comunicare l'esito della soluzione**

source: Once the support team offers a solution, test it and communicate the outcome. If it resolved the problem, let them know. If not, provide additional information so they can continue investigating.
it: Una volta che il team di supporto propone una soluzione, è necessario testarla e comunicare l'esito. Se il problema è stato risolto, informare il team. In caso contrario, fornire ulteriori informazioni affinché possano proseguire con l'indagine.

source: **5. Don't reboot if the problem is blocking**
it: **5. Non riavviare se il problema è bloccante**

source: Avoid rebooting the system if the problem is blocking. Rebooting can sometimes worsen the issue. Instead, contact support and work with them to resolve it.
it: Evitare di riavviare il sistema se il problema è bloccante. Il riavvio può talvolta peggiorare la situazione. Invece, contattare il supporto e collaborare con esso per risolvere il problema.

source: **6. Multiple tickets or discussions for the same issue**
it: **6. Ticket o discussioni multiple per lo stesso problema**

source: It is recommended to open "n" tickets or discussions for "n" different requests, even if they relate to the same underlying problem. While it may seem rigid and inconvenient, this approach offers significant advantages:
it: Si consiglia di aprire "n" ticket o discussioni per "n" richieste diverse, anche se queste sono correlate allo stesso problema di base. Anche se può sembrare rigido e scomodo, questo approccio offre vantaggi significativi:

source: **Improved workload parallelization:** Allows the support team to work on multiple aspects of the problem simultaneously.
it: **Parallelizzazione migliorata del carico di lavoro:** Consente al team di supporto di lavorare su più aspetti del problema simultaneamente.

source: **Faster resolution by specialists:** Different requests can be assigned to different specialists with relevant expertise, accelerating resolution.
it: **Risoluzione più rapida da parte degli specialisti:** Diverse richieste possono essere assegnate a specialisti differenti con competenze specifiche, accelerando la risoluzione.

source: **More effective problem-solving:** Focuses attention on each individual request, avoiding confusion and disorientation.
it: **Risoluzione dei problemi più efficace:** Consente di concentrarsi su ogni singola richiesta, evitando confusione e disorientamento.

source: **Enhanced priority management:** Enables assigning different priorities to each request based on urgency and impact.
it: **Gestione avanzata delle priorità:** Consente di assegnare priorità diverse a ciascuna richiesta in base all'urgenza e all'impatto.

source: **Better communication:** Facilitates clear communication between the support team and you, ensuring dedicated discussion for each issue.
it: **Comunicazione migliorata:** Facilita una comunicazione chiara tra il team di supporto e l’utente, garantendo una discussione dedicata per ciascun problema.

source: Gathering information from the user interface
it: Raccolta di informazioni dall'interfaccia utente

source: When issues arise, the user interface (UI) displays an error message capturing the nature of the problem.
it: Quando si verificano problemi, l'interfaccia utente (UI) visualizza un messaggio di errore che descrive la natura del problema.

source: The error message provides valuable information, presenting the details of the request and the encountered error in JSON format. To assist in diagnosing and resolving the issue, users can utilize the ``Copy command`` button. Clicking this button allows you to retrieve the command that resulted in the error. Simply paste this copied command into a shell to obtain more detailed information.
it: Il messaggio di errore fornisce informazioni preziose, presentando i dettagli della richiesta e l'errore riscontrato in formato JSON. Per facilitare la diagnosi e la risoluzione del problema, è possibile utilizzare il pulsante ``Copia comando``. Facendo clic su questo pulsante, si può recuperare il comando che ha generato l'errore. Basta incollare questo comando copiato in una shell per ottenere informazioni più dettagliate.

source: When reporting an error to the support team, it's crucial to provide the following essential information:
it: Quando si segnala un errore al team di supporto, è fondamentale fornire le seguenti informazioni essenziali:

source: **Request and Response Contents:** Include the content of the ``Request`` and ``Response`` sections found in the error message.
it: **Contenuti della richiesta e della risposta:** Includere il contenuto delle sezioni ``Request`` e ``Response`` presenti nel messaggio di errore.

source: **Copied Command:** Paste the command copied using the ``Copy command`` button.
it: **Comando copiato:** Incollare il comando copiato utilizzando il pulsante ``Copia comando``.

source: **Execution Output:** For further assistance, execute the copied command and report the output.
it: **Output dell'esecuzione:** Per ulteriore assistenza, eseguire il comando copiato e riportare l'output.

source: If the provided information is insufficient, in extreme cases, it may be necessary to share the content of the JavaScript console if the error is present. Follow your browser's instructions (usually accessed by pressing ``F12``), copy the entire console content, and paste it for a more in-depth analysis. Your collaboration in providing accurate and detailed information ensures a more effective and timely resolution to any issues encountered with NethSecurity.
it: Se le informazioni fornite non sono sufficienti, in casi estremi potrebbe essere necessario condividere il contenuto della console JavaScript se l'errore è presente. Seguire le istruzioni del proprio browser (di solito accessibili premendo ``F12``), copiare l'intero contenuto della console e incollarlo per un'analisi più approfondita. La collaborazione nel fornire informazioni accurate e dettagliate garantisce una risoluzione più efficace e tempestiva di eventuali problemi riscontrati con NethSecurity.
