Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/uci.po
Languages: it

source: UCI (Unified Configuration Interface) is a centralized configuration management system used in NethSecurity. It provides a unified approach to system configuration through a command-line interface and standardized configuration files.
it: UCI (Unified Configuration Interface) è un sistema centralizzato di gestione della configurazione utilizzato in NethSecurity. Fornisce un approccio unificato alla configurazione del sistema tramite un'interfaccia a riga di comando e file di configurazione standardizzati.

source: Key Characteristics
it: Caratteristiche principali

source: **Centralized Configuration**: All system configurations are stored in a single location (``/etc/config/``)
it: **Configurazione centralizzata**: Tutte le configurazioni di sistema sono memorizzate in un'unica posizione (``/etc/config/``)

source: **Database-driven**: Configurations are stored in structured database files
it: **Basato su database**: Le configurazioni sono memorizzate in file di database strutturati

source: **No Built-in Validation**: UCI executes commands without safety checks - requires system knowledge
it: **Nessuna validazione integrata**: UCI esegue i comandi senza controlli di sicurezza - è richiesta conoscenza del sistema

source: **Three-phase Workflow**: Modify → Commit → Restart/Reload
it: **Flusso di lavoro in tre fasi**: Modifica → Commit → Riavvia/Ricarica

source: **Multi-event Capable**: User interfaces can trigger multiple configuration events simultaneously
it: **Supporto per eventi multipli**: Le interfacce utente possono attivare più eventi di configurazione simultaneamente

source: Configuration Storage
it: Archiviazione della configurazione

source: All UCI configurations are stored as database files in ``/etc/config/``. Each file represents a different system component or service, a non-exhaustive example list is provided below.
it: Tutte le configurazioni UCI sono memorizzate come file di database in ``/etc/config/``. Ogni file rappresenta un diverso componente o servizio di sistema; di seguito è fornito un elenco esemplificativo non esaustivo.

source: Configuration Files Structure
it: Struttura dei file di configurazione

source: Viewing Configuration
it: Visualizzazione della configurazione

source: Show all configuration for a specific service
it: Mostra tutta la configurazione per un servizio specifico

source: **Example:**
it: **Esempio:**

source: Show specific configuration option
it: Mostra opzione di configurazione specifica

source: Complete Configuration Workflow
it: Flusso di lavoro completo di configurazione

source: Standard Three-Phase Process
it: Processo standard in tre fasi

source: **MODIFY** - Make configuration changes
it: **MODIFICA** - Apportare modifiche alla configurazione

source: **COMMIT** - Save changes to the configuration database
it: **COMMIT** - Salva le modifiche nel database di configurazione

source: **RELOAD** - Apply changes to the running system
it: **RELOAD** - Applica le modifiche al sistema in esecuzione

source: Practical Example: Changing LAN IP Address
it: Esempio pratico: modifica dell'indirizzo IP LAN

source: SET - Modifying Configuration
it: SET - Modifica della configurazione

source: The ``uci set`` command is used to modify configuration values. Changes are stored temporarily and must be committed to become persistent.
it: Il comando ``uci set`` viene utilizzato per modificare i valori di configurazione. Le modifiche vengono memorizzate temporaneamente e devono essere confermate per diventare permanenti.

source: Set a configuration value
it: Impostare un valore di configurazione

source: **Examples:**
it: **Esempi:**

source: Add a new section
it: Aggiungere una nuova sezione

source: Delete operations
it: Operazioni di eliminazione

source: COMMIT - Saving Changes
it: COMMIT - Salvataggio delle modifiche

source: Changes made with ``uci set`` are not immediately applied to the system. They must be committed first to make them persistent.
it: Le modifiche apportate con ``uci set`` non vengono applicate immediatamente al sistema. Devono essere prima confermate per renderle persistenti.

source: Commit specific service
it: Servizio specifico del commit

source: Commit all pending changes
it: Confermare tutte le modifiche in sospeso

source: Check pending changes
it: Controllare le modifiche in sospeso

source: Before committing, you can review what changes will be applied:
it: Prima di eseguire il commit, è possibile esaminare quali modifiche verranno applicate:

source: Revert uncommitted changes
it: Annullare le modifiche non confermate

source: If you want to discard uncommitted changes:
it: Se si desidera scartare le modifiche non confermate:

source: RELOAD - Applying Changes
it: RELOAD - Applicazione delle modifiche

source: After committing, you can apply the new configuration to the running system with a single command. This will automatically reload the affected services without the need to restart each one manually.
it: Dopo aver effettuato il commit, è possibile applicare la nuova configurazione al sistema in esecuzione con un unico comando. Questo ricaricherà automaticamente i servizi interessati senza la necessità di riavviarli manualmente uno per uno.

source: Reload configuration
it: Ricarica configurazione

source: Configuration File Format
it: Formato del file di configurazione

source: UCI configuration files use a structured format with sections and options:
it: I file di configurazione UCI utilizzano un formato strutturato con sezioni e opzioni:

source: Example: Network Configuration File
it: Esempio: File di configurazione di rete

source: Network Configuration File (``/etc/config/network``):
it: File di configurazione di rete (``/etc/config/network``):

source: Best Practices
it: Migliori pratiche

source: Safety Considerations
it: Considerazioni sulla sicurezza

source: **Always backup configurations** before making changes
it: **Eseguire sempre il backup delle configurazioni** prima di apportare modifiche

source: **Test changes incrementally** rather than making multiple changes at once
it: **Testare le modifiche in modo incrementale** invece di apportare più modifiche contemporaneamente

source: **Understand service dependencies** before restarting services
it: **Comprendere le dipendenze dei servizi** prima di riavviare i servizi

source: **Use** ``uci changes`` **to review** pending modifications
it: **Utilizzare** ``uci changes`` **per esaminare** le modifiche in sospeso

source: **Have console access** available when making network changes
it: **Avere accesso alla console** disponibile durante la modifica delle impostazioni di rete

source: Common Pitfalls
it: Problemi comuni

source: **Forgetting to commit**: Changes are not persistent until committed
it: **Dimenticare di eseguire il commit**: le modifiche non sono persistenti fino a quando non viene effettuato il commit

source: **Not restarting services**: Committed changes may not be active until service restart
it: **Nessun riavvio dei servizi**: le modifiche confermate potrebbero non essere attive fino al riavvio del servizio

source: **Breaking network connectivity**: Always ensure alternative access methods
it: **Interruzione della connettività di rete**: Assicurarsi sempre di disporre di metodi di accesso alternativi

source: **Syntax errors**: Invalid UCI syntax can cause configuration corruption
it: **Errori di sintassi**: Una sintassi UCI non valida può causare la corruzione della configurazione

source: Troubleshooting
it: Risoluzione dei problemi

source: Common Commands for Debugging
it: Comandi comuni per il debug

source: View pending changes
it: Visualizza modifiche in sospeso

source: Revert to last committed state
it: Ripristina allo stato dell'ultimo commit

source: Check UCI syntax
it: Controllare la sintassi UCI

source: Always ensure you have alternative access to the system when making critical configuration changes, especially network-related modifications.
it: Assicurarsi sempre di disporre di un accesso alternativo al sistema quando si apportano modifiche critiche alla configurazione, in particolare per quanto riguarda le modifiche relative alla rete.

source: UCI commands execute without validation. Incorrect configurations can render the system inaccessible.
it: I comandi UCI vengono eseguiti senza validazione. Configurazioni errate possono rendere il sistema inaccessibile.
