Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/updates.po
Languages: it

source: Updates
it: Aggiornamenti

source: NethSecurity allows two types of updates, both available from the ``Update`` section under the ``System`` menu:
it: NethSecurity consente due tipi di aggiornamenti, entrambi disponibili dalla sezione ``Aggiorna`` nel menu ``Sistema``:

source: normal updates for bugfixes and security patches
it: aggiornamenti normali per correzioni di bug e patch di sicurezza

source: system upgrades to switch to a different version
it: aggiornamenti di sistema per passare a una versione diversa

source: Bug & security fixes
it: Correzioni di bug e di sicurezza

source: These updates are intended for minor updates and bugfixes.
it: Questi aggiornamenti sono destinati ad aggiornamenti minori e correzioni di bug.

source: Typically they could be performed automatically, but at any time it is possible to check for new updates available by clicking on :guilabel:`Check for Fixes` button. These updates do not require a restart of NethSecurity, they are tied to a specific version and distributed using packages.
it: Tipicamente potrebbero essere eseguiti automaticamente, ma in qualsiasi momento è possibile verificare la presenza di nuovi aggiornamenti disponibili facendo clic sul pulsante :guilabel:`Verifica correzioni`. Questi aggiornamenti non richiedono il riavvio di NethSecurity, sono legati a una versione specifica e distribuiti tramite pacchetti.

source: When using this method, the version of the image shown inside the dashboard does not change, but the system is updated with the latest fixes.
it: Quando si utilizza questo metodo, la versione dell'immagine visualizzata all'interno della dashboard non cambia, ma il sistema viene aggiornato con le ultime correzioni.

source: System upgrades
it: Aggiornamenti di sistema

source: This types of upgrages involve the transition to a new version of the firmware that introduces new features, improvements and wider hardware support.
it: Questi tipi di aggiornamenti comportano la transizione a una nuova versione del firmware che introduce nuove funzionalità, miglioramenti e un supporto hardware più ampio.

source: The upgrade will preserve all the configurations and settings, but it will not preserve extra packages installed by the user.
it: L'aggiornamento preserverà tutte le configurazioni e le impostazioni, ma non manterrà i pacchetti aggiuntivi installati dall'utente.

source: This type of update will reboot the device (which will therefore not be reachable for a few dozen seconds) and then completely rewrites the firmware, preserving all the configurations. However it is recommended to save a configuration backup before proceeding with the upgrade.
it: Questo tipo di aggiornamento riavvierà il dispositivo (che quindi non sarà raggiungibile per alcune decine di secondi) e poi riscriverà completamente il firmware, preservando tutte le configurazioni. Tuttavia, si consiglia di salvare un backup della configurazione prima di procedere con l'aggiornamento.

source: If a new version is available, the user interface will display an information banner and a dedicated button :guilabel:`Update System` that will allow you to perform the update.
it: Se è disponibile una nuova versione, l'interfaccia utente mostrerà un banner informativo e un pulsante dedicato :guilabel:`Aggiorna sistema` che permetterà di eseguire l'aggiornamento.

source: Alternatively, it is always possible to manually upload a compatible image using the :guilabel:`Update with image file` button and proceed with the update.
it: In alternativa, è sempre possibile caricare manualmente un'immagine compatibile utilizzando il pulsante :guilabel:`Aggiorna con file immagine` e procedere con l'aggiornamento.

source: Update from command line
it: Aggiornamento da riga di comando

source: You can also perform a ``System update`` from the command line. To do this, simply download the new image file, it is recommended to save it inside ``/tmp`` directory. Then run the following command: ::
it: È inoltre possibile eseguire un ``Aggiornamento di sistema`` dalla riga di comando. Per farlo, è sufficiente scaricare il nuovo file immagine; si consiglia di salvarlo all'interno della directory ``/tmp``. Successivamente, eseguire il seguente comando: ::

source: The ``sysupgrade`` command flashes the new image file to the device.
it: Il comando ``sysupgrade`` scrive il nuovo file immagine sul dispositivo.

source: Restore extra packages
it: Ripristinare pacchetti aggiuntivi

source: During the upgrade, the system will be completely rewritten, so all the extra packages installed by the user will be lost. Still, the list of installed packages is saved in the configuration backup, so it is possible to restore them after the upgrade.
it: Durante l'aggiornamento, il sistema verrà completamente riscritto, quindi tutti i pacchetti aggiuntivi installati dall'utente andranno persi. Tuttavia, l'elenco dei pacchetti installati viene salvato nel backup della configurazione, quindi sarà possibile ripristinarli dopo l'aggiornamento.

source: After the upgrade, make sure the system can access the internet, then restore previously installed packages using the following commands: ::
it: Dopo l'aggiornamento, assicurarsi che il sistema possa accedere a Internet, quindi ripristinare i pacchetti precedentemente installati utilizzando i seguenti comandi: ::

source: Subscription required
it: Subscription richiesta

source: This feature is available only if the firewall has a valid subscription.
it: Questa funzionalità è disponibile solo se il firewall dispone di una subscription valida.

source: Automatic package updates
it: Aggiornamenti automatici dei pacchetti

source: Automatic updates for packages can be enabled from the ``Update`` section under the ``System`` menu, by enabling the ``Automatic updates`` option. Updates are checked daily and, if available, they are automatically downloaded and installed.
it: Gli aggiornamenti automatici per i pacchetti possono essere abilitati dalla sezione ``Aggiorna`` nel menu ``Sistema``, attivando l'opzione ``Aggiornamenti automatici``. Gli aggiornamenti vengono verificati quotidianamente e, se disponibili, vengono scaricati e installati automaticamente.
