Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/ups.po
Languages: it

source: An Uninterruptible Power Supply (UPS) is a device that provides backup power when the main power source fails. It is used to protect hardware such as computers, telecommunication equipment, or other electrical equipment where an unexpected power outage could cause business disruption or data loss.
it: Un gruppo di continuità (UPS, Uninterruptible Power Supply) è un dispositivo che fornisce alimentazione di riserva quando la fonte di alimentazione principale viene meno. Viene utilizzato per proteggere hardware come computer, apparecchiature di telecomunicazione o altri dispositivi elettrici in cui un'interruzione improvvisa dell'alimentazione potrebbe causare interruzioni operative o perdita di dati.

source: The `Network UPS Tools (NUT) <https://networkupstools.org/>`_ is a collection of programs that provide a common interface for monitoring and administering UPS hardware.
it: `Network UPS Tools (NUT) <https://networkupstools.org/>`_ è una raccolta di programmi che fornisce un'interfaccia comune per il monitoraggio e l'amministrazione dell'hardware UPS.

source: This guide explains how to configure a USB-connected UPS with NUT on NethSecurity. At the end of the guide, the UPS should be monitored and the system should shut down when the battery is low.
it: Questa guida spiega come configurare un UPS collegato via USB con NUT su NethSecurity. Al termine della guida, l'UPS dovrebbe essere monitorato e il sistema dovrebbe spegnersi quando la batteria è scarica.

source: NUT is not installed by default. It is part of NethSecurity extra packages and can be installed from the command line. The NUT suite is composed of several packages, but the most important are:
it: NUT non è installato di default. Fa parte dei pacchetti extra di NethSecurity e può essere installato dalla riga di comando. La suite NUT è composta da diversi pacchetti, ma i più importanti sono:

source: ``nut-server``: The NUT server daemon connects directly to the UPS, serving data to the client.
it: ``nut-server``: Il demone NUT server si connette direttamente all'UPS, fornendo i dati al client.

source: ``nut-upsc``: A command-line tool to query the UPS status.
it: ``nut-upsc``: Uno strumento da riga di comando per interrogare lo stato dell'UPS.

source: ``nut-upsmon``: The NUT UPS monitor daemon talks to nut-server and initiates a system shutdown when the UPS battery is low.
it: ``nut-upsmon``: Il demone di monitoraggio NUT UPS comunica con nut-server e avvia lo spegnimento del sistema quando la batteria dell'UPS è scarica.

source: ``nut-upscmd``: A command-line tool to send commands to the UPS (supported only by some UPS models).
it: ``nut-upscmd``: Uno strumento da riga di comando per inviare comandi all'UPS (supportato solo da alcuni modelli di UPS).

source: NUT configuration is not supported on machines with a NethSecurity subscription. The feature is meant to be used by advanced users and it is not covered by the support service.
it: La configurazione di NUT non è supportata sulle macchine con una subscription NethSecurity. La funzionalità è destinata a utenti avanzati e non è coperta dal servizio di supporto.

source: Configure a local UPS
it: Configurare un UPS locale

source: Before configuring the UPS, make sure the UPS is connected to the firewall (a cable usually comes with the UPS). Then, follow these steps:
it: Prima di configurare l'UPS, assicurarsi che l'UPS sia collegato al firewall (un cavo è solitamente fornito con l'UPS). Quindi, seguire questi passaggi:

source: Install NUT packages.
it: Installare i pacchetti NUT.

source: Find the UPS model, then install and configure the appropriate driver.
it: Individuare il modello di UPS, quindi installare e configurare il driver appropriato.

source: Configure the UPS server daemons.
it: Configurare i demoni del server UPS.

source: Enable the UPS monitor.
it: Abilitare il monitor UPS.

source: Step 1: install the required packages
it: Passaggio 1: installare i pacchetti richiesti

source: Install the required packages::
it: Installare i pacchetti richiesti::

source: These packages are not preserved during a system upgrade. For more info see :ref:`restore_extra_packages-section`.
it: Questi pacchetti non vengono conservati durante un aggiornamento del sistema. Per ulteriori informazioni, consultare :ref:`restore_extra_packages-section`.

source: Step 2: setup the appropriate driver
it: Passaggio 2: configurare il driver appropriato

source: Use ``lsusb`` to list USB devices::
it: Usare ``lsusb`` per elencare i dispositivi USB::

source: In this example, the UPS is an EATON 5E model connected to the second USB port of the second USB bus.
it: In questo esempio, l'UPS è un modello EATON 5E collegato alla seconda porta USB del secondo bus USB.

source: Select the driver from the `NUT driver page <https://networkupstools.org/stable-hcl.html>`_.
it: Selezionare il driver dalla `pagina dei driver NUT <https://networkupstools.org/stable-hcl.html>`_.

source: All driver packages start with ``nut-driver-`` prefix. Some UPS models may require a specific driver, but most of them work with the ``usbhid-ups`` driver. Install the selected driver package, in this case the ``usbhid-ups`` driver: ::
it: Tutti i pacchetti driver iniziano con il prefisso ``nut-driver-``. Alcuni modelli di UPS possono richiedere un driver specifico, ma la maggior parte di essi funziona con il driver ``usbhid-ups``. Installare il pacchetto driver selezionato, in questo caso il driver ``usbhid-ups``: ::

source: Set up the driver inside the ``upsd`` (nut-server) server. The nut-server will connect to the UPS using the driver and the port specified. It will monitor the UPS at regular intervals and provide the information to the clients like ``upsmon``. Execute: ::
it: Configurare il driver all'interno del server ``upsd`` (nut-server). Il nut-server si collegherà all'UPS utilizzando il driver e la porta specificati. Monitorerà l'UPS a intervalli regolari e fornirà le informazioni ai client come ``upsmon``. Eseguire: ::

source: Remember the name of the UPS, in this case ``eaton5e``, as it will be used in the next steps.
it: Ricordare il nome dell'UPS, in questo caso ``eaton5e``, poiché verrà utilizzato nei passaggi successivi.

source: Step 3: configure monitoring
it: Passaggio 3: configurare il monitoraggio

source: The UPS monitor (upsmon) is a daemon that monitors the UPS and initiates a system shutdown when the UPS battery is low. It connects to the UPS server (upsd) and queries the UPS status.
it: Il monitor UPS (upsmon) è un demone che monitora l'UPS e avvia l'arresto del sistema quando la batteria dell'UPS è scarica. Si connette al server UPS (upsd) e interroga lo stato dell'UPS.

source: In this scenario the UPS monitor is running on the same machine as the UPS server, so it will connect to localhost.
it: In questo scenario il monitor UPS è in esecuzione sulla stessa macchina del server UPS, quindi si connetterà a localhost.

source: Set up the user for monitoring inside ``upsd``. Please note the password is simple because it is not sent over the network::
it: Configurare l'utente per il monitoraggio all'interno di ``upsd``. Si noti che la password è semplice perché non viene inviata attraverso la rete::

source: Set up the monitor::
it: Configurare il monitor::

source: Commit and restart the services::
it: Eseguire il commit e riavviare i servizi::

source: Step 4: verify the UPS status
it: Passaggio 4: verificare lo stato dell'UPS

source: Check the UPS status::
it: Controllare lo stato dell'UPS:

source: The output should look like this: ::
it: L'output dovrebbe apparire così: ::

source: If the output is empty or an error is displayed, review the content of ``/var/log/messages``.
it: Se l'output è vuoto o viene visualizzato un errore, verificare il contenuto di ``/var/log/messages``.

source: A good server log for connected UPS::
it: Un log corretto del server per un UPS collegato::

source: A good log for upsmon::
it: Un log corretto per upsmon::

source: If an error is displayed, please see :ref:`troubleshooting_ups-section`.
it: Se viene visualizzato un errore, consultare :ref:`troubleshooting_ups-section`.

source: If everything is working, the UPS should be monitored and the system should shut down when the battery is in a critical state, usually below 20%.
it: Se tutto funziona correttamente, l'UPS dovrebbe essere monitorato e il sistema dovrebbe spegnersi quando la batteria si trova in uno stato critico, solitamente al di sotto del 20%.

source: Allow remote monitoring
it: Consentire il monitoraggio remoto

source: Multiple hardware devices can be connected to an UPS and the NUT server can share the UPS status with multiple clients. So, for example, another system powered by the same UPS can inspect the UPS status by connecting to the NUT server and shutting down when the battery is low.
it: È possibile collegare più dispositivi hardware a un UPS e il server NUT può condividere lo stato dell'UPS con più client. Ad esempio, un altro sistema alimentato dallo stesso UPS può ispezionare lo stato dell'UPS collegandosi al server NUT e spegnersi quando la batteria è scarica.

source: By default, the NUT server is configured to listen only on localhost. To allow remote monitoring, the server must be configured to listen on a specific IP address or on all interfaces.
it: Per impostazione predefinita, il server NUT è configurato per ascoltare solo su localhost. Per consentire il monitoraggio remoto, il server deve essere configurato per ascoltare su un indirizzo IP specifico o su tutte le interfacce.

source: Listen on all interfaces: ::
it: Ascolto su tutte le interfacce: ::

source: Add a user for remote monitoring. Please make sure to select a strong password: ::
it: Aggiungere un utente per il monitoraggio remoto. Assicurarsi di selezionare una password sicura: ::

source: Check the status of the server::
it: Verificare lo stato del server::

source: Create a firewall rule to allow remote monitoring from LAN, the service listen on TCP port 3493: ::
it: Creare una regola firewall per consentire il monitoraggio remoto dalla LAN, il servizio ascolta sulla porta TCP 3493: ::

source: You can now connect to the NUT server from a remote upsmon client. When the client is configured, it will connect to the NUT server and monitor the UPS status. If the battery is low, the client will initiate a system shutdown.
it: Ora è possibile connettersi al server NUT da un client upsmon remoto. Una volta configurato il client, esso si collegherà al server NUT e monitorerà lo stato dell'UPS. Se la batteria è scarica, il client avvierà lo spegnimento del sistema.

source: Connect to remote NUT server
it: Connettersi a server NUT remoto

source: This is the case where a secondary firewall is connected to the same UPS and the NUT server is running on the primary firewall. The secondary firewall will connect to the primary firewall and monitor the UPS status.
it: Questo è il caso in cui un firewall secondario è collegato allo stesso UPS e il server NUT è in esecuzione sul firewall primario. Il firewall secondario si collegherà al firewall primario e monitorerà lo stato dell'UPS.

source: First, install the NUT services on the client machine::
it: Per prima cosa, installare i servizi NUT sulla macchina client::

source: Then, configure the client to connect to the remote server::
it: Quindi, configurare il client per connettersi al server remoto::

source: Check if the client is connected to the remote server::
it: Verificare se il client è connesso al server remoto::

source: The output should be the same as the local server.
it: L'output dovrebbe essere lo stesso del server locale.

source: Now the client is connected to the remote server and will monitor the UPS status. If the battery is low, the client will initiate a system shutdown.
it: Ora il client è connesso al server remoto e monitorerà lo stato dell'UPS. Se la batteria è scarica, il client avvierà lo spegnimento del sistema.

source: Extra UPS settings
it: Impostazioni UPS extra

source: Some UPS models have additional settings that can be configured using the ``upscmd`` command. To execute the command, the user must have the appropriate permissions.
it: Alcuni modelli di UPS dispongono di impostazioni aggiuntive che possono essere configurate utilizzando il comando ``upscmd``. Per eseguire il comando, l'utente deve disporre delle autorizzazioni appropriate.

source: Grant permissions to the user::
it: Concedere i permessi all'utente::

source: Check available commands::
it: Controllare i comandi disponibili:

source: Example to disable the beep::
it: Esempio per disabilitare il beep::

source: Troubleshooting
it: Risoluzione dei problemi

source: A common error is the permission denied when accessing the UPS device, for example you may see this error inside ``/var/log/messages``::
it: Un errore comune è il permesso negato durante l'accesso al dispositivo UPS; ad esempio, è possibile vedere questo errore all'interno di ``/var/log/messages``::

source: Another common error is upsd not being able to connect to the UPS, for example you may see this error inside ``/var/log/messages``::
it: Un altro errore comune è che upsd non riesce a connettersi all'UPS; ad esempio, è possibile vedere questo errore all'interno di ``/var/log/messages``::

source: Usually, this happens when nut-server connects to the UPS device before the device is ready. To fix this, the simplest solution is to reboot the firewall::
it: Di solito, questo accade quando nut-server si connette al dispositivo UPS prima che il dispositivo sia pronto. Per risolvere il problema, la soluzione più semplice è riavviare il firewall::

source: If you can't reboot the firewall, you can try to stop the nut-server: ::
it: Se non è possibile riavviare il firewall, è possibile provare a fermare il nut-server: ::

source: Then check if the driver can connect to the UPS device: ::
it: Quindi verificare se il driver riesce a connettersi al dispositivo UPS: ::

source: Expected output: ::
it: Output previsto: ::

source: In case of error, you may see something like this: ::
it: In caso di errore, potrebbe essere visualizzato un messaggio simile al seguente: ::

source: You could then try to reset the USB device: ::
it: Si potrebbe quindi provare a reimpostare il dispositivo USB: ::

source: Where ``002/003`` is the USB device ID found with ``lsusb``, ``002`` is the bus number and ``003`` is the device number.
it: Dove ``002/003`` è l'ID del dispositivo USB trovato con ``lsusb``, ``002`` è il numero del bus e ``003`` è il numero del dispositivo.
