Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/users_databases.po
Languages: it

source: Users databases
it: Database utenti

source: NethSecurity introduces support for two types of users databases: a local database and a remote LDAP database, enhancing user management capabilities. Users inside the databases can be used for VPN connections, including the :ref:`openvpn_roadwarrior-section`.
it: NethSecurity introduce il supporto per due tipi di database utenti: un database locale e un database LDAP remoto, migliorando le capacità di gestione degli utenti. Gli utenti presenti nei database possono essere utilizzati per le connessioni VPN, inclusa la :ref:`openvpn_roadwarrior-section`.

source: Only users with a password can connect to VPN by authenticating with a username and password. Users without a password can connect to VPN by authenticating with a certificate or other authentication methods.
it: Solo gli utenti con una password possono connettersi alla VPN autenticandosi con nome utente e password. Gli utenti senza password possono connettersi alla VPN autenticandosi tramite certificato o altri metodi di autenticazione.

source: Local database
it: Database locale

source: To create a new user, click on the :guilabel:`Add user` button to initiate the process. When configuring a local user, you should fill all the following fields:
it: Per creare un nuovo utente, fare clic sul pulsante :guilabel:`Aggiungi utente` per avviare la procedura. Durante la configurazione di un utente locale, è necessario compilare tutti i seguenti campi:

source: ``Username``: specifies the desired username.
it: ``Nome utente``: specifica il nome utente desiderato.

source: ``Display Name``: specifies the display name of the user. This field is optional.
it: ``Nome visualizzato``: specifica il nome visualizzato dell'utente. Questo campo è facoltativo.

source: ``User password``: specifies the password of the user. This is required only if the VPN is configured to use password authentication.
it: ``Password utente``: specifica la password dell'utente. Questo è richiesto solo se la VPN è configurata per utilizzare l'autenticazione tramite password.

source: ``Confirm password``: specifies the password of the user, make sure to match the password with the one specified in the previous field.
it: ``Conferma password``: specifica la password dell'utente; assicurarsi che la password corrisponda a quella inserita nel campo precedente.

source: The local user database is implemented as UCI configuration file. Passwords of local users are stored in the Unix passwd format, ensuring compatibility and security in the local user database.
it: Il database utenti locale è implementato come file di configurazione UCI. Le password degli utenti locali sono memorizzate nel formato Unix passwd, garantendo compatibilità e sicurezza nel database utenti locale.

source: Users inside the local database can be granted :ref:`administrative privileges <admin_users-section>` on the web user interface by enabling the ``Administrator user`` option. The user must have a password set.
it: Agli utenti presenti nel database locale possono essere concessi :ref:`privilegi amministrativi <admin_users-section>` sull'interfaccia web abilitando l'opzione ``Utente amministratore``. L'utente deve avere una password impostata.

source: Remote databases
it: Database remoti

source: Subscription required
it: Subscription richiesta

source: This feature is available only if the firewall has a valid subscription.
it: Questa funzionalità è disponibile solo se il firewall dispone di una subscription valida.

source: When configuring a remote database, click on the :guilabel:`Add remote database` button and fill all the following fields:
it: Quando si configura un database remoto, fare clic sul pulsante :guilabel:`Aggiungi database remoto` e compilare tutti i seguenti campi:

source: ``LDAP URI``: specifies the LDAP Uniform Resource Identifier (URI), including the server address and port (e.g., ``ldap://example.com:389``).
it: ``LDAP URI``: specifica l'Uniform Resource Identifier (URI) LDAP, includendo l'indirizzo del server e la porta (ad esempio, ``ldap://example.com:389``).

source: ``Type``: specifies the type of LDAP server. The available options are ``Active Directory`` and ``OpenLDAP``. If OpenLDAP is selected, the remote server should respect the RFC 2307 schema.
it: ``Tipo``: specifica il tipo di server LDAP. Le opzioni disponibili sono ``Active Directory`` e ``OpenLDAP``. Se viene selezionato OpenLDAP, il server remoto deve rispettare lo schema RFC 2307.

source: ``Base DN``: specifies the LDAP Base Distinguished Name (DN), representing the starting point for searches in the LDAP directory (eg. ``dc=example,dc=com``).
it: ``Base DN``: specifica il Base Distinguished Name (DN) di LDAP, che rappresenta il punto di partenza per le ricerche nella directory LDAP (ad es. ``dc=example,dc=com``).

source: ``User DN``: specifies the LDAP User Distinguished Name (DN). If not present, the default value is equal to base_dn (eg. ``cn=users,dc=example,dc=com``).
it: ``Utente DN``: specifica il Distinguished Name (DN) dell'utente LDAP. Se non presente, il valore predefinito è uguale a base_dn (ad es. ``cn=users,dc=example,dc=com``).

source: ``User attribute field``: specifies the user attribute used to identify the user, this option is used by the OpenVPN road warrior server to compose the user bind DN. It should be ``cn`` for Active Directory or ``uid`` for OpenLDAP.
it: ``Campo d'attributo utente``: specifica l'attributo utente utilizzato per identificare l'utente; questa opzione viene utilizzata dal server OpenVPN road warrior per comporre il bind DN dell'utente. Dovrebbe essere ``cn`` per Active Directory oppure ``uid`` per OpenLDAP.

source: This field is used to authenticate users in the OpenVPN road warrior server. The authentication process is based on a LDAP bind operation which uses the user attribute field to compose the user bind DN with the user DN. Example: given a user named `jdoe` in the OpenLDAP directory, the user bind DN is composed as `uid=jdoe,ou=People,dc=directory,dc=nh`.
it: Questo campo viene utilizzato per autenticare gli utenti nel server OpenVPN road warrior. Il processo di autenticazione si basa su un'operazione di bind LDAP che utilizza il campo attributo utente per comporre il bind DN dell'utente con il DN dell'utente. Esempio: dato un utente chiamato ``jdoe`` nella directory OpenLDAP, il bind DN dell'utente viene composto come ``uid=jdoe,ou=People,dc=directory,dc=nh``.

source: ``User display name field``: specifies the user attribute containing the user's complete name like `John Doe`. Usually is ``cn`` for OpenLDAP and ``displayName`` for Active Directory.
it: ``Nome utente``: specifica l'attributo utente che contiene il nome completo dell'utente, come `John Doe`. Di solito è ``cn`` per OpenLDAP e ``displayName`` per Active Directory.

source: ``Custom user bind DN``: if this field is set, it overrides the calculated user bind DN used to authenticate users in the OpenVPN road warrior server. The field can contain a ``%u`` placeholder which is replaced with the username during the authentication process. Use this setting if you do not know if the user CN field contains the user full name, like ``John Doe``, or the username, like ``jdoe``. If the remote server is an Active Directory server, you can use one of the following values:
it: ``User bind DN personalizzato``: se questo campo è impostato, sovrascrive il user bind DN calcolato utilizzato per autenticare gli utenti nel server OpenVPN road warrior. Il campo può contenere un segnaposto ``%u`` che viene sostituito con il nome utente durante il processo di autenticazione. Utilizzare questa impostazione se non si sa se il campo CN dell'utente contiene il nome completo dell'utente, come ``John Doe``, o il nome utente, come ``jdoe``. Se il server remoto è un server Active Directory, è possibile utilizzare uno dei seguenti valori:

source: ``%u@domain.local``: where `domain.local` is the domain name of the Active Directory server; inside the OpenVPN client, to authenticate the user use only the username like ``jdoe``
it: ``%u@domain.local``: dove `domain.local` è il nome di dominio del server Active Directory; all'interno del client OpenVPN, per autenticare l'utente utilizzare solo il nome utente come ``jdoe``

source: ``DOMAIN\%u``: where `DOMAIN` is the realm of the Active Directory server; inside the OpenVPN client, to authenticate the user use only the username like ``jdoe``
it: ``DOMAIN\%u``: dove `DOMAIN` è il realm del server Active Directory; all'interno del client OpenVPN, per autenticare l'utente utilizzare solo il nome utente come ``jdoe``

source: If the remote server is an OpenLDAP you can leave this field empty or specify it like ``uid=%u,dc=directory,dc=nh``.
it: Se il server remoto è un OpenLDAP è possibile lasciare questo campo vuoto oppure specificarlo come ``uid=%u,dc=directory,dc=nh``.

source: ``Bind DN``: specifies the LDAP Bind Distinguished Name (DN), representing the user used to bind to the LDAP server. For an OpenLDAP server, it's usually something like ``uid=ldapservice,dc=directory,dc=nh``, where for an Active Directory server, it's usually something like ``ldapservice@example.com`` or ``cn=ldapservice,cn=Users,dc=example,dc=com``.
it: ``Bind DN``: specifica il Distinguished Name (DN) di Bind LDAP, che rappresenta l'utente utilizzato per effettuare il bind al server LDAP. Per un server OpenLDAP, di solito è qualcosa come ``uid=ldapservice,dc=directory,dc=nh``, mentre per un server Active Directory, di solito è qualcosa come ``ldapservice@example.com`` oppure ``cn=ldapservice,cn=Users,dc=example,dc=com``.

source: ``Bind password``: specifies the password of the user used to bind to the LDAP server.
it: ``Password di bind``: specifica la password dell'utente utilizzato per effettuare il bind al server LDAP.

source: ``StartTLS``: enables StartTLS for secure communication with the LDAP server, it should be disabled if the LDAP URI is already using the ``ldaps://`` scheme.
it: ``StartTLS``: abilita StartTLS per la comunicazione sicura con il server LDAP; dovrebbe essere disabilitato se l'URI LDAP utilizza già lo schema ``ldaps://``.

source: ``Verify TLS certificate``: determines whether to enable or disable certificate validation, it must be disabled if the LDAP server is using a self-signed certificate.
it: ``Verifica certificato TLS``: determina se abilitare o disabilitare la validazione del certificato; deve essere disabilitata se il server LDAP utilizza un certificato autofirmato.

source: Suggested configurations
it: Configurazioni consigliate

source: The following configurations are suggested for the most common LDAP servers. When configuring the remote database:
it: Le seguenti configurazioni sono suggerite per i server LDAP più comuni. Durante la configurazione del database remoto:

source: ensure the LDAP server is reachable from the firewall. If the LDAP URI contains a hostname, make sure the hostname is resolvable
it: assicurarsi che il server LDAP sia raggiungibile dal firewall. Se l'URI LDAP contiene un nome host, verificare che il nome host sia risolvibile

source: replace the example values with the actual values of the LDAP server
it: sostituire i valori di esempio con i valori effettivi del server LDAP

source: for Active Directory, it's recommended to use ``Custom user bind DN`` to specify how the OpenVPN server should authenticate the user
it: per Active Directory, si consiglia di utilizzare ``User bind DN personalizzato`` per specificare come il server OpenVPN deve autenticare l'utente

source: You can access the NethServer 7 OpenLDAP without authentication:
it: È possibile accedere a NethServer 7 OpenLDAP senza autenticazione:

source: LDAP URI: ``ldap://ns7ldap.nethserver.org``
it: URI LDAP: ``ldap://ns7ldap.nethserver.org``

source: Type: ``OpenLDAP``
it: Tipo: ``OpenLDAP``

source: User DN: ``ou=People,dc=directory,dc=nh``
it: DN utente: ``ou=People,dc=directory,dc=nh``

source: User attribute field: ``uid``
it: Campo attributo utente: ``uid``

source: User display name field: ``cn``
it: Campo nome visualizzato utente: ``cn``

source: If you want to use authentication by entering Bind DN and Bind Password, remember to enable StartTLS.
it: Se si desidera utilizzare l'autenticazione inserendo Bind DN e Bind Password, ricordarsi di abilitare StartTLS.

source: To access NethServer 7 Samba Active Directory or Windows Server 2012 Active Directory, use the following configuration:
it: Per accedere a NethServer 7 Samba Active Directory o Windows Server 2012 Active Directory, utilizzare la seguente configurazione:

source: LDAP URI: ``ldap://dcserver.ad.example.com``
it: URI LDAP: ``ldap://dcserver.ad.example.com``

source: Type: ``Active Directory``
it: Tipo: ``Active Directory``

source: User DN: ``cn=Users,dc=example,dc=com``
it: DN utente: ``cn=Users,dc=example,dc=com``

source: User attribute field: ``sAMAccountName``
it: Campo attributo utente: ``sAMAccountName``

source: User display name field: ``displayName``
it: Campo nome visualizzato utente: ``displayName``

source: Custom user bind DN: ``%u@example.com``
it: DN di binding utente personalizzato: ``%u@example.com``

source: Bind DN: ``<user>@exampl.com`` or ``cn=<user>,cn=Users,dc=example,dc=com``, where ``<user>`` is the username of the user used to bind to the LDAP server
it: Bind DN: ``<user>@exampl.com`` oppure ``cn=<user>,cn=Users,dc=example,dc=com``, dove ``<user>`` è il nome utente dell'utente utilizzato per effettuare il bind al server LDAP

source: Bind Password: ``<password>``, where ``<password>`` is the password of the user inserted in the Bind DN field
it: Password di Bind: ``<password>``, dove ``<password>`` è la password dell'utente inserito nel campo Bind DN

source: The ``StartTLS`` option should be enabled for NethServer 7 Samba Active Directory, while it should be usually disabled for Windows Server 2012 Active Directory.
it: L'opzione ``StartTLS`` dovrebbe essere abilitata per NethServer 7 Samba Active Directory, mentre di solito dovrebbe essere disabilitata per Windows Server 2012 Active Directory.

source: The local user database is an inherent component of the firewall, it's available by default and does not require any additional configuration. It serves as a built-in user management system, allowing administrators to create and manage users directly on the firewall. It also integrates seamlessly with the VPN services, particularly the OpenVPN Road Warrior server,
it: Il database utenti locale è una componente intrinseca del firewall, è disponibile di default e non richiede alcuna configurazione aggiuntiva. Funziona come un sistema di gestione utenti integrato, consentendo agli amministratori di creare e gestire utenti direttamente sul firewall. Si integra inoltre perfettamente con i servizi VPN, in particolare con il server OpenVPN Road Warrior.

source: The administrator can extend the capabilities of the firewall by adding new remote databases. Remote databases allow the firewall to authenticate users against an external LDAP server, such as Active Directory or OpenLDAP.
it: L'amministratore può estendere le funzionalità del firewall aggiungendo nuovi database remoti. I database remoti consentono al firewall di autenticare gli utenti tramite un server LDAP esterno, come Active Directory o OpenLDAP.

source: Unlike local users, users in remote databases must be managed directly on the source LDAP server. Any additions, deletions, or modifications to user accounts should be performed on the LDAP server itself, as these changes will be reflected in the firewall configuration page but cannot be made from the firewall interface.
it: A differenza degli utenti locali, gli utenti presenti in database remoti devono essere gestiti direttamente sul server LDAP di origine. Qualsiasi aggiunta, eliminazione o modifica degli account utente deve essere eseguita sul server LDAP stesso, poiché queste modifiche saranno riflesse nella pagina di configurazione del firewall ma non potranno essere effettuate dall'interfaccia del firewall.

source: Also note that if the remote database is offline, VPN authentication will fail. It is crucial to ensure that the remote database is online and accessible to ensure proper user authentication through the VPN service.
it: Si noti inoltre che, se il database remoto è offline, l'autenticazione VPN non andrà a buon fine. È fondamentale assicurarsi che il database remoto sia online e accessibile per garantire una corretta autenticazione degli utenti tramite il servizio VPN.
