Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/wireguard.po
Languages: it

source: WireGuard is a modern VPN (Virtual Private Network) technology that utilizes state-of-the-art cryptography. It is designed to be faster, simpler, and more functional than IPsec and OpenVPN. WireGuard is a secure, fast, and easy-to-configure VPN solution that uses cutting-edge cryptography. It is designed to be simpler to configure than OpenVPN and to offer a lower attack surface.
it: WireGuard è una tecnologia VPN (Virtual Private Network) moderna che utilizza crittografia all’avanguardia. È progettata per essere più veloce, semplice e funzionale rispetto a IPsec e OpenVPN. WireGuard è una soluzione VPN sicura, veloce e facile da configurare che utilizza crittografia di ultima generazione. È progettata per essere più semplice da configurare rispetto a OpenVPN e per offrire una superficie di attacco ridotta.

source: NethSecurity provides a WireGuard server and client that can be configured from the command line interface.
it: NethSecurity fornisce un server e un client WireGuard che possono essere configurati dall'interfaccia a riga di comando.

source: Features:
it: Funzionalità:

source: Multiple WireGuard server instances can run simultaneously
it: È possibile eseguire simultaneamente più istanze del server WireGuard

source: Each instance operates in its own isolated network zone
it: Ogni istanza opera nella propria zona di rete isolata

source: Static IP address allocation for each peer (client account)
it: Assegnazione di indirizzo IP statico per ogni peer (account client)

source: Client configuration available as text file or QR code
it: Configurazione client disponibile come file di testo o codice QR

source: Site-to-site (net2net) connections supported
it: Connessioni site-to-site (net2net) supportate

source: Enhanced security with optional pre-shared keys
it: Sicurezza avanzata con chiavi pre-condivise opzionali

source: Standard WireGuard configuration file import capability
it: Funzionalità di importazione dei file di configurazione standard WireGuard

source: Current limitations:
it: Limitazioni attuali:

source: Supported networks are restricted to /24 subnet masks
it: Le reti supportate sono limitate a maschere di sottorete /24

source: Peer IP addresses are fixed and cannot be modified after creation
it: Gli indirizzi IP dei peer sono fissi e non possono essere modificati dopo la creazione.

source: WireGuard interfaces appear as "unknown interface" in the Network page
it: Le interfacce WireGuard vengono visualizzate come "interfaccia sconosciuta" nella pagina Rete

source: Quickstart
it: Guida rapida

source: The configuration is composed by the following steps:
it: La configurazione è composta dai seguenti passaggi:

source: Get good defaults to avoid conflicts with existing configurations
it: Ottenere impostazioni predefinite adeguate per evitare conflitti con le configurazioni esistenti

source: Create the server instance
it: Crea l'istanza del server

source: Add a new account (peer)
it: Aggiungere un nuovo account (peer)

source: The following examples use the ``ns.wireguard`` API to configure the WireGuard server and peers.
it: I seguenti esempi utilizzano l'API ``ns.wireguard`` per configurare il server WireGuard e i peer.

source: Get good defaults
it: Generazione di default appropriati

source: Before creating an instance, retrieve some valid defaults. Use the calculated defaults to create the instance:
it: Prima di creare un'istanza, recuperare alcuni valori predefiniti validi. Utilizzare i valori predefiniti calcolati per creare l'istanza:

source: Response example:
it: Esempio di risposta:

source: The response contains the following fields:
it: La risposta contiene i seguenti campi:

source: ``listen_port``: the port on which the WireGuard server listens for incoming connections, a firewall rule will be automatically created to accept the traffic on this port
it: ``listen_port``: la porta su cui il server WireGuard ascolta le connessioni in ingresso; verrà automaticamente creata una regola del firewall per accettare il traffico su questa porta

source: ``instance``: the name of the WireGuard server instance, this is also the name of the network interface
it: ``istanza``: il nome dell'istanza del server WireGuard, che corrisponde anche al nome dell'interfaccia di rete

source: ``network``: the network CIDR that will be used by the WireGuard server, the server will automatically get the first IP of the network
it: ``network``: la CIDR di rete che verrà utilizzata dal server WireGuard; il server otterrà automaticamente il primo IP della rete

source: ``routes``: a list of network CIDR that will be pushed to the clients
it: ``routes``: un elenco di CIDR di rete che verranno inviati ai client

source: ``public_endpoint``: the public IP address of the server, this is used to create the firewall rule to accept the traffic on the WireGuard port; the command will try to automatically detect the public IP address
it: ``public_endpoint``: l'indirizzo IP pubblico del server, utilizzato per creare la regola del firewall per accettare il traffico sulla porta WireGuard; il comando cercherà di rilevare automaticamente l'indirizzo IP pubblico

source: Before creating the instance, verify that the calculated defaults are correct:
it: Prima di creare l'istanza, verificare che i valori predefiniti calcolati siano corretti:

source: verify the public IP address, use a custom value if the automatic detection fails; a FQDN is supported too
it: verificare l'indirizzo IP pubblico, utilizzare un valore personalizzato se il rilevamento automatico non riesce; è supportato anche un FQDN

source: verify the network field does not overlap with existing networks
it: verificare che il campo di rete non si sovrapponga alle reti esistenti

source: Create an instance
it: Creare un'istanza

source: Create the WireGuard server instance using the calculated defaults:
it: Creare l'istanza del server WireGuard utilizzando i valori predefiniti calcolati:

source: The server will automatically get the first IP of the `network`, in this case `10.98.95.1`.
it: Il server otterrà automaticamente il primo IP della ``network``, in questo caso ``10.98.95.1``.

source: This is the public key of the server, it is used to create the client configuration.
it: Questa è la chiave pubblica del server, viene utilizzata per creare la configurazione del client.

source: Save and apply:
it: Salva e applica:

source: You can use the same API to change the configuration of the server instance.
it: È possibile utilizzare la stessa API per modificare la configurazione dell'istanza del server.

source: Create a new account, ensuring the ``account`` field is unique within the same instance:
it: Creare un nuovo account, assicurandosi che il campo ``account`` sia univoco all'interno della stessa istanza:

source: Options:
it: Opzioni:

source: ``route_all_traffic``: if set to ``true``, when the client connects, it will send all the traffic to the server. This is useful for ensuring all client traffic is encrypted and routed through the VPN. This flag should be set only if the client must access the internet through the VPN.
it: ``route_all_traffic``: se impostato su ``true``, quando il client si connette, invierà tutto il traffico al server. Questo è utile per garantire che tutto il traffico del client sia crittografato e instradato attraverso la VPN. Questo flag dovrebbe essere impostato solo se il client deve accedere a Internet tramite la VPN.

source: ``client_to_client``: if set to ``true``, the client will be able to communicate with all other peers and not only with the server. This is useful for enabling communication between clients in a mesh network configuration.
it: ``client_to_client``: se impostato su ``true``, il client sarà in grado di comunicare con tutti gli altri peer e non solo con il server. Questo è utile per abilitare la comunicazione tra client in una configurazione di rete mesh.

source: ``preshared_key``: if set to ``true``, automatically create a pre-shared key that will be used in the peer downloaded configuration. This adds an additional layer of security by requiring a shared secret for communication.
it: ``preshared_key``: se impostato su ``true``, crea automaticamente una pre-shared key che verrà utilizzata nella configurazione scaricata dal peer. Questo aggiunge un ulteriore livello di sicurezza richiedendo un segreto condiviso per la comunicazione.

source: ``ns_routes``: a list of network CIDR, automatically routes the networks to this peer; this is used for site-to-site (net2net) connections, allowing the server to access multiple remote networks through the VPN.
it: ``ns_routes``: un elenco di CIDR di rete, instrada automaticamente le reti verso questo peer; questo viene utilizzato per connessioni site-to-site (net2net), consentendo al server di accedere a più reti remote tramite la VPN.

source: Download the account configuration
it: Download configurazione account

source: The account configuration can be downloaded both in text format or a QR code and is suitable to be imported in a WireGuard client.
it: La configurazione dell'account può essere scaricata sia in formato testo che come codice QR ed è adatta per essere importata in un client WireGuard.

source: Download the text format if you want to configure a Linux machine or another NethSecurity:
it: Scaricare il formato testo se si desidera configurare una macchina Linux o un altro NethSecurity:

source: Output example: ::
it: Esempio di output: ::

source: Configure a mobile device
it: Configurare un dispositivo mobile

source: Many mobile WireGuard clients allows to import the configuration using a QR code:
it: Molti client WireGuard per dispositivi mobili consentono di importare la configurazione tramite un codice QR:

source: Once the app is installed, open it and import the configuration using the QR code:
it: Una volta installata l'app, aprirla e importare la configurazione utilizzando il codice QR:

source: Import the configuration to another NethSecurity
it: Importare la configurazione in un altro NethSecurity

source: When importing the configuration to another NethSecurity, the file must be base64 encoded. Print the configuration file in base64 to the console:
it: Quando si importa la configurazione su un altro NethSecurity, il file deve essere codificato in base64. Stampare il file di configurazione in base64 sulla console:

source: Copy the base64 string, than go the the other NethSecurity and execute:
it: Copia la stringa base64, quindi vai sull'altro NethSecurity ed esegui:

source: Remove an instance
it: Rimuovere un'istanza

source: To remove an instance, use the following command:
it: Per rimuovere un'istanza, utilizzare il seguente comando:

source: This command will remove:
it: Questo comando rimuoverà:

source: The WireGuard server instance
it: L'istanza del server WireGuard

source: The firewall rules that allow traffic from the WAN
it: Le regole del firewall che consentono il traffico proveniente dalla WAN

source: The VPN zone
it: La zona VPN

source: All associated accounts
it: Tutti gli account associati

source: Save and apply the changes:
it: Salvare e applicare le modifiche:

source: Remove a peer
it: Rimuovere un peer

source: To remove a peer use:
it: Per rimuovere un peer utilizzare:

source: The command will remove the peer and its configuration inside the users database, if present.
it: Il comando rimuoverà il peer e la sua configurazione all'interno del database utenti, se presente.

source: By default, WireGuard does not log anything. To enable logging on `/var/log/messages`, use the following:
it: Per impostazione predefinita, WireGuard non registra alcun log. Per abilitare la registrazione su `/var/log/messages`, utilizzare quanto segue:
