Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/wol.po
Languages: it

source: Wake-on-LAN (WoL) is a technology that allows a powered-off or suspended device to be remotely turned on by sending a special network message called a *Magic Packet* to its network interface. The EtherWake package provides a simple command-line utility to send these Magic Packets and wake up devices in the local network. On NethSecurity, EtherWake is available in the official repositories but it is not installed by default.
it: Wake-on-LAN (WoL) è una tecnologia che consente di accendere da remoto un dispositivo spento o in sospensione inviando un messaggio di rete speciale chiamato *Magic Packet* alla sua interfaccia di rete. Il pacchetto EtherWake fornisce un semplice strumento da riga di comando per inviare questi Magic Packet e riattivare dispositivi nella rete locale. Su NethSecurity, EtherWake è disponibile nei repository ufficiali ma non è installato di default.

source: The target device must support Wake-on-LAN (WoL) and have the feature enabled in its BIOS/UEFI and network card settings. Otherwise, it will not respond to Magic Packets.
it: Il dispositivo di destinazione deve supportare Wake-on-LAN (WoL) e avere la funzionalità abilitata nel BIOS/UEFI e nelle impostazioni della scheda di rete. In caso contrario, non risponderà ai Magic Packet.

source: Installation
it: Installazione

source: Install the package with::
it: Installare il pacchetto con::

source: These packages are not preserved during a system upgrade. For more info see :ref:`restore_extra_packages-section`.
it: Questi pacchetti non vengono conservati durante un aggiornamento del sistema. Per ulteriori informazioni, consultare :ref:`restore_extra_packages-section`.

source: Usage
it: Utilizzo

source: To wake up a device in the LAN, you must know:
it: Per riattivare un dispositivo nella LAN, è necessario conoscere:

source: the ``MAC address`` of the device to be powered on
it: l'``Indirizzo MAC`` del dispositivo da accendere

source: the ``NethSecurity network interface`` to which the device is connected (e.g. ``eth0``)
it: l'``interfaccia di rete NethSecurity`` a cui il dispositivo è collegato (ad es. ``eth0``)

source: The basic command is::
it: Il comando di base è::

source: Example::
it: Esempio::
