Repository: NethServer/nethsecurity-docs
Catalog: locale/*/LC_MESSAGES/zones_and_policies.po
Languages: it

source: Zones and policies
it: Zone e policy

source: Firewall zones categorize network interfaces, defining trust boundaries, while firewall rules dictate traffic handling between zones. Zones organize network segments, and rules enforce security policies by specifying conditions for permitted or denied actions. Together, they allow the definition and application of rules for network traffic within the firewall.
it: Le zone del firewall categorizzano le interfacce di rete, definendo i confini sicuri, mentre le regole del firewall determinano la gestione del traffico tra le zone. Le zone organizzano i segmenti di rete e le regole applicano le politiche di sicurezza specificando le condizioni per le azioni consentite o negate. Insieme, consentono di definire e applicare regole per il traffico di rete all'interno del firewall.

source: In a firewall system, zones and policies are fundamental concepts that help manage network security by controlling the flow of traffic between different segments of a network. A zone in a firewall represents a specific network segment with its own level of trustworthiness. For instance, a common setup might include zones like WAN (Wide Area Network) representing the external, untrusted network (usually the internet) and LAN (Local Area Network) representing the internal, trusted network (devices within a private home or organization). Each zone has its own set of security rules and policies that dictate how traffic can flow to and from that zone.
it: In un sistema firewall, le zone e le policy sono concetti fondamentali che aiutano a gestire la sicurezza della rete controllando il flusso del traffico tra diversi segmenti della rete. Una zona in un firewall rappresenta uno specifico segmento di rete con il proprio livello di affidabilità. Ad esempio, una configurazione comune può includere zone come WAN (Wide Area Network), che rappresenta la rete esterna e non affidabile (di solito Internet), e LAN (Local Area Network), che rappresenta la rete interna e affidabile (i dispositivi all'interno di una rete privata domestica o aziendale). Ogni zona ha il proprio insieme di regole di sicurezza e policy che determinano come il traffico può fluire da e verso quella zona.

source: Policies in a firewall define the rules and actions that determine how traffic is handled between different zones. These rules specify which type of traffic is allowed, denied, or monitored based on predefined security criteria
it: Le policy in un firewall definiscono le regole e le azioni che determinano come il traffico viene gestito tra le diverse zone. Queste regole specificano quale tipo di traffico è consentito, negato o monitorato in base a criteri di sicurezza predefiniti.

source: Default zones:
it: Zone predefinite:

source: **WAN (Wide Area Network):** represents the external, untrusted network (e.g., the internet).
it: **WAN (Wide Area Network):** rappresenta la rete esterna e non affidabile (ad esempio, Internet).

source: **LAN (Local Area Network):** represents the internal, trusted network (e.g., devices within a private home or organization).
it: **LAN (Local Area Network):** rappresenta la rete interna e affidabile (ad esempio, dispositivi all'interno di una casa privata o di un'organizzazione).

source: Accepted traffic:
it: Traffico accettato:

source: **from LAN to WAN:** traffic from devices within the LAN zone to the WAN zone is allowed, enabling internal devices to access the internet.
it: **da LAN a WAN:** il traffico dai dispositivi all'interno della zona LAN verso la zona WAN è consentito, permettendo ai dispositivi interni di accedere a Internet.

source: **from LAN to firewall itself:** traffic from LAN devices to the firewall itself is permitted, facilitating communication for various purposes.
it: **da LAN al firewall stesso:** il traffico dai dispositivi LAN verso il firewall stesso è consentito, facilitando la comunicazione per vari scopi.

source: **From LAN to LAN itself:** traffic between devices within the LAN zone is allowed, enabling internal devices to communicate with each other.
it: **Da LAN a LAN stessa:** il traffico tra dispositivi all'interno della zona LAN è consentito, permettendo ai dispositivi interni di comunicare tra loro.

source: Denied traffic:
it: Traffico negato:

source: **From WAN to firewall itself:** traffic from the WAN zone to the firewall itself is denied, preventing unauthorized external access attempts.
it: **Dal WAN al firewall stesso:** il traffico dalla zona WAN verso il firewall stesso è negato, impedendo tentativi di accesso esterni non autorizzati.

source: **From WAN to WAN itself:** direct communication between external networks (WAN to WAN) is denied, isolating different external entities for enhanced security.
it: **Da WAN a WAN stessa:** la comunicazione diretta tra reti esterne (da WAN a WAN) è negata, isolando le diverse entità esterne per una maggiore sicurezza.

source: In this configuration, the firewall regulates traffic between the WAN and LAN zones, allowing internal devices to access the internet and communicate internally while maintaining security by blocking direct external access to the firewall and preventing communication between external networks.
it: In questa configurazione, il firewall regola il traffico tra le zone WAN e LAN, consentendo ai dispositivi interni di accedere a Internet e di comunicare internamente, mantenendo la sicurezza tramite il blocco dell'accesso diretto esterno al firewall e impedendo la comunicazione tra reti esterne.

source: Default zones can't be deleted but the network administrator can change existing policies or create new zones.
it: Le zone predefinite non possono essere eliminate, ma l'amministratore di rete può modificare le policy esistenti o creare nuove zone.

source: Logging can be enabled for zones using the :guilabel:`Logging` option inside the ``Zones and policies`` page. By enabling logging, the network administrator can track network activity, identify potential threats, and analyze traffic patterns. Logging is limited to 5 entry per second by default. To change this limit, refer to the :ref:`logging-limits` section.
it: Il logging può essere abilitata per le zone utilizzando l'opzione :guilabel:`Log` all'interno della pagina ``Zone e policy``. Abilitando il logging, l'amministratore di rete può monitorare l'attività di rete, identificare potenziali minacce e analizzare i modelli di traffico. Il logging è limitata a 5 voci al secondo per impostazione predefinita. Per modificare questo limite, consultare la sezione :ref:`logging-limits`.

source: Guests and DMZ zones
it: Zone guest e DMZ

source: In addition to the default zones, the firewall can be configured with additional zones to accommodate specific network requirements. Two common examples are the Guest and DMZ (Demilitarized Zone) zones. Sometimes the Guest zone is also known as the blue zone while the DMZ is also named as orange.
it: Oltre alle zone predefinite, il firewall può essere configurato con zone aggiuntive per soddisfare requisiti di rete specifici. Due esempi comuni sono le zone Guest e DMZ (Demilitarized Zone). Talvolta la zona Guest è anche conosciuta come zona blu, mentre la DMZ è anche chiamata arancione.

source: Guests zone (blue)
it: Zona guest (blu)

source: The Guest zone represents a network segment for guest devices, such as visitors or temporary users. This zone is typically isolated from the LAN zone to prevent unauthorized access to internal resources. But it is allowed to access the WAN zone.
it: La zona Guest rappresenta un segmento di rete per dispositivi degli ospiti, come visitatori o utenti temporanei. Questa zona è tipicamente isolata dalla zona LAN per prevenire accessi non autorizzati alle risorse interne. Tuttavia, è consentito l’accesso alla zona WAN.

source: To create a Guest zone, follow these steps:
it: Per creare una zona Guest, seguire questi passaggi:

source: access the ``Zones & policies`` section
it: accedere alla sezione ``Zones & policies``

source: click on the ``Add zone`` button
it: fare clic sul pulsante ``Aggiungi zona``

source: enter **guest** inside the ``Name`` field, in this case the zone will be highlighted in blue
it: inserire **guest** nel campo ``Nome``, in questo caso la zona verrà evidenziata in blu

source: leave empty the ``Allow forwards to`` field
it: lascia vuoto il campo ``Consenti traffico verso``

source: select ``LAN`` inside the ``Allow forwards from`` field
it: selezionare ``LAN`` all'interno del campo ``Consenti traffico da``

source: enable the ``Traffic to WAN`` option
it: abilitare l'opzione ``Traffico verso WAN``

source: select ``Drop`` for both ``Traffic to firewall`` and ``Traffic for the same zone`` fields
it: selezionare ``Drop`` sia per i campi ``Traffico verso firewall`` che ``Traffico verso la stessa zona``

source: click on the ``Save`` button and apply the changes
it: fare clic sul pulsante ``Salva`` e applicare le modifiche

source: If the firewall is intended to provide ``DHCP`` and ``DNS`` services, create a firewall ``input rule`` allowing traffic on ports ``53 TCP/UDP (DNS)`` as well port ``67 UDP (DHCP)`` for the ``Guest`` zone. If these services are not required or provided by another device in this network, the corresponding ports can remain blocked.
it: Se il firewall è destinato a fornire i servizi ``DHCP`` e ``DNS``, creare una ``regola di input`` del firewall che consenta il traffico sulle porte ``53 TCP/UDP (DNS)`` e ``67 UDP (DHCP)`` per la zona ``Guest``. Se questi servizi non sono necessari o sono forniti da un altro dispositivo in questa rete, le porte corrispondenti possono rimanere bloccate.

source: DMZ zone (orange)
it: Zona DMZ (arancione)

source: The DMZ represents a network segment for servers and services that need to be accessible from the internet but isolated from the internal network.
it: La DMZ rappresenta un segmento di rete per server e servizi che devono essere accessibili da internet ma isolati dalla rete interna.

source: To create a DMZ, follow these steps:
it: Per creare una DMZ, seguire questi passaggi:

source: enter **dmz** inside the ``Name`` field, in this case the zone will be highlighted in orange
it: inserire **dmz** nel campo ``Nome``, in questo caso la zona verrà evidenziata in arancione

source: leave empty both the ``Allow forwards to`` and ``Allow forwards from`` fields
it: lasciare vuoti sia i campi ``Consenti traffico verso`` che ``Consenti traffico da``
